{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":0.72,"end":80.95,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'll be playing for you a discussion I had with Paul Vanderkly. This was the second discussion I had with him for people who do not know. Paul Vanderklay is a pastor, a reformed pastor in California, and he is also a commentator on this entire Jordan Peterson phenomena that is happening, how it also relates to other thinkers such as Jonathan Haidt, now more recently John Vervaeke. And so he's a very interesting person who's thinking very deeply and trying to understand this situation, this meaning crisis, you could call it, and how to find solutions out of this problem. And so we had a lot of fun discussing, in part, a continuation of the last two podcasts that I put up, the one about Santa Claus and the one about principalities. And it is a continuation of how trying to understand the manner in which the world lays itself out and how what we could call non physical beings, we can believe that they can exist in a manner which does not seem silly and superstitious. So please enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":91.19,"end":120.21,"speaker":"Paul Vander Klay","text":"Hi, this is Paul, and today I'm having a conversation with Jonathan Pageau. He probably needs no introduction to anyone who's subscribed to my channel. And a couple of weeks ago I sent Jonathan an email. I said with all the Sam Harris talk, I thought it might be fun if we'd do a conversation. Both Jonathan and I have been recently doing a lot of videos that have kind of been downstream from this talk. And so, Jonathan, I really appreciate your willingness to have a conversation today."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":120.53,"end":148.35,"speaker":"Jonathan Pageau","text":"Yeah, it's great to. It's great to talk to you again. We're doing this once in a while. It's nice. And yeah, I've really been appreciating your kind of constant taking it on so intensely, this whole discussion and talking with everybody and looking at everything. So, you know, although I don't watch every video because I think you put like a video out every single day, which is pretty intense. But once in a while I'll drop in and then I'll try to kind of follow where you are. So. So it's been fun to do that."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":148.67,"end":239.04,"speaker":"Paul Vander Klay","text":"Well, I appreciate it. And I've watched your last two Existence and Santa Claus videos and that's, you know, it's been interesting to me how we're both kind of chewing on this stuff. And, you know, I was thinking this morning thinking about this, how, you know, myself as a pastor, my vocation is to try to communicate God, who cannot be contained by our language in Verbal form. And of course, in Christian theology, the Bible is the word of God, and this is special revelation. And I was thinking about your vocation, not just as in Protestant talk, you know, a Christian artist, but an icon carver. And I thought that might be an interesting place to begin because, you know, I've heard both of us trying to communicate to an audience within our cultural context that says, well, if God isn't an object, then God isn't. And so I guess I kind of wanted to ask you a question. As an icon carver, how does this work for you? And I saw you. I thought, really, I saw you communicating about principalities and powers and using that as an avenue to talk about how God exists, the ontology of God, how God is real. And so I wanted to, you know, pick your brain on this a little bit more. So how, as an icon carver, does this. Does this connect with you?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":239.84,"end":460.64,"speaker":"Jonathan Pageau","text":"Well, I think, first of all, I think that one of the things that I have, maybe not as an icon, maybe, yes, as an icon carver or someone who views things in terms of images, is I tend to view. I tend to understand analogy pretty well. I think I tend to see the world with analogies. And so because of that, I can understand, I think, the manner in which God both transcends all representation, but then also fills the entire world with his presence. And so that's been really the double move that I've been trying to get people to see. You know, we see that in the work of Dionysus the Areopagite, and also in pretty much all of mystical Christianity, this notion that God is beyond all being, all representation, all word, all language, everything. There's no manner in which we can fully encompass God, but that also. And at the same time, and almost in a certain manner because of that, God fills the entire. In the entirety of all creation, fills everything and makes everything coherent and whole together. And so those two realities have to kind of always be held up at the same time because you get an apophatic move, which is this move of saying you can't represent God. And you see that now in the modern world, you see it all the time. People who say things like, we can't represent reality, but their conclusion is that therefore everything is arbitrary, Right? All our constructions are arbitrary. All our. The way that we organize society, all these things, your values, all of it, it's all arbitrary because we can't represent reality. And it brings up a certain type of nihilism. I think that, for example, existentialism has that problem. And a lot of postmodernism has that problem. But the right move is to do both is to say, yes, we can't. There's an apophatic move where the world, even the world itself, is beyond our capacity to fully compass it. God definitely is beyond our capacity to encompass his being or his over being or his essence. But at the same time, we can see these sparks of God, the presence of God in everything. So in terms of art, the theology of the icon is very specific about this, that we cannot represent God. And that's really important. That's one of the things that people tend to not understand about icons, is that we don't represent God. At least we're not supposed to. There are aberrations, you know, like. Like all human activity, there are aberrations which happen. But in the traditional icon, for example, up to, let's say about the 14th, 13th, 14th century, you actually don't even see images of God the Father at all. In Christian art, we only represent Christ even when we represent the creation of the world, even when we represent the last judgment. All these images, it's always Christ that is represented because the image of God appears through Christ and then ultimately through man as being the image of God. And so that is the way that we can do that double move where we say sometimes they'll represent the divine as just these kind of empty circles at the top of an image, like very abstract image, or just a hand or something, which just kind of suggests that there's something beyond. And you can't represent the actual face of God in his essence or God the Father even. And so it's that double move that is there that I think preserves the mystery, but then also shows us how the world lays itself out out of that mystery."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":461.92,"end":692.3,"speaker":"Paul Vander Klay","text":"You know, as I hear you talking on, you know, you mentioned how there is a. There is a tendency in the. There's a tendency towards skepticism. There's a deep skepticism in our current culture. And, you know. You know, I both listened to a fair amount of Don Hoffman, and those conversations are very interesting in terms of Don Hoffman coming at this from. From a Darwinian perspective and a scientific perspective that suggests that our limited capacity to just engage common reality, to just apprehend it. You know, my daughter took in this kitten, this feral kitten. And so. And I've got this old dog that's almost blind. And so the dog is trying to chase this kitten, and the kitten just jumps up on a chair, and the dog keeps sniffing around and can't find it. And I'm watching This. And I'm thinking about all the YouTubes I'm making. And I'm thinking, in many ways, this is a picture of us that we have limited capacity. And so when I think about God in terms of CS Lewis writing himself into the story, I think, for example, the burning bush story, where there's a physical representation, it's a miraculous physical representation, but then there's also a verbal representation, and in fact, the name is given. I am what I am, or I will be what I will be. And so, you know, to think that this. These are the tools God uses with Moses to introduce himself to a people that has forgotten him. And I think about Jordan Peterson's use of mythology, and I look at the number of people that are communicating with me and saying things like, you know, I. Now I'm not quite sure what God is, but I want to believe in a God, and I want to go down that path of seeking. And I think, so then I think, isn't this interesting how so many modernistic rationalistic apologists have been banging on a door a certain way, getting zero results, and this guy, whose Christian confession is complicated at best, suddenly moves the ball. And then I look at. And then, of course, you came into the picture. And I had seen a number of other people who were showing interest in Christian traditions that were far more symbolic than, let's say, contemporary Protestant apologists. And watching that happen and thinking this. This, to me, obviously, as a. As a believer and as a pastor, says to me, well, I think this is. I think this is a movement of God's spirit. As a Calvinist, you know, it's. Well, God's. You know, God moves history. This is not. We are not in control of history. God moves history. And this is a means by which God is using to do the work he's always done, which is call the rebellious people to himself. And it's interesting. How have we reached the end of this descriptive phase of our language? And in a sense, now perhaps as we've exhausted this means people don't know it consciously, but intuitively begin to imagine, you know, and then suddenly Jordan Peterson appears, who had been talking about this stuff for a long time. Suddenly the man and the moment come together and bang, off it goes."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":692.78,"end":860.96,"speaker":"Jonathan Pageau","text":"Yeah, it definitely seems. It's hard not to see an almost, you know, to use the word providence in the sense that it seems like Jordan just fell into this place and he's. He's kind of. He's taking up a space of something that was all building up for it to happen. And I think that we're watching it unfurl as it, as it happens. And it's pretty impressive to watch. But I think you're right when you talk about this notion of reaching the end of the purely descriptive. The problem which happens, and I think postmodernism plays a role in that as well to a certain extent. Because one of the things that postmodernism was able to show is that the purely descriptive, rationalistic way of looking at the world, it ignores language. It ignores language as if language just doesn't exist. But once you start to see how the structures of language and also how when you try to apply language to itself, you know, and the same thing happens when you try to now apply the tools of rationality to consciousness. Whoa. Some weird things start to happen because all of a sudden you realize that consciousness, even most of, like the new atheists, Sam is the one who's kind of standing apart. But I don't think he totally fully understands the, let's say the ramifications of his move is that they take consciousness for granted. They take the fact that here we are looking at the world for granted and that that's actually not part of the universe. So we're just, this is blind. Like there's no, almost as if there's no looker and there's just this universe. But once you start to notice the looker and then you start to pull out and see the looker looking at the universe, then that's what I've been arguing is that all of a sudden the hierarchy sets itself up again. It's inevitable because consciousness acts as this fulcrum which creates a hierarchy of attention, a hierarchy of being, a hierarchy of virtue, a hierarchy of value. All these things happen as soon as consciousness re enters into the picture. And so the science of consciousness and people like Don Hoffman are very fascinating to pay attention to because even though they might be doing it unwittingly, they're going, I think, to flip things in a certain direction in which we're going to be surprised very soon that it will be possible, and I think it's already possible to say things like angels and demons without people freaking out and thinking that you're talking about, you know, like multi dimensional beings or some kind of basically space aliens. I always think, like most modern people think that aliens are, that angels are space aliens, you know, Marvel Comics type, you know, Thor. That's what they think. But if you start to understand this hierarchy of consciousness and how they stack up, then it doesn't become that weird anymore to talk about these things?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":862.64,"end":873.11,"speaker":"Paul Vander Klay","text":"We'll talk more about that because. So, you know, one of the things that I was pursuing was Sam Harris is talking about his daughter's fascination with superheroes."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":873.5,"end":873.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":874.14,"end":891.74,"speaker":"Paul Vander Klay","text":"And I found that extremely interesting because as both of you use Santa Claus, I use Mickey Mouse. Mickey Mouse is real enough to continue to forestall, you know, copyright legislation in the United States. Because, I mean, Mickey Mouse is."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":891.74,"end":892.82,"speaker":"Jonathan Pageau","text":"Has effect in the world."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":892.82,"end":894.94,"speaker":"Paul Vander Klay","text":"Yeah, that's right. And so."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":894.94,"end":897.18,"speaker":"Jonathan Pageau","text":"But no, he's working to preserve his own identity."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":897.5,"end":901.42,"speaker":"Paul Vander Klay","text":"Exactly. He doesn't want the Chinese to get ahold of him."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":901.5,"end":902.06,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":902.28,"end":905.8,"speaker":"Paul Vander Klay","text":"And to do to Mickey what they've done for anyway."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":905.96,"end":906.52,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":906.6,"end":980.43,"speaker":"Paul Vander Klay","text":"So say, you know, because I think, when I think, when I come to this ontology. When I come to this ontology, part of the conversation, what always stands out to me is it's, in a sense, Jordan Peterson talking to the queer folks at the protest and say, well, I kind of wonder about your motivations because at heart, what I think people have an instinctive fear that we are not alone. And so you hear that both in terms of aliens, but the idea that there is a, you know, if a tsunami comes and wipes out a village and everyone says, well, that's just a force of nature. It's impersonal. People seem to be able to accept that better than to say, well, there is a sentient conscious force being God in the universe that willed this to happen. Somehow when personality gets involved, all of our motivations get redirected. And so when you talk about, you know, angels and space aliens, say a little bit more about that in terms of how you think, how they work in our imaginary."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":980.91,"end":1178.82,"speaker":"Jonathan Pageau","text":"Right. Well, yeah, sadly, I don't think right now they work in the right manner. I think that we. It comes with the same problem of taking consciousness for granted. You know, people are offended at the idea of speaking of God. I mean, like I said, God transcends personhood. That is definite. But personhood is part of God. That is, there is, you know, the notion that God is three persons is extremely important in terms of understanding what, you know, what a person is. And, and, and also, like I said, because we take consciousness for granted, somehow we're bothered by the fact that consciousness exists. It's so funny. People always, you know, people aren't offended by the idea that sometimes you hear people say, like, I believe that God is more. Or if there is a God, that he's more like a. Like a force, you know, like a kind of impersonal Thing. And you think so why. Why. Why does it bother you? Why does consciousness bother you? Why does it. Why does. Why do you think that intentionality doesn't exist? That it's a freak thing that exists only in human beings for some reason? You know, it's like there are patterns. There are patterns of being, and that's what personalities are, right? They're patterns of being. They're patterns that are coherent, and they're coherent in a way that they manifest a purpose. And so that's intentionality. And within us, we have several little smaller beings. We also have all these personalities inside us that have their own little coherences, not so much sometimes. And. And so I don't know why that's so weird to think because we're. We're not that obviously one coherent conscious being, that we're where we are but constituted with all these little co. You know, conscious consciousnesses. Why is it so weird to think that that would scale up? I don't understand why it's weird. And so I. That's why, for me, it's almost like a mystery. When I listen to people, it's all. I always think it's just because you don't understand what is consciousness. You also. You don't understand what constitutes a being, how a being is not obvious in terms of scientific analysis, that there really has to be something which pulls it together. And so to me, once we start to see that, then angels, the idea of angels, they just don't. They're not a big deal anymore. Like, they're as. And the idea of demons too. I mean, to me, demons are just principalities which are not united in this coherent hierarchy. And that's how the church fathers present them anyways, you know, so you have. You have some. Some. Usually it's aligned with a passion and makes sense because that's what it happens in us. You know, you have a person. You have a pattern inside you, you know, and this pattern kind of runs, and it has its own coherence. But what it does, it's. It's pulling you away from your central core. So it's making you, you know, resent something. It's making you hate your children. It's making you, like, whatever. Whatever pattern that is there, and you're fighting against it. You're trying to bring it in, and sometimes you can't, and it kind of pulls you. To me, that's just. It's a. It's a demon. It's a."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1178.82,"end":1179.06,"speaker":"Paul Vander Klay","text":"It's."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1179.06,"end":1325.96,"speaker":"Jonathan Pageau","text":"It's. It's a. It's a little demon that is pulling you. And if you read, like the mystics, they talk about demons, that you're full of demons, or that their demons are constantly. Either they say you're full of demons, or they'll say things like they're demons riding on you. Like you have demons riding on your back, like all these demons that are riding on you. And I think it's just an imagistic way of saying that you have these. These. These patterns which are pulling you into death, that are ripping you apart, that are decomposing you. And so you need to bring it together. And so there are cosmic. I think there are cosmic demons in it. In a city, you could have. You have certain patterns of behavior. Let's say. Let's say in a city, you'll have a pattern of behavior, which is jaywalking, where everybody jaywalks. I remember there was a story about Giuliani, about how everybody in New York was jaywalking. And Giuliani understood that that pattern of behavior, it looked like it was a detail, but it was actually manifesting a much deeper reality, which is that there was no social cohesion in New York City. And so he said, I'm going to exorcise this demon. And once it's exorcised, it's actually going to help coagulate the city, bring it together so that it has more cohesion. And so he went after jaywalkers and just gave dick. And at first, people were going crazy, like, what is he doing? Why is he attacking jaywalkers? But he kind of understood that we need to exercise these little demons so that the being can now come together. And so that little pattern of behavior, it was that everybody was doing it. It wasn't like people were talking to each other and say, oh, are you jaywalking? Oh, no. Are you jaywalking? Yeah, I jaywalk. No, nobody does. It just was. It was like this implicit pattern of behavior in the city. I mean, it could be littering. It could be all kinds of things. Once you let it go too far, then it's really hard to bring it back. Like, let's say once a civic pattern starts to manifest itself in a city where it's okay to break people's windows, let's say all of a sudden, it becomes okay to break people's windows. It's really hard to come back from that. And then things can degenerate into chaos. I mean, I lived in. In cities in Africa where the social fabric had been so destroyed by war and all kinds of crazy events that it was almost impossible to bring it back because everybody had these. All these little demons were kind of pulling the city into all these directions, and it was nearly impossible to bring it back."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1327.8,"end":1533.57,"speaker":"Paul Vander Klay","text":"I really like. So one of the things that I've done with. With trying to figure out Peterson and Harris was I talked about God aspect one and God aspect two, and I think your Giuliani jaywalking example is a terrific example of, let's say, God aspect one, and that even Brett Weinstein could say, okay, that use of God I can get into. That use of demon I can live with, I think. And I often, in terms of trying to communicate this concept in Pauline theology about principalities and powers, I often will talk about those types of things because I think highly secularized people can understand that, accept that that doesn't make them nervous. The representation of demon also has within it a personal agency thing. An example of this might be, let's say, and I often use the example of a marriage. A marriage is not a physical thing. I'd say, well, there's a document that says we're married. Well, that's a representation. There's a wedding ring. Well, that's a representation. No one who is actually in a marriage will deny that marriage is illusory. No, marriage is very real. Marriage governs behavior. A marriage has a high degree of ontology that in fact governs generations of persons and deeply forms, for good or for ill, children. And I mean, it's a. And people's lives. I mean, marriage is an enormously powerful thing. Marriage can sometimes feel like it has agency. And I think. But. But we wouldn't say, most of us don't name our marriages. You know, we just. It's just the marriage. Angels and demons have names implicit in the. In the fallen angel backstory of demons as characters in the Bible. I mean, these are centers of agency. And so when I think about the talk about angels and demons and especially God, the God aspect number two, that Sam Harris, I mean, Jordan Peterson is going through his axioms and Sam Harris stops him and says, I want to know about the God who doesn't want me to masturbate and a God who has a locus of agency, who also has power, unlike, let's say, the power that your marriage has to shape your behavior. Because I think as we try to represent what a marriage is in our mind, it's something similar to the culture of jaywalking at Giuliani breaks and the demon of jaywalking that Juliana uses to exercise a certain degree of chaos. From New York City. When I visited New York City in 2006, I hadn't been there since the 80s or the 70s where I grew up. I grew up just outside of it. And it was like, what is this place? Where's all the dirt? Where's the, you know, where did all these young, beautiful white people come from? This isn't New York City. And so, you know, you can see that in a city. And I thought you were represented that well. But there's this other aspect, number two, which is really the one that I think has the celebrity atheists and that community spooked and reactive to."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1533.81,"end":1765.15,"speaker":"Jonathan Pageau","text":"Yeah, well, okay, so I think that once again, the problem arises with again, the difficulty of understanding being and understanding consciousness. Again, it's the same problem. Let me give you an example. Within yourself, right? Do you think that those demons, let's say those little patterns, do you think they don't have agency? Of course they have agency. Right? They know what they want. They know exactly what they want. And you can, if you're sensitive, if you're a little bit attentive, you can see that you're actually talking to them, that you can, you can talk to your demons, you know, and you can, you make deals with your demons all the time, right? Imagine a smoker, right? So the smoker, what the demon wants is for that person to pretty much chain smoke all the time. That's what the demon wants, right? And so then you make a deal with the demon. You say, okay, I'm, I'm going to smoke, you know, like three cigarettes a day or like, whatever amount that you decide that you're gonna smoke. When you're doing that, you're, you're making, you're actually, you're, you're, you're negotiating with your demon, you know, and you're, you know that if you just let it go, if you just let the demon pull you out, like you would be smoking all the time. Or if you, if it's drinking or whatever, whatever desire, if it's just eating, you could just eat all the time because that's that pulling you. But you make a deal, you're like, okay, no, I'm going to, I'm going to negotiate with this. And so I think that it's the same, it's the same, it's kind of the same thing going up. I think that agency is just a pattern of, is a pattern of being. The problem with the manner in which we understand freedom is that we understand freedom as the capacity to do whatever you want. And I think that that's really a misunderstanding of freedom. Freedom is the. Freedom is the capacity to act from within your own self and not be fully, let's say, determined by your outer circumstance. Okay? And so that's what agency is. So that's what I. That's what I think freedom and agency are. And so if that's what freedom and agency are, then you can understand that a pattern has its own energy. Like it has its own will and its own thing. And so it has the capacity to act. To act. And then also because patterns are made of smaller patterns, it also has the capacity to manage those smaller patterns and then to. Not to let themselves get pulled in one direction or the other. So there is this. That was what I think is. That's kind of what I think agency is. And so to me, the idea that you can pray to. That you can pray to, like the angel of the city, it's like that's what you're doing when you. If you write a letter of complaint to the city council, like, who's the city council or who's the city? Like, you write a letter of complaint to the city, like, who are you writing it to? You're not writing it to anybody. You're writing it to the city. And so you're actually engaging. You're praying to the city. You're asking the city to do something for you. And we, you know, and it can answer. Does it mean it's going to answer? Might not answer. Might answer in a way you don't like it to answer, but it can answer. And so to me, it's. That's just kind of how. That's how it works. And so the idea that you pray to God or that you pray to other beings, that it be to the pastor. You pray to the pastor. You ask the pastor. I mean, people use the word prayer in such a special way."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1765.55,"end":1766.43,"speaker":"Paul Vander Klay","text":"I know, I know."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1766.51,"end":1772.15,"speaker":"Jonathan Pageau","text":"It's like, it's not. The word pray just means to ask for something that's an English issue."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1772.15,"end":1783.67,"speaker":"Paul Vander Klay","text":"I know, because in Spanish and in Greek and other languages, the words are commonality. But when you say it in English, I just know a lot of Protestants and my head are going, bing, bing, bing, bing."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1783.67,"end":1869.48,"speaker":"Jonathan Pageau","text":"Yeah, exactly. No, you don't. But you do all the time, right? You ask someone to help you change your tire. You ask, you know, it's. So you're constantly praying and beings answer your prayer. And so to me, the idea that you can pray to higher beings, you can ask for things, to me is just not a big Deal. And the fact that you can pray to God, to me, that you can pray, that you can address your prayer to the highest, let's say, I think is not a problem. I do think this is where maybe you. You will totally disagree with me. But I do think that often, because the word God also is so wide, I think that often when someone prays to God to ask God for some very petty thing, I think usually they're not really praying to God. They're actually. They're praying to something that's lower. They just don't. They just don't totally know. You know, it's like. So that's maybe the more kind of. The more, let's say, idea of a Catholic person who would ask, you know, some saint to find a parking place for them or something like that, you know, that's really a very kind of petty, you know, very kind of petty, low thing. But it doesn't mean that it's not. It's not also possible. It. We don't understand the. We people don't understand. Like, again, it's always taking consciousness for granted."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1869.48,"end":1869.8,"speaker":"Paul Vander Klay","text":"It's."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1869.8,"end":1896.93,"speaker":"Jonathan Pageau","text":"It's not understanding the manner in which consciousness, which language, which logos participates in how the world lays itself out. You know, it does participate in how the world lays itself out. Whether, you know, to what extent it does. What's the limit of that? Is not. Is not. That is not that easy to determine. I think I might be pushing you a little bit too far there. Oh, no, no, no, no."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1896.93,"end":1903.06,"speaker":"Paul Vander Klay","text":"I like getting pushed. Trust me, you don't. People when they push me, think I get upset, but I."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1903.3,"end":1905.06,"speaker":"Jonathan Pageau","text":"No, no, I've never seen you get upset."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1907.38,"end":1969.96,"speaker":"Paul Vander Klay","text":"So there's just so many interesting. There's just, you know, there's so many interesting things that popped in as you were answering. One of the things is obviously the connection between. Between this experience of freedom that we have, this experience of choice, this experience. I mean, one of the things when you. Going back earlier in the conversation when we were talking about God being beyond being, one of the theological conversations that then crops up is that within, let's say, a distinction between, say, a Christian conception of the world and let's say a Hindu conception of the world is in the Christian conception there is God and not God. It is. It is the existence of not God. That is. That is basically the. And that Hinduistic conception, to the degree that I understand, it lacks. Yeah, but what's that?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":1970.12,"end":2190.87,"speaker":"Jonathan Pageau","text":"I was gonna say, but at least in the orthodox tradition, we do have this notion of the divine energies which Is, which is extremely important, grace. In the orthodox tradition, this notion of grace is seen as God himself. That grace is God. And so the grace which underlies the world, which is at the root of all manifestation, are these divine energies. That is these we use the word. The word energies, obviously is to too bad that we still use that word because it's so ruined. The will or the wills of God are underlying all of phenomena and they can actually transfigure phenomena so that eschatologically. Right, in the totality of all things, God actually fills all things. So it's not to say that it's not what we usually make the distinction, at least in orthodox theology, between essence like the divine essence. We don't share God's divine essence, but we participate in God through participation. We become God through participation. And that's a way to create that absolute separation, like you said, between, let's say the ultimate infinite and manifestation. But there's also this eschatological reality, which is that all things are called ultimately to be transfigured and full of God and to kind of enter into God and participate in God's I would say being. I use the word being here in the sense that the way that God outpours into everything, but not in his essence, that's kind of the way that is presented. But I agree that it is different from the kind of emanationist theories that you see in Gnosticism and you see also in Hinduism. And the problem with emanationist, like the emanationist theories is that because they have this notion of emanation, they almost necessarily have to see a diminishing. So they have to see, as you move down, let's say, the hierarchy of manifestation, you have to see it almost as if it becomes evil in itself. Right? And so that's why the Gnostics will see the material world as being evil. Because of this emanationism, then it's like the things that are lower on the hierarchy actually have to be evil. Let's say the great innovation or the great, let's say realization of Christianity is that this separation between God and creation is what makes everything good, is what makes everything good in its higher, let's say, in the manner in which it points to God. Right? It makes it good. And so even the humblest thing we do not have in Christianity, the idea that someone who is poor is. Is cursed by de facto, is somehow lesser, is somehow containing less of that oomph, that kind of ontological oomph. We don't believe that. We believe that all things participate in. Can participate in God and can be transfigured, no matter where they are, on that kind of social hierarchy. And that's a big difference, I think it's a huge difference."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2191.27,"end":2220.94,"speaker":"Paul Vander Klay","text":"Well, I think that's right. I don't know. I mean, part of the poverty of living in the west has been not an insufficient education in. And I'm sure your orthodox theology is at least as diverse and broad as the Western tradition. How does Hell then function in the system? In Orthodoxy."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2223.32,"end":2364.06,"speaker":"Jonathan Pageau","text":"There are different. Obviously, there's different theories, there's different ways to look at it. I mean, sometimes hell is definitely represented as a kind of eternal punishment, that kind of manner in which it is. But the most popular, I would say, at least in my circles, at least in the circles of people I read and the people that I engage with, the most popular manner in which we understand Hell is that the first fire of hell is the fire of Pentecost. Those two fires are the same. And so hell is the fullness of the presence of God in all things. That's what hell is. The difference is that for those who have opened themselves up, for those who have opened themselves up to the grace of God, then that grace becomes transfigures. Whereas for those who have closed themselves off, have attached themselves to their resentments, to their passions, to the. To those things that decompose them, then that fire burns them. I always use the example of. I always use the example of how if I, you know, if I do something horrible to you, you know, I do something really, really despicable to you, and I do it, you know, with all the spite that I can do it with. And your answer to me is this pure love, just pure, unadulterated love and forgiveness and openness. Now, when I encounter that I can do two things, right, I can repent and kind of enter into your love and be transformed by it, or I can just close myself off even more. And then that love that you're showing to me becomes. It burns me, right? It's fire burning coals, holes on my head, like St. Paul says. And so that's really the manner in which it's usually talked about. So there's this kind of. If you look at the eschatological reality, like the total reality, it represents all that in us right now, even all that in us right now that is resisting to be transformed by grace. It's burned by the presence of God. That's what burns us. Even. Even our guilt. All that stuff Inside us, it's actually God. It's actually the love of God that is burning us. And so that's really the way that it's presented."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2364.22,"end":2452.86,"speaker":"Paul Vander Klay","text":"And there is, in your representation of it there, a fairly strong necessity of agency there, because there is a center, there is an agent with choice who is deciding, do I give up? CS Lewis, lay down your arms. Do I give up my hostility and my bitterness and my resentment, or do I give that up and open myself up to this love and therefore accepting and receiving the embrace of this other agent, of this other agent whose will and capacity and resources are far beyond mine, who yet in it's even, in a sense, an expression of his mercy that he allows my agency to exist apart from his own. It struck me. So, of course, Peterson, with the David Fuller conversation. I wanted to know, I don't know if he. We were discussing at our meetup last night, if my characterization of some of what I hear from him as stoicism triggered him a little bit, but maybe I'll have a chance to ask him that sometime. But then he, you know what's on. If I'd been listening, I'd know it's the city of God on the hill, which really made me laugh."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2453.02,"end":2453.5,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2453.66,"end":2549.37,"speaker":"Paul Vander Klay","text":"But his description of that, of maximal responsibility. When I heard that description, I thought much more of something in terms of what you just described, because at this point, people will often say, well, what kind of a God would seeing him kill me? And when people say that, I think you don't. We could use the consciousness language. You don't really understand what it's like to be in the presence of a being that changes how you look at yourself. We have this in foundational relationships with, let's say, parents or authority figures or people that we wish to emulate and we desire to be like you. Turn that all the way up to infinite in the presence of God. And the light and clarity of his being exposes all of our insufficiencies, which then puts us in a place where we now have an existential crisis in terms of our identity and our agency and every aspect of our being. And so when I thought of, okay, you dragged that cross up the hill, and now you're forced to be accountable for all of your use of agency in your life. When I heard that, I thought, well, you're talking Judgment Day. You're talking standing in the presence of God and all that that would mean. And I would think if a good number of people know that that's what awaits them at the Top of the hill. They're gonna stay in the basement, play video games."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2552.25,"end":2601.41,"speaker":"Jonathan Pageau","text":"That's hilarious. No, I. But I think. Yeah, I think that for sure, when Jordan use the term City of God, I also was surprised because I never heard him use it before. But then when I. You sent me text from maps of meaning which. Which talks about the City of God and his description of it. Well, then the description that he talks about, I have seen him talk about it. This notion of this city which is, you know, that is the representation of order, but order in a manner which is also open, or let's say, looking out towards chaos and not being completely secluded, but at the same time, that is together and looking towards truth and looking towards responsibility, like you talked about. And so, yeah, I think that for."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2601.41,"end":2601.73,"speaker":"Paul Vander Klay","text":"Sure."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2603.81,"end":2767.03,"speaker":"Jonathan Pageau","text":"There is something. And it's also. There's something. There is something kind of stoic about that, in the manner that. One of the things that seems to be missing is this is the glory, let's say the participation in the glory. And that is something that at least if you look at the mystical tradition and you look at this transformative tradition of what it means to be Christian, that you're meant to become. Yes, to do that. Exactly what he said. To take your cross, to bear responsibility. You know, there's all this tradition also, even in all these Orthodox stories about how people will take upon themselves even the, you know, the fault of others. You know, there's all these wild traditions. I was looking at, at one pretty crazy tradition today about. I forget. It's horrible that I don't remember her name. It was some Russian aristocrat who had heard that one of the priests in her city was having an affair with a prostitute. And so she went straight to his house, into his room, entered the room, took the prostitute, kicked her out of the room, and then got on her knees and said, father, I need to confess my sins. I was like, you know, it's like that. That. That's the City of God. It's like, oh, my goodness, you know, she knows exactly what's true, and she goes to the end of it, and then she takes it back on herself and says. And supposedly then the priest totally got converted and left. Horrible ways. But you see that St. Francis does that, too. There's stories of St. Francis doing that, too, where. Where someone asks him, what about this priest who's living with a woman? And he kind of says, I don't even deserve to kiss this man's feet. And he gets on his knees and he kisses the priest's feet and the priest's like, no, don't do that. You're killing me by doing that. And so there's this crazy transformation. And so I think that there's something really powerful about that. But then I think what's missing is also then this glory that you find in the lives of the saints. This. There's also this joy, right? This joy that comes, this surprise of joy that kind of comes in and fills the person in kind of indescribable joy. Or in a kind of. The Orthodox, they often talk about joyful sadness, like this strange mix of joy, but also an awareness of all the suffering and all the. The difficulties of the world at the same time. Those two things join together. So, yeah, so I think that that's maybe what's missing."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2767.83,"end":2853.26,"speaker":"Paul Vander Klay","text":"Well, it's, you know, even if you're. Let's take the representation of dragging something up a hill. Someone in my meetup last night brought up Sisyphus, of course, because you bring it up the hill and then it goes back down, and that isn't there. Is, you know, the reason, you know, with all of Jordan's stuff about mapping meaning and all of this, I mean, the reason that dragging that thing that cross up the hill gives the experience of meaning is obviously because there's meaning built into the world in which you are acting. And that when you get to the top of the hill, there is joy. There's joy of accomplishment. And Peterson himself talks about the Nazis, you know, making people take sacks back and forth in order to completely destroy meaning. So it's. Yeah, I also thought, you know, not only was there Judgment day at the top of the hill, and a number of people mentioned joy, but, you know, one of the things that I'm planning on that then sent me to Plato and Augustine because, you know, person has a city and that then brought me back to your principality. That, in a sense, what Giuliani does by finding jaywalkers is make it the city of Giuliani. But Giuliani. Hate to what Giuliani has done with himself. Now I know."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2854.3,"end":2856.7,"speaker":"Jonathan Pageau","text":"Too bad. Too bad. We have to use him as an example."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2858.38,"end":2860.14,"speaker":"Paul Vander Klay","text":"You had to bring up Giuliani."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2860.14,"end":2861.82,"speaker":"Jonathan Pageau","text":"He had his moment. He had his moment."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2861.9,"end":2877.03,"speaker":"Paul Vander Klay","text":"That's right. He had a moment. So here's a question for you. Now, myself as a minister, people will listen to me and say, well, Pastor, it's your job to try to make people Christians. Why do you want people to believe in God?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":2878.23,"end":3167.43,"speaker":"Jonathan Pageau","text":"Why do I want people to believe in God? It's funny, I Don't see it that way. Like, I don't. I think that the idea that people don't believe or believe in God, to me, is so kind of irrelevant, because I think that not irrelevant, it's kind of horrible that I'm saying that people will be like, what is he talking about? It's just that I don't know what you mean. Like, I also don't know what you mean when you say that they believe in God. To me, it has to be more than just believing God. It has to be an entering onto a path, right? Entering onto a. A path of life. And that's what matters, right? What is it that it says, even in Scripture, that the devil believes, Satan believes in God and he trembles. And so it's not just about believing God, but really entering on that path. And so I believe that that path of coming together, of turning together, of celebrating the right thing, of praising the right thing, of moving towards the right thing, I see it as the solution to our personal problems, to our family problems, to the community's problems. I see it basically as the way in which things will come together and have purpose and meaning and not be constantly decomposing. And so to me, that's what my whole purpose is. That is to help people see the coherence and the beauty and the power of this path, which is the. Which is the, you know, the Christian. The Christian path. And so it's more. So it's more to me than just believing in God. That's why I almost never. I mean, sometimes I do, but I rarely talk about God because I don't know. You know, it's like I'd rather kind of try to show you the transformational aspect of Christianity, try to show you how it transforms the world, and hopefully then it'll give you a glimpse of this divine mystery. But it's very difficult for me to talk directly about God. I tend to not want to do that too much. In some of the Q and A's, people are always asking me questions about the Trinity. Then I'm answering. As I'm answering these questions, there's a little voice in my head saying, shut up, Jonathan, shut up. Don't talk about the Trinity. Don't talk about that stuff. It's not because it doesn't. Because a lot of. Especially the Trinity, so many of those words have been so ruined. Like, they're so ruined. You need. There's a mile. You have to walk a mile before you even get a sense of what they're talking about. There's a lot of stuff in trinitarian theology that I trust because I trust the Fathers and I trust the Church. But there's a lot of stuff that I don't understand. Like I don't. Okay, so the sun is. Why am I talking about this again? The Spirit proceeds, but the sun is, is engendered. And it's like, I don't. I guess it's not. I mean, I don't totally, you know, I don't completely. I don't understand, at least rationally I can't talk about it. You know, I can talk about a lot of other stuff, but that, that particular thing I'd rather, for now at least I'd rather it kind of stay in a. Let people get there when they, when they get there. And the people that are watching my videos, I think, I think most of the people are kind of coming wide eyed and now trying to see this, you know, what is going on. And so I'd rather talk about. Rather talk about patterns and beauty and how Christ. I talk about Christ. That's basically what I talk about most of the time is talk about how Christ brings everything together. And so, yeah, that's been. I don't know, I can't totally explain it, but I really struggle to think. I totally understand when Jordan. That's why I have so much sympathy for Jordan when people ask him, do you believe in God? And he's like, I don't want to answer your question. I don't want to answer that question because that question is so loaded and it's so perverse that if I answer it, you won't understand it because if I just say yes, then you won't know what I'm talking about. And so I'd rather not answer it. I'll talk about all this other stuff. But then secretly, you know, obviously it's like I keep telling. It's obvious that Jordan believes in God. He said it in so many ways. He just doesn't want to say it that way because he knows that especially the people asking to. That they have ulterior motives. They either want to know if you're on our side. Like, are you on our side? Are you one of us or are you one of them? Are you one of those guys? And he's like, I don't want to play this game. I'm not interested. So, yeah, I think I'm kind of also avoiding that. I'd rather just. Yeah. Anyways, sorry, enough about that."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3167.43,"end":3213.78,"speaker":"Paul Vander Klay","text":"No, that was wonderful. That was fascinating. You know, when I was watching your Principalities. When you're going through the principalities and powers which I really appreciated how you lined that up. I was really struck where we're talking about in Judah, in Reuben, in Issachar, and the, I mean the dominant. The dominant. The synoptics use kingdom of heaven, John uses eternal life, Paul uses in Christ. And you know, you were setting that up with your, you know, with your, with our internal demons. And I thought that, I thought that, you know, again, pastors push back on Jordan Peterson. We are liars, but we're really more thieves because, you know, you were setting that thing up. I'm going to steal that from Jonathan."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3213.78,"end":3214.62,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3216.94,"end":3229.98,"speaker":"Paul Vander Klay","text":"But you didn't, you know, now mentioning, you know, you want them to see Christ. That's interesting because I was listening to you go through. Okay, he's just setting himself. He's just setting us up for in Christ. And he didn't go there."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3230.14,"end":3230.54,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3231.42,"end":3231.82,"speaker":"Paul Vander Klay","text":"Why?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3232.3,"end":3270.29,"speaker":"Jonathan Pageau","text":"Oh, well, that's the thing. I'm revealing my secrets here. That's the thing is that the whole manner in which I speak and I think the whole way I wish I speak is I want most of the time I want you to kind of say some things, bring you. And then. Because the problem with. And then let you make that next step because sadly we've heard the name of. We've heard preachers go. Go at us for too long. Like not, not you. You're. You're good. But you know that, you know what I mean?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3270.29,"end":3271.25,"speaker":"Paul Vander Klay","text":"All those other bad."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3272.21,"end":3510.74,"speaker":"Jonathan Pageau","text":"We've heard them. We've come at us for too, for too much and, and to just want you to, you know, like, if you believe in the name of Jesus, you know, and all that stuff. And, and it's, it's come to a point where it doesn't mean anything anymore. Doesn't mean anything. You know, believe in Jesus and you'll be saved. I don't know what you mean by believe. Not sure what you mean by Jesus and saved for sure. I don't know what you're talking about. Okay, so all those things like. I don't know what you're talking about. And so I'd rather talk about. Bring people like, bring people into them, into that kind of mystery and then let them see for themselves where it, where it goes. And so I'm, that's why I'm being. I am always very careful in the way that I talk about this stuff because. Yeah, because of that. And I think a lot of it's been ruined. So let's help people understand the words. And then slowly, you know, I always tell people I hope that what I mean, my hope, and I've said this in my videos before, that my hope is that one day most people will be able to say, our Father who is in heaven. And they won't have to explain it anymore. They won't have to say, but for now, you need to understand why we say father. You need to understand why we say heaven. You need to understand all that stuff. And at some point, I mean, I do it, I can say our Father was in heaven and not flinch at all, because I don't. I feel like I'm enough in the story that it's fine. But that's my hope, you know, and so that's my hope for Jordan too, is that he sets up this whole story about how, you know, this bottom up structure of how the Father, you know, that we've create, we've kind of all these images of different fathers have come together into this like essential image of the Father and kind of doing this bottom up thing until we realize that there is this image of the heavenly Father, you know, it's part of our. It's built in us, you know, this image. And so now I don't have to say that all that stuff. You don't have to say that anymore. You can just say, our Father who is in heaven, hallowed be your name. Do you see what I'm saying? That's what I want. That's what I want. That's kind of my. That's what I think I need to do, is to talk about those things first and then we'll get there slowly. I mean, already like the stuff about angels and principalities, you know, I've been making these videos for like a year and I've been wanting to talk about this stuff for a year. And I kept saying, no, it's not, not yet, not yet. Don't talk about this. Then the Don Hoffman stuff started coming out, like, okay, this is the time's coming. Then Jordan and Sam had those discussions and Sam keeps talking about consciousness. So at some point I thought, okay, now's the time and I can talk about this stuff. Because I think people have enough. At least people have been watching my videos. They have enough foundation that they can hear me say these things without thinking that I'm talking about Marvel comics, superheroes. You live in other dimensions when I talk about angels. Because you go to a church. Even when I was growing up, people would say stupid things like that. They would say, I think angels are beings in Other dimensions? I don't. What are you talking about, other dimensions? My goodness. Science fiction. You know, it's like. Because we have Scientology and Mormonism and all these kind of really disturbing materialistic religions, and a lot of Christians, they have that too. They just don't. They don't. Sometimes it's not even conscious. But they think that demons are physical beings somehow, or that angels are physical beings, that they're not. They've never been. No one has ever thought they were. If you read the Fathers, they either say that they're immaterial or they say that they have subtle bodies. It's like. Okay, what does that mean, subtle bodies? Well, I can tell you. I can give you examples of subtle bodies. You know, it's like a story is a subtle body. You know, they're all forms of subtle bodies. You know, a city is a subtle body because it doesn't. You can't totally contain it. Like, it's not. It's not completely. So you have. You have different levels of bodies. Anyways, this is becoming a rant."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3511.38,"end":3521.22,"speaker":"Paul Vander Klay","text":"This is fun. This is fun. If I were a journalist, I'd feel like I got a scoop, you know, Jonathan Pigeot and the subtle bodies."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3521.22,"end":3523.06,"speaker":"Jonathan Pageau","text":"The subtle bodies. There you go."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3525.22,"end":3646.97,"speaker":"Paul Vander Klay","text":"You know, it's interesting to me because, you know, from our last conversation, I know a bit about your story in terms of, you know, growing up evangelical and. And listening to you, listening to your description of, you know, your boy. I gotta be careful with my words. But I'll just say your evangelist heart, your pastoral heart, you know, that's what I hear you say, you want people to say. To be able to say, our Father who is in heaven. And when I hear that, you know, I hear homecoming. I hear being at home in a relationship because to say, you know, to say our Father, well, that suddenly orients you with God and it orients you with your neighbor. Because it's not my father, it's our Father who is in heaven, hallowed be your name. Thy kingdom come, thy will be done on earth as it is in heaven. Give us the day. I mean, off we go into the prayer. So I. That really helps me. That helps me on a whole bunch of levels because, you know, for a long time I pester people because I obviously live within a Protestant tradition and in a diverse context where I'll have people coming from lots of different traditions, often African American churches, and they'll just throw out words like saved. And then if I'm in a Sunday school class, I'll usually stop them And I'll ask, well, what do you mean by that? And it becomes very clear. They don't have any idea what they're meaning by that. Or it's simply code talk for hell avoidance when you die. And then as a pastor, okay, now I'm going to start to poke around at these things and do a little because to gently begin to have, you know, that's what pastors do. So it's very interesting for. You're not going to sit here and make all these videos, you know, okay, you've got Patreon and this has opened new opportunities for you. But you as well as I, this isn't going to make either of us rich."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3649.29,"end":3650.17,"speaker":"Jonathan Pageau","text":"I think so."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3650.57,"end":3752.17,"speaker":"Paul Vander Klay","text":"And so what you are doing, what you are doing is coming out of your heart and it's coming out of the joy, the joy that you found. And, you know, and this isn't uniquely Christian. I mean, what Sam Harris is doing. I was just listening to you talk. I listened to the first, about a half hour of the first Vancouver talk where Peterson and Harris are kind of getting a lay of the land. I mean, Sam Harris very much means well. He wants, when you listen to him, when you listen to his heart's desire, he wants, in his own words, well, being for people. He doesn't want to see people hampered by what he calls superstition. And so he's got a plan for how this can be and this is the mission that he's pursuing. I have a mission. You have a mission. And it was helpful for me to hear. I thought you were just very transparent. Now, I'm sure you're going to take some shots for a variety of things that you said from certain corners of the church, and I expect that. But you're a big boy. You can take it. But it was helpful for me to hear your heart and to understand because you very much helped me see you and understand what's going on with you and what's going on with your videos. And, you know, I might, I might, I think if we, we could probably spend a long time talking about angels and demons because, you know, I think I've probably. I'm not quite sure. I haven't quite fully digested what, you know, where you're going with this and how I feel about it. But it was, it was very, very interesting. I think people will find it quite interesting, so."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":3752.97,"end":4002.84,"speaker":"Jonathan Pageau","text":"Well, yeah, well, I'm happy if people find it interesting. I think, I think that, that. I think for me, ultimately it's to help. For me, it's Ultimately, to help people see how beautiful, you know, our tradition is, how just how coherent and beautiful it is. Not in a scientific sense, but almost like this. Almost like this powerful, beautiful artwork, like this poem that has been. That has laid itself out in the Bible and then also then in the liturgy and in. In art and in architecture, all these things. It's just how beautiful is and what it points to, obviously. But. Yeah, but I know that most of the people that listen to me, they're not Christian. I'm not talking to. Most of the people I'm talking to are not, let's say that person that comes to church and maybe doesn't have a lot of education, that talks about heaven and talks about being saved and going to heaven in a very kind of naive and misunderstood way. It's funny because this is where Sam Harris would really be angry with me. But that person doesn't bother me much. He doesn't really bother me. Because even though their understanding might be a bit off, might be a bit naive and a bit kind of simplistic and sometimes even offensive, even sometimes they're on the path and that structure is doing for them what it needs to do, it's still doing. Even though they don't have the most profound understanding of what these words mean, the pattern that they're on, the path that they're on is still doing the work that it's doing. And the grace of God is acting in that person's life. And so I'm not talking to those people. So who I'm talking to are for people who are usually very intelligent, who have gone through college, who have studied, who have read, who have studied. And so they look at these words and they can't see a more profound meaning to them. They can't understand how profound these structures are and how deep they are. And so those are the people I'm talking to. And I want to help them to see what's going on so that at their level of intelligence, of knowledge, of study, they can perceive at least what this is about. Because they're not going to go for the. For the when I die, I'm going to heaven bit. They're just not going to go for it because it's not enough. You know, it's too. It's too. It's kind of naive and too simplistic. And so they need more. And I think that. I think that that's why people are been so attracted to Jordan Peterson, is because they feel like he's giving them more, that he's giving Them, some meat. Something that helps them to understand what is going on in these stories and in our tradition that we've laid aside. And so. And also. Yeah, because. And then what that does is it helps also these new atheist types to understand that their vision, their understanding of Christianity is at that level. Right. It's at my, like my aunts who dropped out of school in the ninth grade or whatever. That's at the level that their understanding is. And in a way, I keep saying that that aunt is fine, she's totally fine. But if you think that that's where it stops, then you're the problem. It's not her because she doesn't have the capacity to understand anymore. And that's totally fine because human beings have different capacity. And that person can be way more virtuous when way more full of grace and full of trust, you know, in, in, in the infinite than you do. Even though they don't totally understand these concepts. But I can, but I can understand that at your level, you need to. You need something that you can, that you can hold on to and grip onto to understand what this is talking about. So that's, I think that that's really been, that's been what I'm doing. That's who I'm talking to. And that's why, you know, people invite me to do talks. It's at universities. It's, it's always in places where talking to that crowd. So, yeah, hopefully it does. Hopefully it has a little effect."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4002.84,"end":4052.13,"speaker":"Paul Vander Klay","text":"I hope I know it's having an effect because, you know, I hear that and people who write me and they appreciate what you have to say. And I think of C.S. lewis's, you know what it praises Inner health made audible. And I think you're doing art and what you've just expressed, there's a joy in you and you want to share it. What's more, what's better than that? I mean, that's the best way to spend a life. You've been given gifts, you've been given joy. And whether you're doing your carving or doing your videos, you're sharing the joy that you have within the frame of reference and within what you've learned in order to share that. And it's a track with a particular audience. I've been doing most of the interviewing. I don't know if."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4052.61,"end":4053.45,"speaker":"Jonathan Pageau","text":"Yeah, what happened?"}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4053.45,"end":4056.61,"speaker":"Paul Vander Klay","text":"I put you kind of on this, what I like to do."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4058.53,"end":4064.93,"speaker":"Jonathan Pageau","text":"Turn there. But thanks. Thanks for that, Paul. I appreciate it. I appreciate your kind words."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4065.73,"end":4101.4,"speaker":"Paul Vander Klay","text":"Well, I know, and I, you know, we this. What we're doing on this YouTube is a new thing. And Peterson says this often, and I think he's dead on. Right. We have no idea what we're doing with this thing. We don't know the ramifications. We don't know where this leads. The opportunities that this has made for each of us are unique. And it is important to ask ourselves why. Because when I look in my heart, well, there's some noble reasons to do this, and there's a bunch of really crappy ones, too, I'm sure."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4101.8,"end":4103.72,"speaker":"Jonathan Pageau","text":"Yeah, that's for sure. That's certain."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4103.88,"end":4225.21,"speaker":"Paul Vander Klay","text":"And these, you know, these. This feeds some of the better angels of my nature, and this feeds some of the darker demons of my nature. And so it's. So we watch each other, and I watch you do this, and so part of me wants to know, okay, what makes Jonathan Dick, why are you doing this? You're an icon carver and you're making videos, and you're trying to explain. Do your best to explain why Santa Claus is real. Well, this is an interesting thing. And you're hoping to do this for. You're hoping to do this so that others can share in the joy that you found and to. I mean, the journey that you've had in terms of your. Your church journey has been, you know, and I think you said it very clearly when I heard you say, I want. I want them to be able to pray Our Father who is in heaven. And I think that for me, you know, that drew a picture of a pilgrim who has come home, of a son who has been restored to the Father, of a son who has been restored to the family. I think about Luke 15 and the parable of the prodigal son. So I've always seen your work as that of an evangelist. And I think, ironically, this is another debate we had last night at the meetup. Is Peterson's. Someone asked, is Peterson an apologist? And I thought, no, he's not an apologist. Like, I see a lot of Protestant apologetics being done, but he is in many ways an evangelist. He's in. You know, you call him Cyrus. I've kind of been working the John the Baptist thing with him because there's a resonance between John's message and, you know, hey, Roman soldiers, get your, you know, sort out your relationship with the hierarchy. But, yeah, so I don't know. I think it's cool. And I love to hear. I poke at you because I. And I'm really happy I did because I heard your heart, and it's A beautiful thing. So I appreciate that."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4225.69,"end":4275.77,"speaker":"Jonathan Pageau","text":"Yeah, but like. Like you said, too. I mean, I think that we struggle. I mean, I struggle. Like you said, we do this and then. And then, like, we get attention. Like, I'm getting attention for these videos and I'm getting people writing me and everything. And so, you know, keeping that ego down has been. Has been. Oh, my goodness, that's really tough. I have a. I have a. Definitely have quite an arrogance. I have a very. I have a strong streak of arrogance. I'm really trying to hold that back because sometimes it comes out, you know, oh, my goodness. Jonathan, take it down a notch. So, yeah, so confession has been good for me in terms of that just to deal with this pride thing and the attention. Hopefully that God will kind of keep me, you know, on the level and won't have to knock me down at some point if I get too cocky. So try to keep it at a key, keep it at the right level."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4277.37,"end":4280.01,"speaker":"Paul Vander Klay","text":"Anything else you want to go over today or you think we've."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4280.01,"end":4303.02,"speaker":"Jonathan Pageau","text":"No, I think. I think. I mean, I ended up speaking most of the time, so. Yeah, well, so, yeah, thanks for. I think we've actually also gone for like an hour and a half, which is probably long enough, but we should definitely do the next time, then I'll interview you. We'll just kind of. We'll trade off. You interview me, I'll interview you, like, one after the other. And so. And hopefully I'll come to see you at some point, I hope."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4303.02,"end":4390.96,"speaker":"Paul Vander Klay","text":"Yeah, I'd like to do a conference at some point and fly you out here. And I think that would be. I think that would be a lot of fun. There's. The impact of. The Eastern Church has been a latecomer to the American conversation, and America has been this. This melting pot, and it's become a neutral space in which different church traditions can communicate. And so one of my friends and colleagues in A neighbor, in a sister church up the road has a very deep relationship with an Orthodox priest, and so he's often bringing him into our circles. And I thought, boy, it'd be fun to have Jonathan out here. And he hadn't heard of you, so your head shouldn't be that big. But. But he hadn't heard of it. And the Orthodox. So one of the guys from my meetup is moving to Dallas, and he says, yeah, I found a Jordan Peterson meetup there, and it's run by an Orthodox father. And I thought, well, this will be an interesting meetup. When you get there, send me some reports. Because I want to know what those Jordan Peterson meetups look like. So that's funny. But God is doing, you know, God is doing a work that obviously, again, as a Calvinist, you know, what is God up to? I don't know. But in the words of Freddy Schuller, God is large and in charge."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4391.04,"end":4421.91,"speaker":"Jonathan Pageau","text":"And for sure, things are moving. And so that is for certain. And I think that people should pay attention. I think it's great that you're around paying attention and also kind of helping others to understand that we. It's best that we not ignore what's happening because there's definitely something going on. And so we need to be attentive and to speak into it as much as we. As we can. So, yeah. So thanks for doing what you're doing."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4422.31,"end":4426.15,"speaker":"Paul Vander Klay","text":"Well, thank you, Jonathan. And I'll just stop the recording now."}
{"episode_id":"SW - #037 - 2019-05-28 - Paul Vander Klay - Angels, Demons and the City of God","start":4426.95,"end":4482.82,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transforming into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
