{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":0.24,"end":10.32,"speaker":"Aidan Hart","text":"Before I met Jonathan in the flesh, I might have a photograph of Jonathan there in my living room. Jonathan comes in and he moves into the house. I don't need the photograph. You know, it's redundant. I've got Jonathan himself."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":10.56,"end":58.04,"speaker":"Jonathan Pageau","text":"And so there's a. It's interesting because, you know, I'm so bound up in the question of symbolism. But in the Orthodox, especially in the orthodox iconographic tradition, there's some aspect of it which is you could call anti symbolic in the sense that moving towards saying Christ is the finality of these images. And so when you have Christ, you're not necessarily wanting to represent him in these shadows, but you have the thing itself, doesn't mean that symbolism doesn't continue to exist in this typological way. There's a sense in which Christ is the end of the symbolic pyramid. This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":68.66,"end":248.98,"speaker":"Margarita Mooney Clayton","text":"My name is Margarita Mooney Clayton. I'm an associate professor in the Department of Practical Theology here at Princeton Theological Seminary. I'm also the founder and executive director of Scala foundation, which is a nonprofit whose mission is to renew culture through liberal arts, education, beauty and. And worship. I'm joining you here today from the studios at Princeton Theological Seminary, where I have the pleasure of hosting Aidan Hart, an iconographer born in England, raised in New Zealand, now residing in England, and Jonathan Pageau from Quebec, Canada, who is also an iconographer and icon sculptor. Both Aidan and Jonathan are here this weekend for the conference on Art, the Common Good and the Sacred, being hosted by Scala and Princeton Theological Seminary. And before we do that public event, I wanted to sit down with them and talk to the two of them as artists about how they think about the relationship between Scripture, image and symbol. Specifically, we're going to talk a bit about one particular icon, that of the Transfiguration. But before we jump into that particular icon, I wanted to say that for the class I'm teaching on aesthetics in Christian education, I read very carefully Aiden Hart's book, Beauty, Spirit and Icons in the Modern World. And what struck me about this book was this idea that images remind us that life with Christ is, above all, a relationship between persons. And in that book, Aidan explains that in the tradition of icons, it's both Christ's divinity and his humanity are supposed to be represented. So just as the words of Scripture are supposed to reveal to us who God is, so images are supposed to help us understand Christ's divinity and his humanity. Aidan also explains in this book some timeless principles of liturgical art. And those principles, let me see If I get these right, Aidan, I don't have them memorized, but I have them written down. One timeless principle of liturgical art is that. Well, what I just said, that God became man, the Incarnation. Right. So Christ showed himself as man. Second, that in the Transfiguration, which is what we're going to talk about today, we got a glimpse of divinized man. And I want to unpack what that means and what that looks like in the icons of the Transfiguration. You're taking on a big stance here theologically when you say that matter can be grace bearing. So I want to talk about that. And then you also say a fourth principle is that human beings are fulfilled in relationship. That's why it's important to see the faces of others. And fifth, the fifth principle of liturgical art is that we have what's called the nous, a noetic faculty, the eye of the heart, that we don't just know about God. With the nous, we can know God. Did I get those five principles right? Yeah, yeah, more or less, yes."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":249.14,"end":262.23,"speaker":"Aidan Hart","text":"The nous enlightened by the Holy Spirit, where no man can see God. So it's almost as though, Do I say God sees himself through the noose? So it's always a synergy, a union of the two. But yes, those five points are really important."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":262.39,"end":270.63,"speaker":"Margarita Mooney Clayton","text":"Well, let's stay on the noose that. Let's stay on the noose for a second, because this was a. I admit this was a new concept to me, the noose. How do you describe the noose, Jonathan?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":271.27,"end":340.29,"speaker":"Jonathan Pageau","text":"I think, I mean, the way to understand the nous, let's say practically, is to understand that there's a capacity that humans have to grasp things directly. Maybe the best way to understand it that is pre. Discursive. It's not a discursive. It's not a description. It's a contact that is direct and full. And so the nous is necessary for you to exist. But there's something about our thoughts and about our desires and about our passions that clouds us from being able to live in that space. And much of the spiritual practice in the Orthodox shirt, for example, is there in some ways to purify the nous, that is, to kind of still the thoughts, still the images, still buzzing and the whirring, so that we can enter into the heart. You know, he talked about the eye of the heart, enter into the heart, and then it's in that position that all of a sudden the news can be opened to revelation to the Holy Spirit, and then you can Grasp things directly, like you can see them pierced with God. But then ultimately the contention is that you can also, you know, see the divine light. You can enter into God himself."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":341.11,"end":440.47,"speaker":"Margarita Mooney Clayton","text":"Wow. See, okay, these are big claims. I do actually remember distinctly my senior year of college at Yale after I had taken classes in psychology and sociology. And I remember walking into church and thinking, this is a collection of rituals that human beings say mean certain things, and other people in other points of time have come up with rituals that they say mean certain things. And how do I know that any of these symbols or any of these rituals are actually anything more than a human creation? So when I read your book, now, I'm still a practicing Catholic, I always have been, but as I'm teaching my students about these images, the students might be captivated. Maybe their noose is being activated. They're having an encounter. But they're posing this question, how do I know that this image that I'm looking at is actually revelation? Or how do I know that it's not something from my imagination? But another thing I loved reading in your books, Aidan, is that working as an iconographer, you have a way of approaching this question about what do we depict in art and why? So that's what I wanted to talk to you about today. Can we just pick the two of you? Pick. I thought let's go with the transfiguration, because that figures so centrally in your book, Beauty, Spirit and Matter. And I wonder if we can unpack the event of the transfiguration, the encounter, the symbols, the meanings, and from there just have a conversation about how do we know when symbols come together to reveal who God is and. Or what's a human invention? That's a big question. I know, but let's start with the transfiguration. You know what happens at the transfiguration?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":442.31,"end":497.08,"speaker":"Aidan Hart","text":"Well, the Lord just going straight from the Gospels. Three of the gospels related ironically, the one of the three disciples, John, who was there, didn't write about it in his Gospel, but the other three gospels describe it. Christ takes Peter, James, and John up to a high mountain. It doesn't describe what the mountain is in the Scriptures, but by tradition, it's table. And this is that he's transfigured. And then Moses and Elijah appear with him, and they're conversing about his coming glory, which means his crucifixion. And then dear Peter, who always likes to blurt things out, says, lord, it's good to be here. Let's make three tents. And then the voice of The Father speaks, and then Moses and Isaac go, and they come back down again. So that's the basic story, but there's so much packed into that. I think that's one reason, because it's so pregnant that traditionally, I don't know how often it happens. When an iconographer is fully trained, that's the first icon they paint."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":497.16,"end":497.8,"speaker":"Jonathan Pageau","text":"Is that right?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":497.96,"end":498.44,"speaker":"Aidan Hart","text":"Yeah."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":498.6,"end":499.4,"speaker":"Margarita Mooney Clayton","text":"Why would that be?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":499.72,"end":502.2,"speaker":"Aidan Hart","text":"Says everything. The incarnation, communion."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":502.44,"end":527.06,"speaker":"Jonathan Pageau","text":"But also because much of the theology of the icon and the theology of orthodox mystic, to the question of light and to this notion of divine light. And so the image of the transfiguration, that's what's going on in that image. It's about light. And icons are about light, especially painted icons. That's what they're dealing with."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":528.1,"end":589.96,"speaker":"Aidan Hart","text":"And this light, at least in orthodox theology, is God himself. God doesn't create a gift of light and give it to us like the sun. We can't, of course, enter the orb of the sun, but the sun comes to us. So the light and the warmth coming from the sun is sun, isn't it? So this is the glory of God himself, the Shekinah glory, to use the Hebrew term, coming to us. So it's symbolic, but it's much more than symbolic. It's actually encounter with the living God. A lot of the Old Testament is experiencing God via something. Moses and Elijah, who appear with Christ, they get an inkling of God. So Moses hears God, sees God on the Mount Sinai as sort of thunder and lightning, and he hears God, but doesn't actually see the Lord. And Elijah, likewise, he comes to the mouth of the cave and hears God as a still, small voice, a powerful revelation, but there, it's transfiguration. They see the Lord face to face, the incarnate Lord, face to face. That's the opposite of symbolism. The symbolism leads them to the face of God."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":589.96,"end":591.36,"speaker":"Margarita Mooney Clayton","text":"What do you mean it's the opposite symbolism?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":591.36,"end":598.73,"speaker":"Jonathan Pageau","text":"No, it's the opposite of symbolism in the sense that that which they're seeing is the culmination of symbolism. Maybe it's the best way to understand it."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":598.89,"end":601.29,"speaker":"Aidan Hart","text":"It is our footsteps that lead to the face."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":601.37,"end":645.17,"speaker":"Jonathan Pageau","text":"Aidan's got it exactly right. That is, you know, it happens on a mountain, just like Elijah, just like Moses. There's a sense in which, you know, it's going up towards that space where heaven and earth meet. But now what is seen there is the source of revelation itself. It's the culmination of revelation at the same time. And that's one of the reasons why, for example, Moses and Elijah are brought to see the very source of creation. You could almost say that it's a little moment of eternity, right? It's like it's their encounter with God that is happening. The promise. What they asked God, right? When Moses asked, he said, God, show me. Show yourself to me. And God said, well, I'll show you my back. And now he's getting the fullness of what he asked for."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":645.89,"end":728.68,"speaker":"Aidan Hart","text":"And this isn't just Jonathan and I dreaming things up. If we look at the people say, well, all this stuff, how do you know it? It's in the liturgical texts, the feast. The icon is brought out and put in a. What's called an analoy on the Feast of the Transfiguration. And then we hear all these incredible hymns that are just full of theology. I have a book called the Festimoneum, which has the translations into English of all the fixed feasts. And it's just got underlining and notes. It's just profound theology. So it's from these texts that we're talking about, really, these patristic texts that have been tried and tested and always related to the Scriptures. The translation into English has notations underneath referring to every biblical verse referred to directly or tangentially in the text. And there are only about five references there. So they are that much text has got about five biblical references. So it's rooted in the Scriptures. So Moses died, God buried him. It says Elijah went to heaven. So it talks about Moses and Elijah represent all the living and the dead, but they're together with Christ. And in the icon, the top half, you have Christ with Moses and Elijah who are in heaven. Down below, you have Peter, James and John who are on earth, but the wall within the rectangle of the icon. So, in fact, this is the church. The church. Living and dead prophets all together. They are."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":728.76,"end":747.88,"speaker":"Margarita Mooney Clayton","text":"Let's slow down for a minute here, because I. We have five scripture references, but all this hymnology. So you're saying that the icon evolved both from the scriptural references, but as it was. There's also imagery or poetry, let's say, in these liturgical texts that talk about."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":747.88,"end":750.6,"speaker":"Aidan Hart","text":"The feasts, it makes profound truths through poetry."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":750.87,"end":790.77,"speaker":"Jonathan Pageau","text":"And I mean, they're expressing typology. And so it's not that the poet just thought up nice images, it's that the poet is versed in the Psalms, is versed in the Old Testament, and that these insights through noetic experience, the insights of seeing, all of a sudden, the transfiguration hinted at, right? Glimmers of it in Moses, Glimmers of it in different parts of the Old Testament. And then seeing that this is all being connected in the story of the Gospel, you know, it's interesting to what extent hymnography is actual, a kind of the Bible interpreting itself, right? Referring to these old images, bringing them back and showing you how they connect and how all of this is brought together in the person of Christ."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":791.57,"end":834.4,"speaker":"Aidan Hart","text":"So one hymn talks about when you had transfigured a Christ, you revealed the original beauty of the human nature. And this refers back to a lot of the fathers say that. Ephraim Syrian, for example, that when it says Adam and Eve were naked, they'd been clothed before, they'd been clothed in light, the glory of God. So when they sinned, as if they lost that light, like if I pull out a plug or turn off a switch, these lights go out. So it's a lamp, but yet it's not a lamp because it's not irradiant through electricity with light. So this shining Christ is actually the new Adam who's put back on the garment of light. In other words, he's not just human, he's shining with divinity."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":834.56,"end":869.13,"speaker":"Jonathan Pageau","text":"And it's not. It's really there. It's really there in the story because this is also happening during the feast of Tabernacles. So the question that Peter asks, it's almost a joke in the story, you know, Peter says, can we give you a garment? Can we cover this? Can we make a house for it? And Christ, this is. This moment is beyond that, right? This is not. This is not a. This is more than a moment that can only be held within the tent of. Even the tent of the tabernacle. Because that's what being alluded to here, is the glory of God appearing to us. Can we build a tent around it to contain it? Not this one. Right."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":869.69,"end":876.81,"speaker":"Margarita Mooney Clayton","text":"So what you're saying is that dialogue between Peter and Jesus, just that simple thing, can we put a tent around it? Is actually a reference."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":877.93,"end":879.05,"speaker":"Aidan Hart","text":"He didn't realize it, probably."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":879.21,"end":893.18,"speaker":"Jonathan Pageau","text":"No, no, it doesn't matter. Right. It's like he was just in the moment in saying it. But then when you see it in retrospect, just like the disciples themselves at Pentecost all of a sudden saw all these things that Christ had done and how they connected, they participated in that, too."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":893.34,"end":924.91,"speaker":"Aidan Hart","text":"Even sometimes when he said, let's build three tabernacles, that refers to the feast of Tabernacles. And that was to remember when they lived in the desert and God was with them in the desert. Because, of course, during the daytime, the Lord led them forth with a pillar of cloud at night and pillar of fly. So the feast of Tabernacles was to remind that God was with them in the desert. So here, in fact, he's prophesying in a way, Peter is saying, this is the fulfilment of the feast of tabernacles. The pillar of fire is here before us. It's God himself."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":925.23,"end":933.31,"speaker":"Margarita Mooney Clayton","text":"And then Jesus response that, no, we cannot put a tent around it is to say, this is not the symbol of the glory, this is the glory."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":933.47,"end":934.03,"speaker":"Aidan Hart","text":"Exactly."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":934.03,"end":934.71,"speaker":"Margarita Mooney Clayton","text":"This is the real thing."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":934.71,"end":935.79,"speaker":"Aidan Hart","text":"We don't see the symbol now."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":935.79,"end":937.63,"speaker":"Margarita Mooney Clayton","text":"Like that's. This is the real thing."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":938.19,"end":948.43,"speaker":"Aidan Hart","text":"Before I met Jonathan in the flesh, I might have a photograph of Jonathan there in my living room. Jonathan comes in and he moves into the house. I don't need the photograph, you know, it's redundant. I've got Jonathan himself."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":948.67,"end":981.03,"speaker":"Jonathan Pageau","text":"It's interesting because I'm so bound up in the question of symbolism, but especially in the orthodox iconographic tradition, there's some aspect of it which is you could call anti symbolic in the sense that they moving towards saying Christ is the finality of these images. And so when you have Christ, you're not necessarily wanting to represent him in these shadows, but you have the thing itself. It doesn't mean that symbolism doesn't continue to exist in this typological way. There's a sense in which Christ is the end of the symbolic pyramid."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":981.03,"end":984.75,"speaker":"Aidan Hart","text":"He's the prototype of which symbols are representative. Right."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":984.83,"end":1039.35,"speaker":"Margarita Mooney Clayton","text":"Well, and to go back to the anecdote I shared with you before about myself as a senior in college, it's a little bit frightening when you begin to realize that there's other rituals and there's other symbols and there's other meanings and there's other ways of thinking about worship. Because I think for me, as a young person, I wanted to believe that these rituals and these symbols truly were what I had been told they meant and that I could have this encounter with God. Because the alternative is to say, well, none of this means anything and all of this is just made up. And whatever I choose to believe the symbols mean is what they mean, and that's what it means to. And it's all the same. Right? And that wasn't very satisfying to me either, because if I just make up the meaning, then I'm not really getting the meaning of my life because I can just claim it to be one thing, you know. But what I hear you saying is, well, there's a rich history of symbols and Symbolic thinking. But Christianity is actually claiming this isn't just about symbols. We're actually claiming you can meet God in his glory. Is that right?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1039.35,"end":1071.21,"speaker":"Jonathan Pageau","text":"Well, that would be the point of symbols also. I mean, the point of. You could say that the point of creation is so that it can meet God. And so even the symbols or the symbolic hierarchy or these inklings are there. They're there to act as a ladder. That's the only thing they're there for. They're not just for our just enjoyment in thinking about concepts, but they have to. If they don't provide levels of insight that can bring you closer to a divine encounter, then they're. They're kind of pointless. You can be just turning around, going around in circles."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1071.37,"end":1208.66,"speaker":"Aidan Hart","text":"In fact, the word symbol is a combination of two Greek words, sym and volus, which means literally to throw together. So the aim of a symbol is to draw us together with the archetype who is Christ. So once you're together, then the symbol has fulfilled its function. You don't discard it. You're sort of thankful for that tree or whatever that brought you closer to God. I came to believe in God's existence through trees. I used to hide in trees as a child, playing hide and go seek and sort of quiet way. I came to believe there must be a God who made these incredible things called trees. So when I was a hermit Living in 20 acres of land, I planted 5,000 trees and Thanksgiving to God, and thanksgiving to the trees, if you like, for being like St. John the Baptist, leading me to God. So it's not as though now Matt has done its job, I can spit it out. It kind of makes the symbol richer. It remains there, but beside Christ instead of. In Eastern and Western Christianity, you have these three stages of movement toward Christ. In the west, it's called purification, illumination and union. And in the east it tends to be called practical theology from praxis, something you do, you've got to act and make an effort to repent. And then Physicke, Theologia, natural theology, perceiving God and the natural in the created world. And then mystike theology of mystical theology. So the first is repentance, being purified, as Jonathan was saying, you can't see unless you get the cataracts off. But the second, which is related to symbolism, is perceiving the words of God within each created thing. So this plant behind us, it didn't just come out of nothing. God spoke plant, whatever it is, rubber plant. And the rubber plant comes into existence. But that word that the Lord spoke actually keeps that in existence. So when I see the rubber plant, I don't see a plant. It's a gift of love to me. You know, my wedding ring, it's just a hunk of gold, but when I look at that, I see my wife's love for me. And then following these footsteps, these logo in plural, these words embedded in creation eventually come to feet. And I look up and there's the face of the Lord, the Logos himself. We can't perceive. We can't look at the Son straight away, but gradually our eyes adjust until eventually we can look at the face of the Son himself."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1209.14,"end":1281.1,"speaker":"Margarita Mooney Clayton","text":"Well, speaking of that kind of gradual ascent, maybe to the face of God, I would say that the transfiguration is a feast in the church or a part of the scriptures that I always struggled to relate to. It's not that long, not that many words going on there. And I wasn't until, you know, a little bit later in life that there was something about the transfiguration that captured my imagination. And I wanted to try to understand it more because I wanted to believe that in the midst of these struggles that I was having and these issues and these problems, that God still loved me and he loved the people around me and that things were going to be okay. And I think that this is a very visceral human desire, right? That in the midst of struggle and suffering, you begin to ask, okay, is this faith that I've been given, is it really real? Like, can I really see God even in the midst of all of this difficulty? But I will say the transfiguration is not something I remember being taught about much in catechism or having much of a way to think about it. So when I picked up your book, as I mentioned, beauty, Spirit and matter, I said, oh, finally here someone's kind of unpacking the meaning of this to me. So let's talk a little bit about. You mentioned that when an iconographer begins to train, this is the first one."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1281.58,"end":1282.86,"speaker":"Aidan Hart","text":"Once they finish the training."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1282.94,"end":1308.8,"speaker":"Margarita Mooney Clayton","text":"Once they finish the training, the first one they would paint. So what are the pieces of the icon we mentioned? Moses and Elijah, who are. What is. What does it describe the icon of the transfiguration? Like, what's that? What are the elements in it? I know Moses and Elijah. There's some rays. There's Simon. Peter. No, Simon is Peter. Right. Simon, James and John. Peter, James and John. Okay, Peter, James and John. There's some mountains. Okay, so just describe the image for me."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1309.2,"end":1311.72,"speaker":"Aidan Hart","text":"Jonathan. Of course, but you describe it well."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1311.72,"end":1378.55,"speaker":"Jonathan Pageau","text":"Yeah. So there's variation in the image, but usually there's a mountain, sometimes there's three peaks, and Christ is in the center. And then there is a glory around him. His vestments are white. And then you have Elijah and Moses on either side of Christ below. Then you have. In the mountain, you will have the three disciples that are reacting to their vision. Usually James and John are kind of tumbled over, falling back, you know, looking away. And then Peter is sometimes kind of looking towards Christ. It depends on the icon. But there's a sense in which he's gesturing towards Christ and that's when he is asking the. The question about the tabernacle. There are some little details that are interesting that appear in the transfiguration. For example, often you'll have one or two of the disciples losing their sandal during. They're kind of being bowled over by this vision. And so those are the basic elements of the transfiguration."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1379.03,"end":1399.92,"speaker":"Aidan Hart","text":"And from the glory, it can be a circle, it can be various shapes. You have rays coming out. That's important as well. Sometimes underneath most analogy, you've got caves with golden. Some later on have the disciples going up on one side and coming down the other. And that's quite important. Why? It's not important, but it has importance."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1400,"end":1402.88,"speaker":"Jonathan Pageau","text":"It's important in the idea also of how revelation works."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1402.88,"end":1403.16,"speaker":"Margarita Mooney Clayton","text":"Right?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1403.16,"end":1407.41,"speaker":"Jonathan Pageau","text":"It's like this Moses going up and bringing something down with him. And so having that important."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1408.84,"end":1415.4,"speaker":"Aidan Hart","text":"They don't stay up there in a state of ecstasy. They've got to go down. Christ's got to be crucified. They've got to carry the grace of God into the world."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1416.6,"end":1429.48,"speaker":"Margarita Mooney Clayton","text":"All right, so in that one image, I'm hearing movement up and down. I'm hearing Old Testament, I'm hearing dialogue. I mean, there's a lot happening in one image Now. Sorry, we're going to have to go back to basics here. What are Moses and Elijah doing there?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1429.88,"end":1483.63,"speaker":"Jonathan Pageau","text":"Well, there's several things that they're doing. One is that they are fulfilling their question. They asked, both of them asked. Moses asked to see God, and both of them had a partial revelation. Elijah heard that soft, that quiet voice, and Moses saw the back of God as he walked by. And so they're there to see the fullness of the glory of God. That's what they're there for. They're there to kind of finalize their movement towards revelation. So it's like what it's saying is, this is the final. This is it. This is the fullness of revelation is being shown here. You know, if there's an image without saying it, that is saying, this is God, it's the transfiguration. Because why are Moses and Elijah there looking at, you know, standing next to Christ in the center, who is revealing this glory completely. And so that's why."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1484.67,"end":1486.43,"speaker":"Aidan Hart","text":"That's one of the reasons the law came through Moses."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1486.43,"end":1487.55,"speaker":"Jonathan Pageau","text":"So you have law and the prophets."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1488.38,"end":1504.7,"speaker":"Aidan Hart","text":"Elijah is a prophet. So Christ is the fulfillment of the law. And the prophets, not only the Ten Commandments, but the Tent of Meeting and the Temple are all types, which types are really physical prophecies, all of Christ. So this is the fulfilment of them."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1504.94,"end":1508.86,"speaker":"Margarita Mooney Clayton","text":"Okay. So they're beholding the glory of God in Christ as the fulfillment of their."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1508.86,"end":1511.74,"speaker":"Aidan Hart","text":"Everything they prophesied about, all the law, everything is there."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1512.06,"end":1521.75,"speaker":"Margarita Mooney Clayton","text":"Okay, okay. And then Jesus has invited Peter, James and John to be there. And you said that sometimes Peter is shown looking at him."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1522.15,"end":1530.67,"speaker":"Jonathan Pageau","text":"Yeah, he's kind of gesturing towards. Either he's looking or sometimes he's gesturing. It depends on the image. But most of the time he's looking towards Christ and gesturing towards him."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1530.67,"end":1584,"speaker":"Aidan Hart","text":"And each of the three passages relate to the age. So the oldest one is Peter. He's looking at Christ. John is the youngest, he's probably about 19. He's the one normally looking away. He's. James is middle aged. He's sort of between the two. What's interesting is that John is the mystic. I mean, I don't like the Word, but his symbol is the eagle. So the eagle flies really high. But interestingly he's often curled up. And there's a lot of teaching about the Jesus prayer. When you do the Jesus prayer, often you make a circle out of your body, but you don't want your thought to shoot out there. You want to meet God, the Holy Spirit in your heart. So you create a circle. So he's seeing the Lord but mystically through his heart, as it were. So the plenty of stories about lay and monastic people experiencing the Lord through that inner prayer. So it's three different ways of encountering God. And they're not contradictory, they're just different ways."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1584,"end":1589.76,"speaker":"Margarita Mooney Clayton","text":"So it's not that one posture is superior to the other. It's that there are different ways of letting the mystery, of seeing the mystery."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1589.76,"end":1593.86,"speaker":"Aidan Hart","text":"Each of us are three distinct people and each of us will experience God in distinct ways."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1594.58,"end":1599.66,"speaker":"Margarita Mooney Clayton","text":"Wow. And why would the sandal be falling off? I think I have noticed that before. Why is the sandal falling off sometimes?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1599.66,"end":1639.95,"speaker":"Jonathan Pageau","text":"Well, at least for me now this becomes a land of speculation. But I do think that it has to do with St. Gregory of Nyssa's vision of what's called the removing of the garments of skin. There's an image in the ascent of Moses as he goes towards the burning bush where God says, remove your sandals for where you're in a holy place. And St. Gregory sees that as this kind of ascetic practice where you remove the passions, you remove the externals in order to enter into the heart once again. And so I've always, when I see that sandal falling off, I feel like this is a gesture towards that saying, like this is this removing of the outer garment and moving into the holy place."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1640.11,"end":1745.86,"speaker":"Aidan Hart","text":"And it's not that faith is bad, is it? It's not saying, oh, the, the fish is bad. And the only way you can see God is to get rid of that bad material stuff called the flesh. Jonathan used the term passions. We tend to think of passions pejoratively, but the passions are God given energies, but you've got to direct them toward God. I'd say there'd be two other elements as well, is that you've already alluded to it, Jonathan, that the Lord tells Moses to take his sandals off. He's encountered God and this is holy ground. So this shows us that Christ is the burning bush. A bush is physical stuff, but then it's got this fire which doesn't consume it. So obviously the fire is not a created fire. It must have been a divine fire, because otherwise it would have consumed the bush. And thirdly, if you're afraid and you're shaking, your sandal might fall off. So that's also to show that this light is actually not just bright physical light, but this is divine light. It's a completely different order. It's an encounter with something that's completely beyond anything we can imagine in the created order. So this sort of fear and the shock and this falling over and the disorder of the disciples is to emphasize that this light is divine light. And you see this in icons of the Mother of God with Christ. Sometimes the sandal falls off Christ's feet. And that's because as God, he knows he's going to die and rise, but also as a human, he's afraid of death. So the child is shaking out of fear. So it's a normal thing to be afraid of death. So this sort of sandal falling off in the Vladimir icon it's called, is an indication of affirming Christ's humanity. In that case, in this case, it's affirming Christ's divinity. And the supernatural nature of this lies."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1746.18,"end":1769.9,"speaker":"Margarita Mooney Clayton","text":"Okay, so now let's go to Christ in this image. As I mentioned at the start, you see, say that one of the purposes of icons is to reveal Christ in his humanity and in his divinity. So it would seem to me that the icon of the transfiguration, we're clearly seeing Christ in his divinity, but are we also seeing Christ in his humanity? What does Christ look like in the transfiguration? When you paint the transfiguration, I mean."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1769.9,"end":1797.47,"speaker":"Jonathan Pageau","text":"He looks like it's an image of Christ. It's a recognizable image of Christ. Christ has certain characteristics that makes us recognize that it's him. So it's definitely representing him in his humanity. You can't represent the divinity of Christ. You can't represent it. You can gesture towards it. Here's a place where you can kind of symbolize or gesture towards Christ's divinity. And that's what the glory. That's the role that the glory plays in this image. Right? The rays of divine light that emanate from him."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1798.35,"end":1857.64,"speaker":"Aidan Hart","text":"But the important thing, theologically, it's the person of Christ. We're depicting icons only. And the fathers who defended icons against the iconoclast were always affirming, we're not depicting the divinity of Christ, we're depicting the person of Christ. But the person of Christ is divine. He's not a human created being whom God popped into because he was a good lad. The person, or the apostasist, to use the Greek term of Christ, is that of the second Person of the Trinity. So you're seeing this man, Jesus Christ, whose personhood is divine. But as I mentioned earlier, what is interesting is that the texts say that he has shown us what it is to be truly human, which is to be not merely human, but to be deified, to be God bearers. So I think the miracle is not so much that Christ was transfigured, but the fact that he wasn't transfigured the whole time. It would have freaked people out. So, in fact, the miracle is that he clothed himself, as it were, to hide his divinity."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1858.12,"end":1887.3,"speaker":"Jonathan Pageau","text":"And one of the aspects of the mandorla, or the glory that is around Christ is usually that it's represented as a darkness that moves towards light. And so usually in the middle it's dark, and on the outside it's white and moving different tones of blue towards the light. And that has to do with this idea that God is beyond is beyond. The description God Is dark. Yeah. And so there's a divine darkness, is what? How? St. Gregory."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1887.3,"end":1888.18,"speaker":"Margarita Mooney Clayton","text":"Divine darkness?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1888.42,"end":1888.86,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1888.86,"end":1892.42,"speaker":"Margarita Mooney Clayton","text":"What is that? Tell me more about that. I thought you said it was about light."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1892.74,"end":1936.54,"speaker":"Jonathan Pageau","text":"Well, that's it. So it's represented in aporia. It's always represented paradoxically. So there'll be different ways of saying it. Something like a light so bright that it blinds you. Something like that, or the idea of. Or that which is beyond light, even that is the source of light. So how do you figure that? That which is beyond description, which is beyond name, which is beyond all capacity to frame. And that is the highest aspect of God in the mystical experience and in the descriptions, even in theological descriptions. This idea that I talked about, St. Gregory of Nyssa and the Ascension of Moses, and when Moses goes up, he moves into the divine darkness."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1936.62,"end":1941.18,"speaker":"Aidan Hart","text":"And it says that there is darkness covered the mountain and there's lightning. Yeah, You've got darkness and light."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1941.42,"end":1971.69,"speaker":"Jonathan Pageau","text":"And in the story of the transfiguration you get that because it says a very contradictory thing. In the story, it says they were covered by a cloud of light. It's like. What? What is that? It's like two contradictory things. A cloud is something that is shaped stars and then. But it's a cloud and it's light at the same time. So even in the actual text, there seems to be a kind of a. That's presented that is implying both light and dark at the same time."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":1972.41,"end":2028.98,"speaker":"Aidan Hart","text":"So it sounds a bit freaky, the darkness of God. Dark's bad, isn't it? But really what we're just saying is that is the unknowability of God. In orthodox theology, we distinguish between the essence of God, which even in the age declared is unknowable, and the energies of God. It's rather unfortunate translation, but basically it's the living person or God in his knowableness. Like if I said, I've known you for two years, I know you entirely, you'd be a bit offended by that. Even if I know you for 2,000 years, Margarita, will always be unknowable to some extent. You know, each of us is created in God's image, so each of us is eternal in the sense that we never entirely know. I mean, both of us are married, we're all married, but we know we're never going to know our spouse in their entirety. So this is a noble essence, in a way. And if this is true of humanity, surely it's true of God. So the darkness is just darkness. From our point of view, it's not darkness. In God himself."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2029.14,"end":2031.86,"speaker":"Margarita Mooney Clayton","text":"But we can know. We're getting closer to knowing. You can know. You're."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2032.1,"end":2045.63,"speaker":"Aidan Hart","text":"Oh, yeah, of course. Yeah. And Gregor Nisra, whom Jonathan's referred to a lot. He uses the term from glory to glory a lot. Of course, it's St. Paul's term that even in the age to come, ever growing closer to God. It's an eternal message journey."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2046.99,"end":2062.19,"speaker":"Margarita Mooney Clayton","text":"In the transfiguration, Christ is filled with light. And I believe you've told me, Aidan, that also, it's important to depict the garments are also filled with light. It's not just his face. It's not just the rays emanating out from his noose, maybe, but his garment is transfigured."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2062.59,"end":2068.31,"speaker":"Aidan Hart","text":"That's what the scriptures say. It's saying that face shines with light. But all three gospels talk about the. The garments."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2068.39,"end":2068.95,"speaker":"Margarita Mooney Clayton","text":"They do."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2069.83,"end":2072.71,"speaker":"Aidan Hart","text":"This is. I don't know if you want to speak to this. One of my favorite subjects."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2072.95,"end":2073.91,"speaker":"Jonathan Pageau","text":"Yeah, go in."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2073.91,"end":2162.15,"speaker":"Aidan Hart","text":"I mean, it's just the clothes we wear. And they're just inanimate, aren't they? They're not personable. They're just woven linen. But this inanimate matter participates in this uncreated glory. So that this is. And in Greek, one of the terms used for what we now call nature. Rather sadly, this called it, the created world is cosmos. God created the cosmos. And cosmos in Greek means adornment, cosmetics comes from that. So Christ's cosmos, Christ's garment is really the whole of the created world which is wrapped around himself. And he's filled with light again. So Maximus the Confessor talks a lot about this, that each stage of Christ, he's gathering something which had been discarded by the Fall. Adam and Eve discarded creation by not giving thanks. It just sort of became dead. Then if I take this garment off, it just becomes dead. It just flops when it's on me. It takes on my form. It actually participates in my personhood. So really what's happening in the transfiguration is that the person of God who's taken on our humanity, therefore also it's the second Adam is transfigured, but through the second Adam, who's like a priest between the Creator and the rest of creation, the whole of the cosmos participates in his transfiguration. And St. Paul talks about this in Romans 8, the whole of creation sort of groaning, waiting for the redemption of the children of God, because it too then will be filled with glory, all of creation."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2162.15,"end":2165.67,"speaker":"Margarita Mooney Clayton","text":"But I mean, are my clothes part of creation? Yeah, of course they are."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2167.67,"end":2246.59,"speaker":"Jonathan Pageau","text":"But it's very. There's a very. There's a very deep understanding of. Even in terms of the story of the Fall. You know, garments are very important because Adam and Eve are clothed in glory. Right? That's the way that at least St. Ephrem presents it in some of the. Many of the church fathers. And then in the fall is when they kind of see themselves as naked, as lacking, and then they feel like they have to add something to themselves. And so these dead garments of skin get added to them. But that doesn't stop there. It becomes also civilization. Right. So Cain goes further down into the Fall and he builds this city and he builds these walls and technology and these weapons. And the idea is that that is somehow a reaction or it's a movement of the Fall that's going deeper and deeper down into basically going all the way to the flood in the biblical narrative. And the surprise of Christ is that he fills all of that. So the final image, let's say, of the transfiguration is the heavenly Jerusalem, which is now. It's like, now it's really just the entire world that is filled with glory. But the hint of that or the promise of that is exactly like Aidan said, is that this garment that Christ wore is now, no longer, let's say, a dead garment of skin, but is now filled like it's full of the."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2246.59,"end":2257.65,"speaker":"Aidan Hart","text":"Very glory by participation in the person of Christ, because the garment takes on the form of person wearing it, and it's only transfigure because it's part of him. It's not him, but it sort of takes on his image, as it were."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2257.89,"end":2269.25,"speaker":"Margarita Mooney Clayton","text":"So what you're saying, I think Aidan has really profound theological implications that the person of Christ has. His garments are part of the person of Christ. Is that what I hear you say?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2270.21,"end":2273.33,"speaker":"Aidan Hart","text":"Distinct, but yes. Like, how do you put it?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2273.33,"end":2275.45,"speaker":"Margarita Mooney Clayton","text":"Or they. They help to reveal the person of Christ."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2275.45,"end":2325.4,"speaker":"Aidan Hart","text":"Yeah, yeah. I mean, the whole of creation is in God's image. I mean, we are persons with freedom, so we are more in the image of God. But everything in creation, even to a rock, is a symbol, reflects some aspect of God's life. So, in fact, the hall of Creation was created as a temple for us to worship God. We haven't talked much about this. You're talking about how do we know the rituals have significance? If it's true worship, it should reflect heavenly worship. This is why God had revealed to Moses exactly how to build the Tent of Meeting and exactly how to model the year liturgically. Because it wasn't Just man's invention, dreaming it up. It had to reflect, had to be an icon of heavenly worship. So the whole of creation was created by God as a temple for us to worship him in. And it reflected the truth of who God is."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2325.88,"end":2336.16,"speaker":"Margarita Mooney Clayton","text":"Okay, so in some ways, I mean, because we believe that human beings are created in the image of God, and my clothes aren't created in the image of God, but yet they somehow reflect God's glory, which is different."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2336.32,"end":2342.96,"speaker":"Aidan Hart","text":"They take on your shape and you're in the image of God. So that they're obviously a lower image of God than you are because they're just inanimate."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2344.16,"end":2375.24,"speaker":"Jonathan Pageau","text":"You could understand. I mean, if you want a simple example, that's not. That doesn't. I see. It's kind of confusing. But you can imagine that, let's say when you go to church and then you have a chalice, right? It's like, here, this is kind of a chalice. Like we have cups, but we have things. But then all of a sudden, there's this possibility of taking something which we use in common day life and then bringing it into service and bringing it into worship. Then it participates in this movement towards God. And so in some ways, you could say that."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2375.24,"end":2375.52,"speaker":"Aidan Hart","text":"For."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2375.76,"end":2398.98,"speaker":"Jonathan Pageau","text":"Let's say it's a liturgical movement. But think about it in terms of the promise is that this will fill the whole world. That is what the. The promise is that the reason for creation is that it can be theophanic, that it can be a place where God reveals himself. I mean, in some ways, that's the reason for creation. Without that, why did God create the world like God created the world? Out of this?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2398.98,"end":2401.94,"speaker":"Aidan Hart","text":"To get in the way of him? No, it's there to reveal him, try."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2401.94,"end":2402.98,"speaker":"Jonathan Pageau","text":"To get in the way of him."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2403.38,"end":2412.35,"speaker":"Margarita Mooney Clayton","text":"Okay, so all of creation from plants and trees and clothing can participate in the glory of God."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2412.51,"end":2515.08,"speaker":"Aidan Hart","text":"Is that, well, God created it. But it says in Hebrews that by the word of his power, all things sustained. So God just didn't create. And then he walks away. And that thing has its own. God remains in that and gives it life. So Bishop Callistos Ware says that Christians aren't pantheists, but they are panentheists. God is in everything, sustaining it. This is the meaning of the logo, the words. The second stage of the spiritual life is to discern, see, hear the words of God. Within each created thing, there's a hierarchy. Obviously, an animal is higher up on the hierarchy than a stone, but nonetheless, everything in its own way is an image of reflection. Takes on some Element of God's form, inverted karma. So that means that the word monocos means one who is alone. And all of us call to be monarchy monastics in the sense that wherever I look, if I look at Jonathan, look at Jude, look at. Look at a tree, I'm seeing God in that. You're not God, but I see God coming through you. So everything becomes iconographic. And this is, I think, the essence of the fall that I think it's Ephraim who suggests that the tree of knowledge, good and evil, is the whole created world and it would become knowledge of good for Adam and Eve, that is us, if we give thanks for it. So when you give thanks, you see the person, the giver in that gift. If I just grab that gift and turn my back, then it becomes knowledge of evil, becomes dead for me, this is why the Eucharist, I think it's wonderful, but the central Christian act is the Eucharist, to give thanks that everything then is a means of beholding the Lord. So then we're all living like monarchy monastics and that we're living alone with God. In fact, the whole universe is gathered in. So wherefore I look is the Lord."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2515.4,"end":2609.09,"speaker":"Margarita Mooney Clayton","text":"I've been teaching this class on the Virgin Mary, and I like the verb kind of gathering. And it sounds like from what you were saying a moment ago, Jonathan, that the transfiguration of the clothing, the matter, were meant to gather all of the creation of God and sort of bring it back, give thanks, kind of, you know, bring it back to God. So all of these things God created at this point in time, but they're meant to be gathered and brought back, thereby participate in this glory. See, that did help me, right, because as a young person. Well, what's the alternative to that? Well, you use things and you do things, but. But it's completely unrelated to your march towards God, right? You just go towards God in your head. But all these things that you're interacting with, nature, objects, et cetera, that's sort of superfluous to the spiritual journey. And what I hear you saying is, no, no, no, all of those things are part of our spiritual journey. They don't have a soul, they don't have a noose. But we're meant to gather, we're meant to steward and to appreciate the presence, the creation of God and all of matter and steward that, gather it, bring it back to him. And that to me, was very moving to think that that's a beautiful way to think about life rather than using and throwing away or Consuming just for pleasure, that all of these things can come together. So I guess in the time that we have left, I wondered if you could share with me what this feast means to you or what the transfiguration means to you. I mean, was there a moment in time when you asked yourself, like, what really is the meaning of the transfiguration? What does this look like in my life? Why do I need to meditate on this or to ponder this particular feast?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2609.73,"end":2729.14,"speaker":"Jonathan Pageau","text":"I think that Christ in the Gospels, there are moments in his story, and each moment reveals an aspect of the mystery that Christ is, you know. And so to me, I see in some way the transfiguration, the crucifixion, as almost kind of standing in contrast with each other. You know, here's this moment of where Christ is revealed in his divinity through a kind of glory. You know, really using all the symbolism of the Old Testament, all the symbolism of the glory of God, the Shekinah, all this imagery is brought there. And then you have this other contrasting images where the glory of God, the glory of Christ is actually being shown on the cross as well, but in a very strange, inverted and hidden way. And so to me, I love that there's something about having holding those two stories in tension which I think is important for us, even in terms of liturgical artists, for example. And so we understand that the beauty of the Church, the beauty of all the things that we make, the frescoes, the mosaics, all of this is in some ways participation in the transfiguration, and that we're called to kind of hold these two things in tension, one which is the self sacrifice, one which is helping the poor to care for those in need, to kind of give ourselves, to empty ourselves for others. But then there's also the possibility and the importance of celebrating that glorious aspect where all creation comes together and celebrates. And so to me, the image of the transfiguration as an artist is in some ways a guiding light. To say, like, no, there is this possibility of participating in that and like you said, gathering the elements, gathering bits of wood, bits of gold, bits of stone, and being able to hopefully offer something up so that it participates in that process."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2729.86,"end":2760.28,"speaker":"Margarita Mooney Clayton","text":"Oh, that's beautiful, Jonathan. Let me see if I heard what you're saying. That for you and your vocation is to be a liturgical artist. You make sculptures, you do design, you know, iconographic, that the image of the transfiguration, the meaning of the Feast, of the Transfiguration, in some ways is like. It gives meaning to your vocation. Or gives inspiration that what you're doing as an icon carver and iconographer, you're taking created material and you're working with it and putting it together in ways that participate even further in the glory of God, and it gives meaning, is."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2760.28,"end":2768.52,"speaker":"Jonathan Pageau","text":"That you hope in some ways it's the anchor. It's part of the anchor of what makes a liturgical artist do what they do, at least for me, is this."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2768.52,"end":2815.43,"speaker":"Margarita Mooney Clayton","text":"Idea of kind of stewarding and gathering the materials and then creating an image that's kind of bringing creation back to God in an act of thanksgiving. I liked very much what you said that part of our calling as people of faith is to serve the poor and to care for the needy. But we're also called to gather and to co create with God and to make beautiful things that give glory, that celebrate, celebrate that lead us into this place of rejoicing and celebrating that God's presence has come into the world and therefore matter can be sanctified and can be gathered and brought back. I think that goes beyond liturgical art is right for any kind of vocation, for anyone working in the world doing anything. This is so inspiring because otherwise then your faith and your work are just completely separate from each other. So that's a very inspiring message. Thank you. What about for you, Aidan?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2816.15,"end":2934.04,"speaker":"Aidan Hart","text":"As you're talking, I was thinking perhaps of three things, face, community, and matter. I think I was sort of nominally raised an Anglican, but never really had a conscious faith. But When I was 15, I had a conversion experience. As this man was speaking about the faith. I saw a face full of light, but also there was a crowd behind, there were people behind, and this is what converted me. So it was the face of Christ, but also it wasn't just him isolated. And that sort of entered my heart and I sort of measured everything against that in a way. So when I encountered the transfiguration icon, there you have it, the face of Christ. But not alone. But being an artist, I started off as a Baptist, which I really loved. I got to know the Scriptures well. But I felt matters hasn't really got a place here. The material world is sort of just not mentioned, really. So my journey kept going. And when I discovered the icon tradition and the orthodox affirmation of the material world, when I saw the transfiguration icon and started reading about the theology, I realized, ah, now I've got the face of Christ, got the community of the church. Here's matter transfigured. You were describing this process of taking God given matter up and making it even more articulate in the worship of God. That artistic process here is all in the transfiguration icon. That's why the idea of Christ's garment being cosmos means a lot so much to me. The garments aren't just raw flax. Someone has taken the flax, spun it, woven it. So here, this idea of man as prophet, priest and king, and I understand kingship is like an artist, like Jonathan's got to be master of his steer type when he's carving it, but he's not master to be crush it and grind it. He's master of it to raise that hunk of inanimate stone to become the face of Christ. So kingship to me is the kingship of an artist to make creation more articulate in the praise of God. So that's what the transfiguration says for me."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2934.28,"end":2952.2,"speaker":"Margarita Mooney Clayton","text":"That's very inspiring. And I know we'll hear more from you on priests, prophet and king in your lecture tomorrow at the PTS and Scala Foundation Conference. And you know, Jonathan, I want to. I wondered if you could just give us a few minutes, just a few words, really. What are you speaking about tomorrow at the Scholar Opera and pts?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2952.52,"end":2991.34,"speaker":"Jonathan Pageau","text":"Well, actually, it has a little bit to do with what we're saying. There's something about especially modern, especially contemporary art. There's a sense in which the artist is there to question. The artist is there to poke at the system and to try to break the structures that are there. And what I want to express tomorrow is how traditional art and how especially liturgical art is in some ways there to celebrate and to bring together and to kind of build identities. And so we're going to look at that, the dangers of that also. There are dangers in that. And so we're going to try to look at it in Scripture and how it all kind of comes together in the person of Christ, like most stories."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":2991.98,"end":3021.83,"speaker":"Margarita Mooney Clayton","text":"That's great. And, you know, as I mentioned at the start, the Scala Foundation's mission is to restore culture through liberal arts education, beauty and worship. And this event that I've put together this weekend is going to bring together artists with educators, with scholars to experience the beauty of the campus here at Princeton Theological Seminary, the University Chapel. SACRED MUSIC and I wondered if you could comment on, what was it that attracted you to be a part of Schola's mission? What do you find about Schola's mission that made you interested in being a part of it?"}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3022.15,"end":3052.39,"speaker":"Jonathan Pageau","text":"I think the world is hungry for exactly the things you mentioned. You know, people. People are heavy because the world is quite ugly, especially in America. In Europe, you have more luck than we do. We have more chance than we do, you know, the suburbs, this plastic world in which we live, and also this world of consuming. I think in some ways it's sad, but it also is a kind of hunger. And people are looking for meaning and looking for beauty. And so if we can help people move in that direction, it's wonderful."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3052.79,"end":3066.87,"speaker":"Margarita Mooney Clayton","text":"Great. Well, I would encourage everybody watching this to look at Aidan Hart's website, Aiden Harticons. There are beautiful images, wonderful essays. Please do check out his books Beauty Matter and the Sacred. Also his book Festal Icons, which was."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3066.87,"end":3067.87,"speaker":"Aidan Hart","text":"Released Beauty Spirit Matter."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3067.87,"end":3078.84,"speaker":"Margarita Mooney Clayton","text":"Beauty Spirit Matter. Excuse me. Beauty Spirit Matter. Thank you. His book Festival Icons was released just in 2022. Is that right? And his book on drawing icons, Techniques."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3078.84,"end":3080.16,"speaker":"Aidan Hart","text":"Of Icon and wall painting."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3080.24,"end":3081.76,"speaker":"Margarita Mooney Clayton","text":"Techniques of Icon and Wall Painting."}
{"episode_id":"SW - #301 - 2023-08-17 - Aidan Hart - Transfiguration - The End of Symbolism","start":3081.92,"end":3105.2,"speaker":"Jonathan Pageau","text":"It's the best book on painting icons that exist. I mean, I think it's pretty unanimous. So if you're interested in Icons, that book is the book to get. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
