{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":26.25,"end":37.13,"speaker":"Mark Manolopoulos","text":"All right, well, maybe the best way to start would be, since I'm sure many people watching this won't know who you are, if not most of them, just kind of introduce yourself to give everyone an idea of who you are and what you do."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":37.77,"end":92.91,"speaker":"Jonathan Pageau","text":"So my name is Jonathan Pageau, and I am mostly an artist. I'm an icon carver, which means that I make images based in the tradition of the church for churches, for individuals, following really kind of the canons, we would call it the standards of iconography, and respecting the way that saints or that Christ or that stories have been represented in the past and trying to see in that a wisdom that's been passed down. And so one of the things that I'm doing as an icon carver is I also study traditional symbolism and try to see. Try to understand it, try to see what it means for us today, and also try to apply it to the world today so that we can understand these stories as being. As giving us patterns which explain reality and explain our interactions with the world, rather than just these arbitrary kind of strange, fanciful stories that are from the past."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":93.55,"end":124.55,"speaker":"Mark Manolopoulos","text":"Right. And it's really kind of great that, with looking at premodern literature particularly, but especially things involving saints and these other kind of mythological characters, to kind of be able to approach it from that kind of symbolic and artistic standpoint so that it isn't, you know, just gloss over and say, oh, that's really weird. I understand what's going on, but actually try to work out, you know, what's happening and like, what's, you know. Because literally these stories have meaning beyond just, you know, people believed, you know, really weird things back."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":126.87,"end":223.03,"speaker":"Jonathan Pageau","text":"The most important thing to understand is that there are innumerable ways of. Of describing reality. We somehow still have this idea that a kind of matter of fact, very, let's say, kind of forensic way of describing reality, let's say the way that you would describe reality to a police officer, if there is a crime. We have this idea that this is the standard of how to describe reality, but that is absolutely not the case. Most of the time, you don't describe reality as if you're describing a crime to police officer. We use all kinds of imagery, all kinds of shortcuts, all kinds of compressions in order to compress large amounts of time into very short stories. And so this is something which the ancients understood very well. And so the idea that you would have strange stories that sometimes have strange elements to them, it's better not to understand Them just as literary tropes or literary metaphors, but rather methods of compression and methods of telling stories which encompass things that are difficult to describe in forensic terms and contain more information. It's like if I describe, let's say, describe, a boxing match and I say, that guy whooped this guy's ass, like that's way more descriptive than if I spend an hour describing every punch and at what centimeter from what muscle and what damage it did to how many blood vessels. Like, one of them is more forensic, but the other is more real because it connects to all the emotional, all the meaning and all the deeper aspects of why you would watch a boxing match in the first place."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":223.27,"end":258.97,"speaker":"Mark Manolopoulos","text":"Right. Yeah. And you get that interesting thing where I think often modern people find things like saints lives really hard to kind of process especially, and not popular at all. Like, usually it's like, oh, that's these weird religious stories. Who'd ever want to read those? These were the super popular literature of the day in the Middle Ages and beyond, and they straddled that line. Insofar as you'll have some which do seem to kind of. They fit with our modern understanding of that kind of historical report, there'll be some that have no particularly fantastic elements in them, and they're seem to be fairly sober. And then you get other ones where, you know, the saint's being swallowed by a drake."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":259.21,"end":285.12,"speaker":"Jonathan Pageau","text":"That's right. And especially the earlier. It's like the further you go in the past, and also the more the story tends to go down into the popular sphere, the more it will have fantastical elements in it, because those fantastical elements actually point to some deeper patterns in us that tend to manifest in ways that, even though they look idiosyncratic, are actually the best way to represent certain realities."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":286.08,"end":303.39,"speaker":"Mark Manolopoulos","text":"Right. I mean, the story of the hero and the dragon is so kind of universal, or even just even broader than that. Just the hero and the monster, or whatever it happens to be, is just in every form of storytelling in some fashion. So it's not like it's some kind of arbitrary creation. Yeah."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":303.39,"end":324.03,"speaker":"Jonathan Pageau","text":"And even the fantastical versions that we have now, like, there's a reason why things like Lord of the Rings or Harry Potter or fantastical novels are so popular, not just because they're flights of fancy, but because the storytelling tropes that they use connect to some very, very deep, you know, patterns that we have inside us and that kind of frame our reality."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":324.75,"end":355.12,"speaker":"Mark Manolopoulos","text":"Right. I think one of the things that I think is useful about looking at literature like saints Lies these, you know, these kind of pre modern ones is that it kind of removes, hopefully a little bit of that gap between. Oh, yeah, there's these things we watch for entertainment, like Lord of the Rings and Harry Potter that we like and they're, you know, we like fantasy. Right. And then there's real life and. Which is, you know, not like that at all. Yeah. Which is boring and not colorful at all. It's just like that is such a. Such a modern understanding, like a pre. Modern culture just would not understand what you're talking about if you put it in those terms."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":355.52,"end":374.08,"speaker":"Jonathan Pageau","text":"Exactly. Yeah. And the story of St. Margaret is obviously a shining example of a story that has some very wild elements in it and that it's important to kind of look at and to help us understand what it says about her and what it says about why it was so popular, like why people cared about the story."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":375.04,"end":447.95,"speaker":"Mark Manolopoulos","text":"Right. And I think one of the things that is interesting is to kind of understand how in pre Christian culture you had what we might expect as that kind of heroic stories that were popular. I mean, obviously Homer and Virgil. Right. You have the story of, you know, gods and demigods and these, you know, very martial masculine heroes. And then you have this interesting flip that happens with Christian culture where it's not that those things don't still exist and they exist in Christianized forms, but that you also have explicitly kind of Christian stories which could not have existed before that period of people who die incredibly shameful in the eyes of the world. Deaths of slaves also may very well have been slaves themselves, but they're raised up as a kind of laudable or admirable example of right action. So basically as a hero. And it's very much often framed in terms of overcoming some kind of foe, even though that overcoming results in usually being tortured and killed. It's such an interesting kind of reversal. In a way, it's partially a reversal, but it's partially participating in that same pattern of overcoming the foe. It's just the method of the overcoming has shifted, is different."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":448.43,"end":1033.37,"speaker":"Jonathan Pageau","text":"And so in the story of St Margaret, there are a lot of things in her story which really point to the things you're talking about within the story itself. In the version at least, that I read, I don't know if this is in every version, St. Margaret is actually born of pagan parents who expose her to die. And so this was a practice which was in Rome, in Greece, you know, in different pagan cultures, which is that especially if a girl was born, because a girl was seen as trouble, then the girl would be left out to die. Like, you know, when the father would see that it's a girl and he would just leave her out to die. Or if it was someone who was slightly deformed or just in a wrong time or there was, you know, it just wasn't the time for a child, then there was no moral. They didn't see a moral problem in killing the child or exposing the child for it to die. And so in the story, what you have is Margaret is saved by a Christian person who raises her up in the faith to become, you know, a person who's very strong in the Christian faith and. And is willing to stand up and to speak out against the evils of the pagan world. So already, interestingly enough, you find a contradiction in the simplistic way people, first of all, view Christianity and the way that they view ancient civilization in general, where one of the aspects that Christianity brought to the world was giving value to the feminine and it giving value to the lower aspects of reality, the slaves. It gave a way for people who were marginalized in society before to now to have a way to have a kind of power, a kind of power which was a spiritual power. And so in her very story, you actually see what Christianity did to the pagan empire, which is to take that which was thrown out by the pagan empire, take also women who were viewed as simply property in the pagan empire, and bring it into Christianity, where although people for some reason don't. Can't see that this was what happened, that they. They became fully human. And they were also, for example, like you couldn't in the pagan world, you could marry a woman by just taking her. Whereas in the Christian world, consent became the rule for Christianity is that a woman had to give consent in order to be married. And so the story of St. Margaret has her being raised by a Christian and being very beautiful and very attractive. And so she attracts the interest of a kind of pagan king or some kind of pagan authority. And the pagan authority wants to have her. And the deal is he wants to have her and he wants her to submit to his God. And so those two things seem to function together, which is he wants her to submit to his authority and to the authority of his world, the authority which he represents, which is this ancient pagan world. So St. Margaret refuses, and for that she is tortured, she's imprisoned. All these things happen to her. And so he's torturing her in order to convince her to let go of her pride, to. To give in to him, to finally just Give up this futile fight that she's putting up and to marry him. And so this is where the story gets very particular because when Margaret is put in prison, then she encounters this dragon, and the dragon comes to eat her. And so in the Virgin that I read, the virgin that Mark gave me, she doesn't get eaten by the dragon, but the more ancient version, she does. She gets eaten by the dragon. And then in the Dragon, she pierces out of the dragon with a cross that she has with her. And so uses this cross to kind of break out of the dragon and to be freed from the dragon. And this is kind of. It's like. It's connected with her fight to resist the temptation of giving in to this guy, right? Giving in to this guy and giving in to his God, Giving into his authority structure. And then ultimately, then, because she. After she. She frees. Frees herself from the dragon, then the man comes back, and then the torture continues until she is finally killed. And there's a strange element, too. Like, this is harder to understand, like I said. Struggle to understand it. There's the element of this character, this Christian soldier which worked for the king. Yeah, it's a very strange element. They'd be worth thinking about more because there is a Christian who works for the king, and he's the one who's actually told to kill Margaret. And at first he doesn't wanna do it. And then she says, you have to do this. This is just how it's gonna be. And so finally, he kills her, and then he kills himself. He likes suicide. And then they both die in that moment. And so that's like a really intense. Intense. I think I can kind of see what it's trying to bring about in terms of storytelling. Maybe we could get into it after. But first we need to talk about the dragon. That's the most. That's the most interesting thing. And so the dragon in. Usually the dragon is a manifestation of chaos, you would say, or a manifestation of these lower aspects which kind of rise up, you know, and try to devour the world. And so usually, the way it's represented, of course, St. George is the ultimate version of this. But not just St. George, but also the image of St. Michael killing the dragon, or St. George killing the dragon is usually the idea that through. Through light, through word, through meaning, then the dragon is pierced and is fixed, right? So imagine like a slithering chaos of things that you don't understand, that don't make sense. It could be your desires. It could be a foreign army that's on the border that's going to attack you. There's all these different versions of what that dragon is manifesting, which is just this kind of chaos which is pressing in and is going to. Going to devour you from underneath. You know, imagine you have all these bills that you haven't paid or all these problems, all these things that come up from below and then through a, through will, through truth, through light, all these things from above, then the demon, the chaos is pressed back down and, you know, order is re established. And so that's usually the way that it manifests itself. But a kind of more interesting. Oh, not. This story of St. Margaret shows us another aspect of the Dragon, which is the dragon is really mostly the notion of extremes, you would say, of extreme something. So here it's the opposite. It's like the dragon is something like a tyrannical hierarchy, like a corrupt tyrannical hierarchy. And so instead of it coming from below, let's say it ends up actually devouring her and it becoming like a prison. So you can imagine that for someone who is a marginal person who is on the edge or doesn't have power, then this order becomes like a prison. And that's what she's in. She's in a prison, she has this king who wants her to give in to his authority, to give in to his God, to give into the thing which manages his world. And she refuses. So the dragon, the prison, this call from the authority is all the same image, right? Right. The dragon is just one version of the prison in which she is. And the idea, of course, is that through her, through her dedication to Christ, to something higher, to something more true, then she's freed from that prison, she ends up being freed from the prison. And so that's exactly what's going on. So you can see it at all these different levels, and you can see it as a personal level too, because, for example, The Dragon of St. George is often represented to people as the passions. Right. So all these desires that contradict each other, that rise up, you can have all these contradictory desires in you that are ripping you apart, that are devouring you. Imagine the drug addict or a sex addict or anything that you could be kind of addicted to. And. And so usually that's the thing that it represents, but here it's kind of like the opposite of those desires. It's more this corrupt oppression that comes from above that is holding her in and that is imprisoning her that she has to free herself from. And so it's fascinating to See how the dragon is almost used in an opposite way, but inside her, it's also the desire to give in. Like her own personal desire to give in to. To this man who is pressuring her and is saying, if you just gave in to my authority, to this corrupt, false authority, then all your problems would go away. Right? And so she has this temptation, which is different because it's not like she's attracted to him, right? It's not like the image rather, of a seductress who would come towards someone and then the man has to resist his temptation. Her temptation is just the temptation to give in and to give in to the authority in order to stop the suffering that she's going through. So it's a different temptation, but it's a temptation nonetheless."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1034.41,"end":1053.77,"speaker":"Mark Manolopoulos","text":"Right? And there's this interesting aspect too, in that we have this victory insofar as she overcomes the dragon, either by bursting out of it with the cross, or like in the 12th century Middle English prose version, where she just kind of makes a sign of the cross and then he disintegrates into dust. But she's still in the prison and she's not. I mean, she only gets that when she's let out, execution and dies."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1054.49,"end":1143.24,"speaker":"Jonathan Pageau","text":"But that's the thing, is that it ultimately ends up being a form of self sacrifice, which is what saves her. And of course, in the Christian vision, this is also the idea in general. The idea of self sacrifice ends up being the way you solve a lot of the problems, right, In. In this sense as well, which is that the capacity to accept, to suffer. And so to not give in to something you know, which is false, and to not give in to something which you know, which is a lie. And this is something which you see happen in the image of Gandhi or of different characters who even, like Nelson Mandela, for example, who. Who accepted to suffer. So to not give in to a corrupt authority, and not Mandela is maybe not the best example, but rather the person who doesn't submit, but then doesn't necessarily fight back, but just becomes an image of someone who is strong and is holding in, holding on and doesn't want to submit. And then that has a transformational aspect for them, but then also for the world as well. Ultimately, it's the whole image of peaceful protest. Like that's what peaceful protest believes, is that you can transform reality through not giving in, but not also rebelling at the same time, right?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1143.24,"end":1182.82,"speaker":"Mark Manolopoulos","text":"And there's this interesting, I think, idea of the kind of, I don't know, passive hero, if you Want to put it that way of like someone like say Thomas Moore, which is narrative or narratorized in A Man for All Seasons by Robert Bolt, was turned to a movie in the 60s of this idea of all he does in that story is keep silent and then they imprison him and they kill him. Like that's the story. And he's held up even, you know, even in kind of contemporary secular 20th century west, as this kind of figure to. As a heroic figure. Even though he really did. The whole point is in fact that he doesn't do anything and that he's just refusing to sign a document and staying in prison. But he's still. There's a kind of, there's an activeness to that passivity though."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1183,"end":1189,"speaker":"Jonathan Pageau","text":"Yeah. And it's also, you could call it something like the secret of inaction, like the secret of the pillar."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1189.08,"end":1189.48,"speaker":"Mark Manolopoulos","text":"Right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1189.56,"end":1206.2,"speaker":"Jonathan Pageau","text":"The secret of the axis of a wheel. And it's something about the cross which is also showing this mystery of the cross, which is this idea that at the center of something is the sacrifice, like at the center of things. This is something that ancient people understood very much."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1206.28,"end":1206.68,"speaker":"Mark Manolopoulos","text":"Right?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1206.92,"end":1266.89,"speaker":"Jonathan Pageau","text":"It's something that people understood. That's why they sacrificed animals, that's why they sacrificed people, because they understood that at the center of a world is sacrifice. And this is something that, for example, in just a basic way, it sounds all weird when you say it that way, but if I say something like in order for your family to strive, as a parent, you understand that the core of that is self sacrifice. Like if you sacrifice yourself for your children, then your family will thrive and you will thrive right through that self sacrifice. But rather if you don't, if you act just based on your own will and your own passions and your own desires, then you won't be surprised that after your second divorce and your kids moving from one house to the other, that your kids are going to start to not like you and are going to go in all kinds of weird directions. And I mean, it's like don't be surprised because you didn't self sacrifice in order for your. The cohesion of your group or the people that are with you to stay together."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1267.85,"end":1305.35,"speaker":"Mark Manolopoulos","text":"Right. And there seems to be kind of separation, it seems like in pre modern societies, whether that's kind of hunter gatherer societies or even agricultural societies, because those kinds of cultures, the sacrifice is really present. You know, you need to sacrifice in order to, you know, work the land. You know, you need to sacrifice obviously in terms of hunting to a degree. And so there's A kind of experience where you're living it, you're kind of living that pattern of sacrifice. Whereas if you're living in a modern industrial society where you can just kind of, you know, go to the store and get your pre made food and kind of, you know, you become detached from this idea that like something had to be sacrificed at some point along the way in order for that to actually."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1306.55,"end":1406.24,"speaker":"Jonathan Pageau","text":"Yeah, exactly. But for us at least it's easier to see it psychologically because maybe that's the, that's the crux of our existence because our physical needs are so, you know, are so taken care of that it's easier to see the need for psychological self sacrifice in a psychological manner or in a personal manner and understand that, you know, that's the same for any relationship. Like you can't, if you go into a relationship just trying to get what you can get from it, it's not going to be a fruitful relationship. You also, there is a, there is this kind of mutual self sacrifice which needs to happen for any relationship to be fruitful. So I think that that's what you are seeing in the idea of the martyr is that the martyr becomes a mythical image of what Christianity is at a lower level. And so sometimes it's hard to understand why these people would admire these martyrs because, you know, like, what is going on? Like, what is this? Why is it so impressive to them? It's because it's like an extreme version of something which they experience at a lower, more common level. And so that's why it was like their shining examples were these people who were willing to suffer torture and all these insane things in order to stay true to something higher, were willing to sacrifice themselves for a higher ideal. And they would experience it at a lower level. It would be just like, okay, so instead of when I get my money, instead of buying some beer, I'm going to buy food for my kids, right? And so it's like that's the level of self sacrifice that most people would have had to deal with, right?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1406.24,"end":1479.85,"speaker":"Mark Manolopoulos","text":"I think this is a really important point because I feel like already on the level of dealing with martyr stories, right, the modern reader can really easily just be like, I'd never do, like, who would ever do that? Like who would suffer these horrible tortures just to not say like these words like why would you even do that? And if you go the next step up and go to visualizing it and being swallowed or almost swallowed by a dragon, then it's just like, well, all connection to reality has been Lost, it seems. And it's like, what is this? I can't interpret this at all. But when you put it in those terms, you realize, like. Oh, one, yes. Like maybe you're not martyring yourself. Martyr means witness. Right. In that case, it's a kind of, you know, in the Christian context, it's witnessing for the faith. But it is even this kind of pattern, like you said, of, you know, you're maybe like a witness for your family or something like that. Right. And then you did the dragon in this case as a kind of tyrannical authority, but that dragons are usually symbolic of, you know, all manner of, kind of, like you said, chaos and passions and these kind of lore things. And when you put it in those terms in a story like this doesn't just become detached from something that's, you know, more historical, seemingly, but it's actually. It's doing the same thing. It's just. Yeah. Like you mentioned doing it in terms which we're not familiar with usually."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1479.85,"end":1509.87,"speaker":"Jonathan Pageau","text":"Yeah. Well, in terms of authority, there are some interesting examples that can help you to understand what this could mean. Like, I'll give you an example. I forget the name of the saint, horribly. It's a Russian saint in the Orthodox Church, where it was an aristocrat who, in her city, the priest was known to have affairs with women and had prostitutes and whatever in his home. And she knew about it."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1509.95,"end":1510.35,"speaker":"Mark Manolopoulos","text":"Right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1511.31,"end":1512.47,"speaker":"Jonathan Pageau","text":"And so this."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1512.47,"end":1512.79,"speaker":"Mark Manolopoulos","text":"Yeah."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1512.79,"end":1587.1,"speaker":"Jonathan Pageau","text":"So you have a problem, which is you have this authority which is corrupt. And so on the one hand, it's like you don't want to rebel against the authority to kind of destabilize society. But on the other hand, the recognition of this corrupt authority. And so you also don't want to give in to the corruption that this authority represents. So the story has her going into the room with the priest and the woman while they're actually doing it and taking the woman out of the bed, throwing her out of the room, then turning to the priest, getting down on her knees and saying, father, I need to confess my sins. And so there are other versions of that. Like, you know, we talk about Saint Francis of Assisi. There are images of him doing similar things where someone says, what about this priest who's living with a woman openly? And he says. He goes down and he says, I'm not even worthy to kiss this man's feet. And so he's, like, shoveling ash. He's shoveling, like, you know, burning coals on this head, where all of a sudden it's like, if he doesn't change his ways, he's going to hate himself and burn inside for the rest of his life. You know, so there's these images of how to deal with corrupt authority that then show this how self sacrifice can actually transform reality."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1587.9,"end":1620.57,"speaker":"Mark Manolopoulos","text":"Right. It's interesting because in the story she's act. She has less invective against all these guys. She's used, you know, saying, you know, you know, you're all going to, you know, go to hell, your gods are false, what have you. But she had no point is trying to like, I don't know, incite a rebellion. And we see that coming back to that weird thing with the. Her Christian executioner at the end. She says basically, they do your duty and kill me. And even he. I mean, there's again, there's a weird suicide at the end. But the whole point is that it wouldn't have fit with the pattern of the story for either her to lead a rebellion. Certainly not. But even for him to have kind of."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1621.65,"end":1674.48,"speaker":"Jonathan Pageau","text":"And I think that the reason, maybe this is why I think that she was killed by this Christian soldier is because the whole story is about not giving in to the corrupt authority and so about a way to resist the corrupt authority. And so obviously the image of the sword obviously does have some sexual connotation. You can't avoid the those connotations when you read kind of chivalrous stories. And the idea even that there is this relationship. And so in being killed by the Christian soldier, it's as if even in her death she never gives in to the corrupt pagan authority, even though she has to die. The story leads to a point where she actually never submits to this pagan authority who's trying to dominate her in a corrupt way."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1675.28,"end":1675.52,"speaker":"Mark Manolopoulos","text":"Right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1675.6,"end":1679.44,"speaker":"Jonathan Pageau","text":"So I think that's probably why they have the Christian killing her."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1679.76,"end":1682.4,"speaker":"Mark Manolopoulos","text":"Right. And her telling him to do it. So she accepts it. It's not."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1682.4,"end":1687.04,"speaker":"Jonathan Pageau","text":"Yeah. And she accepts that this is her fate and this is how the story has to go, you know."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1687.2,"end":1731.97,"speaker":"Mark Manolopoulos","text":"Right. Well, it's interesting because in a lot of ways she seems to be a really good example of the feminine hero. Right. The way that that kind of character approaches the battle with the dragon in a way that someone like St. George or, you know, in a more secular context, Beowulf or what have you is not going to do. But at the same time, there are these kind of interesting markers that's still active sense. Like there's a part where she takes. It's not. So she's visited by multiple demons. The first one that looks like the dragon. Then another one shows up and she throws him to the ground and puts her foot on his neck. It like dings him there, which is. So that's kind of violent and active, but I think even that is participating ultimately in still a kind of symbolism of the feminine, even though it's little bit more."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1732.13,"end":1793.2,"speaker":"Jonathan Pageau","text":"No, you're right. And there is. But it's not just that. There is a sense in which sometimes these stories, when it's like. When it's relating to the. Also to the kind of foreign king, let's say there is a place for a interesting active element of the feminine. You know, when it is like the idea of rejecting the foreign suitor or rejecting the. The foreign authority. So, like that image of her pressing down her neck on the demon. In the Bible, there's a version of that which is the story of Jael. And so Jael is this prophetess and this foreign king who's trying to invade Israel, comes to her tent and she receives him in her tent, and then she acts like a kind of a mother lover to him. She gives him a blanket and she gives him milk to drink. And so she. She has him. She puts him in this, like, comfortable situation. And when the king is asleep, she nails his head down on the ground with a spike. Have you seen this story before?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1793.68,"end":1809,"speaker":"Mark Manolopoulos","text":"Yes. Well, I had actually forgotten about it because I was thinking about Judith in the Holofernes, where it's kind of similar. She seems like she's gonna, you know. Yeah. And she cuts his head off. I had forgotten that. It has this almost the same pattern in that one too, but with the snake to the temple. That's right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1809,"end":1838.32,"speaker":"Jonathan Pageau","text":"Yeah. And so there is something about the idea of the rejecting the foreign suitor in the sense of the one that isn't your husband or that isn't your authority or isn't your husband or whatever, that all of a sudden there's this activation that happens, and it's like, you know, anything goes. And there's even like a reversal where she's acting in a. Like she's penetrating the character. She's penetrating the foreign king in a very violent and disturbing way."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1839.21,"end":1865.88,"speaker":"Mark Manolopoulos","text":"But I guess getting to come back what you were saying before is like before you had the societal shift in terms of, you know, the relationship between masculine and feminine being based in kind of consent of. In a lot of pre Christian cultures, the woman had to fight off the suitor. Right. Otherwise he's his wife. So there's that kind of, like you said, this activation of, you know, if he comes to take you by force, you have to violently fight him off. That's kind of the way that you express your, you know, your proper nature, I guess. Yeah."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1865.88,"end":1884.44,"speaker":"Jonathan Pageau","text":"And it's possibly like one of the reasons why they have it, because it would have. Probably one of the reasons why it's the dragon that she. That she ends up physically fighting off is also to solve the problem of, like, you know, the problem of the, let's say the Christian martyr facing his."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1884.92,"end":1885.48,"speaker":"Mark Manolopoulos","text":"Or her."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1887.24,"end":1901.36,"speaker":"Jonathan Pageau","text":"Persecutor, how it isn't proper for them to turn around and. And be violent towards the persecutor. So there's all of that kind of going on in the story, which definitely makes it a very fascinating. A very fascinating story."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1902.4,"end":1944.23,"speaker":"Mark Manolopoulos","text":"Right, well, and it's funny because, like you said, yeah, she can't. She can fight against the dragon, she can fight against the demons, but she can't physically fight against the actual physical foes. And yet, you know, centuries later, you have, you know, probably the most famous, you know, female saint for a lot of people in the kind of the secular world, Joan of Arc, hearing voices from various female saints, one of which is Saint Margaret. But there you have a very different kind of manifestation where you have, I mean, she's dressing as a man, she's leading armies, she's physically fighting against the English. But then when it comes to her own version of her own martyrdom, then she seems to kind of take a closer to kind of St. Margaret role where she's not."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":1944.23,"end":2010.6,"speaker":"Jonathan Pageau","text":"Yeah, because she's doing it. Also. The idea of. Of Joan of Arc is that she's also doing it completely in submission to her king. Like, everything she's doing is in order to save the king. And this is also the power of Joan of Arc is that she saves the king, despite how he basically ends up selling her away to the English. And one of the reasons why she dies in the hands of the English is because the French king never bothered to. To lift a hand to save her. And so there's a tragedy in that. In that story, but definitely, like, there's. There is. There's. Like I said, there's room for these feminine exceptions that you see in the. In the stories. Like, the story of Joan of Arc is definitely one of them where kind of she. She joins these extremes together in a way that, because she's also a virgin, it's important that she's a virgin in the story. It's like she's this virgin warrior. You know, she's almost. She's almost an Amazon, like In terms of the symbolism, like she really is close to an Amazon, but it's like a holy Amazon, something like that."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2011.24,"end":2028.52,"speaker":"Mark Manolopoulos","text":"Right. Well, it's interesting because usually if you're looking at things that are trying to find the kind of pre modern manifestation of the heroic feminine, usually the Amazons is where you turn. But if you read, you know, if you look at how they actually appear in the Greek sources, there's really nothing heroic about them. They're monsters."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2028.52,"end":2030.68,"speaker":"Jonathan Pageau","text":"They're monsters. The Amazons are monsters."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2030.68,"end":2031.71,"speaker":"Mark Manolopoulos","text":"Yeah, that's right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2031.95,"end":2048.75,"speaker":"Jonathan Pageau","text":"So you could see Joan of Arc as a saving of that monstrosity, like a healing of the. Just like Christianity always ends up including all the strange elements of paganism back into itself, but transforming it in a way that is, that makes it also different at the same time."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2049.79,"end":2072.89,"speaker":"Mark Manolopoulos","text":"Right. So would you kind of conceive of then if we're trying to think of, okay, what is the feminine hero or what is the kind of feminine manifestation of the heroic, Would it really kind of be something that while it's participating in some of the same patterns as the masculine version, insofar as it's some kind of overcoming and it could involve a physical aspect that there's still an interiority maybe to it that's kind of more emphasized?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2073.53,"end":2203.46,"speaker":"Jonathan Pageau","text":"I think it just, I think there are different versions of the feminine hero. And I think that the version that we get in St. Margaret is, let's say, the people resisting a corrupt authority. Right. And so that, which, and so you could see it in all kinds of guises, you know, and the, you know, the woman resisting a corrupt authority without, without herself, let's say, betraying herself or becoming the monster that she's resisting, you know, and so that's always the problem of resisting authority. And you see it in any revolution, which is the revolutionary becomes the monster they were trying to fight against. So how, how does the Christianity deal with that problem? And stories like the story of St Margaret help us to see a Christian answer to that problem. And so that's one version of the, of the female, of the feminine hero. The other version of the feminine hero is of course, the secret influence. Like the secret influence is one of the most powerful versions of the Christian hero, of the feminine hero in Christianity, which is the one who moves things outside of the story in a secret manner. And so if you look at how every single nation converted to Christianity, every early Christian nation, there's always a woman behind that conversion. And you know, whether it's the Constantine's mother, whether it's Vladimir of Kiev's mother, whether it's the wife of different. Of the northern kings in Western Europe, there's always a woman who converts first. And then you don't hear about the discussions, you don't hear about them. But then her son, her husband, you know, Augustine, the Cappadocians, In Basil and St. Gregory, it was their sister. And so it's just like. It's a universal Christian story of this kind of secret hero that is actually turning the world without, you know, in a kind of silent way, by creating. I always say it's like by creating a space, by opening up a space for then her male counterpart to act in something like that."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2203.78,"end":2226.91,"speaker":"Mark Manolopoulos","text":"Right. It's interesting because even in the Germanic tradition, you have this sense of often queens or princesses being. They use the term peace weavers. The idea is that they weave peace. So because behind the scenes, whether it's through council, through marriages or what have you, that they're actually bringing kind of warring sides together. But they don't talk about it in a kind of explicit way."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2227.15,"end":2239.39,"speaker":"Jonathan Pageau","text":"Yeah, but it's also. It's important because it's an important aspect of reality. And it's an aspect of reality which, because we are so. We value the masculine so much that we can't see it."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2239.71,"end":2240.03,"speaker":"Mark Manolopoulos","text":"Right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2240.03,"end":2300.24,"speaker":"Jonathan Pageau","text":"We have destroyed the private sphere. We've made everything public. Everything is like this. You know, there is. We're reducing the private to the minimum. And so that was also in tradition, that was also the space of transformation that happened in the. In a feminine. Let's say in a feminine guise. You could say, you know, that the type of transformation that happens, the forming of the world that happens in the womb, was something which manifests itself also at different levels of reality, this kind of secret change that happens. And so by overvaluing the masculine now, we think that that's the only thing that matters. Like, we think that that's the only thing that counts. That in order for, for example, a woman to have value, then she needs to act like a man. She needs to do all these masculine things. And the other aspect, this powerful aspect of reality is discounted as being stupid and irrelevant. And it's not. It's super important. Without it, the world doesn't work."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2301.2,"end":2357.04,"speaker":"Mark Manolopoulos","text":"Right. Yeah, well, that's. And that's kind of why I really wanted to kind of look at St. Margaret, because I thought, well, you could look at St. Joan of Arc. I mean, that's also a really interesting. As we've already touched on, but it could be easy to just look at examples of the feminine hero that are very close to the masculine as opposed to looking at one that isn't following that. I mean, it is a little bit, because again, we have the overcoming of the monster. But again, if you're looking at it from a material, historical point of view, it's like, well, she resisted the advances of this guy and then was executed. It's not like going out and leading an army and overcoming the villain. And it's not like that at all. Because I do think it does seem that we don't. Almost seems like society doesn't consider that heroic in the same way or of the same value as the masculine traits of going out in the world and kind of doing something actively as opposed to kind of privately resisting something and even to the point of death in the end."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2357.76,"end":2409.71,"speaker":"Jonathan Pageau","text":"Yeah, because most of the time, in terms of dealing with corrupt authority, that's a problem most of us will have way more than conquering some other, like, something. It's like we're all of us in terms of the people. We have a feminine role compared to our authorities, compared to the police, compared to. To the hierarchy that's above us. Like, most of the people you'll meet in your life all have a kind of relatively feminine role to play in the social sphere. So we need to understand how transformation can happen in different ways besides conquest and all these kind of more, let's say, images of these more masculine actions. So it's useful to understand this, or else, you know, then we. We'll just be bitter and we won't be able to function in reality."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2411.23,"end":2488.79,"speaker":"Mark Manolopoulos","text":"Right. Well, it's interesting at this time period, you know, kind of moving from the, you know, the 1100s into the 1200s and kind of the late Middle Ages of how there starts to be a little bit of a reframing about how these kinds of traditional stories, often originally oral stories, are received in terms of their kind of utility for the, you know, whether that's the polis or the other kind of the community at large. Insofar as, like, there's a time when these kinds of stories are massively popular in England and particularly St. Margaret, I mean, amongst the ladies. So clearly they realize that this has, like, they're not just reading it for entertainment. Although, you know, maybe that's an aspect, but they clearly can feel like they can get something out of it. But then as the more kind of intellectual, elite type, you know, literate society starts feeling like these kinds of stories don't actually reflect reality. Right. Because there's not dragons in reality. And they burst into, you know, dust and you make the sound of the cross with them. They start taking them out to the point where in this, this already in this 1100 story, it's like. Well, the demon looks, looks like a dragon, but it's not really a dragon. And he doesn't swallow her, he just wants to swallow her. And then she makes a sign of the cross and it goes away. And then eventually they just start telling. Stop telling her story altogether and to the point where she's kind of forgotten."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2489.51,"end":2582.48,"speaker":"Jonathan Pageau","text":"Yeah, but I think that it's this move towards. It's kind of like the beginning of the pendulum swing, you could say of modernity. Already in the 12th century, you see it starting how this kind of move from hyper rationalism to irrationality that maybe finds its highest, its highest, easiest way, easiest version to see in something like classicism and Romanticism in the modern age, these two extremes would start to manifest themselves. Because the problem is that this is why these stories are so important, because they actually are a space of participation in which the more irrational, fantastical elements of our psyche are integrated with the story in which you can participate in. Right, because St Margaret was seen as a person that existed that you could look up to, that you could follow. Whereas now we have these weird extremes, which is, like I said on the one hand, the kind of critical, historical, forensic version of factuality. And then Harry Potter. And so then we have Harry Potter and this, and we have these two things that completely have nothing in relationship with each other. And the same person that loves Harry Potter will make fun of a story like St. Margaret, you know, and so it's like in the ancient world there were spaces in which these two extremes of participation were joined together in these more legendary stories. You could say, right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2582.56,"end":2622.91,"speaker":"Mark Manolopoulos","text":"I think it's a really important point because even though you can read a story like, say, Margaret as literature, and you could read it like you would read a Harry Potter novel, at least in theory there's a difference in terms of what it was meant for and what it was used for for the. Certainly for the whole period of its popularity throughout the Middle Ages, is that you're. It's not just a story that you read for entertainment, not only because you can get something out of it of kind of greater value than simply being entertained, but also, like you said, this is considered to be a person who lived and this is considered to be. Yeah, there's a reality to the story, even if we don't see it that way, that is participative, that you're actually. You can enter kind of into her story to a degree."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2622.91,"end":2667.01,"speaker":"Jonathan Pageau","text":"She would have had a feast and people would have celebrated and there would have been churches named after her and cities named after her. And so it's like there would have been a way to participate in her story and to celebrate her story. That wasn't like the kind of weird. The weird geeky cosplay stuff that you see. Like, that isn't something that is kind of so weird and removed from reality that it's just like it doesn't participate in life. Whereas celebrating St Margaret and celebrating her feast and maybe having a procession or whatever it is that people would have done for her feast to celebrate her was something that was integrated into their, let's say, yearly cycle."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2668.05,"end":2687.82,"speaker":"Mark Manolopoulos","text":"Right. There is a sense where a story like this, what it produces is something like an icon that you might carve that's going to. Going to have a different function than a story of a dragon, like, you know, Smaug and Bilbo or something from the Hobbit. Right. That might produce art, but it's not. It's not the same because its connection to reality is at a different level."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2688.14,"end":2724.76,"speaker":"Jonathan Pageau","text":"Yeah. Like, I did carve an icon of St. Margaret. And that icon, it was for someone whose daughter is named Margaret. And that is going, you know, and it's going to go into a room and she'll be told the story and, you know, it's her patron saint maybe, you know, that she'll have a special prayer to St. Margaret in, you know, in her daily life. And so that's a participative thing. And so it becomes a model for her. It becomes a, you know, like, it's not, like you said, it's not just something you buy toys for. And like, that is just this kind of fictional world that you can't really live in."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2725.48,"end":2753.24,"speaker":"Mark Manolopoulos","text":"Right. And that's actually the idea of naming, I think, is kind of interesting. I would assume that this story of St. Margaret is one of the. I think she's really probably the main source of most, you know, people naming their children. Margaret is probably generally would be after her. Yeah. Historically speaking. And just how that's. That is a different process than the kind of thing now where it's becoming more popular to name children after characters from fictional things. You know, like, oh, I'm gonna name my child."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2754.76,"end":2758.12,"speaker":"Jonathan Pageau","text":"The first time I met an Anakin, I was like, dude, what are you doing?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2758.89,"end":2759.93,"speaker":"Mark Manolopoulos","text":"Didn't you watch the movies?"}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2760.25,"end":2763.85,"speaker":"Jonathan Pageau","text":"Yeah, exactly. This doesn't end well. This doesn't end well."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2765.13,"end":2766.09,"speaker":"Mark Manolopoulos","text":"Oh, boy."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2767.21,"end":2830.75,"speaker":"Jonathan Pageau","text":"Yeah. But indeed, there is. Like, this is some. One of the points that I've been making for a few years is that there's a strange moment now in history where, on the one hand, churches are trying to be as close to entertainment as possible and have taken up the concert model and using advertising tropes and popular music and all that, but at the same time, entertainment is trying to be more participative. And so you have people who, like I said, dress up as their characters, have cosplay events. There's something called the Church of Harry. I think it's called the Harry Potter and the Sacred Text, which is like an organization. They meet every week and they have liturgical readings of Harry Potter books together. They meditate on the meaning of Harry Potter. So it's like a Harry Potter Church, you know, but you can't live in the world of Harry Potter. Like, you can pretend and you can. You can have. You can wear little hats and you can. You know, but. But in the end, it's. It's. It's. It's. There's. It's factitious and it's schizophrenic to try to live in a world like that."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2831.79,"end":2866.37,"speaker":"Mark Manolopoulos","text":"Right. Well, that's funny that you mentioned that, because one of the things I think that is really hard to often get across, especially if you're trying to kind of introduce people. People. The concept of kind of literary study is try and make it clear that literature is not the same thing as entertainment. There's crossover, for sure. It's not like they're completely separate spheres. But the idea that we have. There's a reason why, historically we have a distinction between literature as a kind of manifestation of culture in a kind of higher sense, and entertainment as just that. That thing that we go to kind of, you know, have fun and. Yeah."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2866.77,"end":2868.05,"speaker":"Jonathan Pageau","text":"To steam off and to rest."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2868.13,"end":2868.65,"speaker":"Mark Manolopoulos","text":"It's like."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2868.65,"end":2874.05,"speaker":"Jonathan Pageau","text":"It's not necessarily the idea of resting, which most entertainment seems to be part of."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2874.05,"end":2946.56,"speaker":"Mark Manolopoulos","text":"Yeah, right. Yeah. So I think that's. I think that's really, really helpful to kind of put the story in all of these various contexts. We've kind of gone through a lot of stuff, but I think all of it is hopefully kind of illuminating of why. Why a story like this isn't just, you know, a relic of kind of the past that you can kind of, you know, forget is just silly or, you know, not relevant or, you know, it doesn't have any kind of. You know, we don't tell stories like that today. So how does it how does it relate to kind of, you know, the modern conception of heroism or whatever happens to be. But I think if you take all of these things into account, then it really does form a pattern throughout. I mean, it's really explicit in the West, I think, in the Western literary canon. But even beyond that, this is a kind of a structure of a story and how it lays itself out and these symbols reappear. And that if we understand how these symbols work, then we can hopefully apply it to other things that. If you then go on and read Beowulf, totally different kind of hero, totally different kind of story, but the dragon is going to be somewhat similar in terms of what he means. Yeah, exactly."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2946.88,"end":2976.85,"speaker":"Jonathan Pageau","text":"It's going to be similar, and it's also going to be something which can help you when you meet your dragon. See, the thing about the dragon is that if you give a specific thing, like if you give a specific thing which appears to you as a manifest itself as a dragon, when you retell the story, it doesn't have the same power because it's not universal. And so a lot of times what happens in these ancient stories is that categories tend to contract."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2977.41,"end":2977.73,"speaker":"Mark Manolopoulos","text":"Right."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":2977.73,"end":3029.5,"speaker":"Jonathan Pageau","text":"And so they contract to a point where they become understandable for a very long time. And so if you give something which is too detailed or too particular, then it has a limited lifespan. Right. But if you give something that is a contracted category, then it has a much longer lifespan because it can kind of cross through the ages. And so, you know, there are certain images. Like, a dragon is, of course, one of the ultimate images. That is a contraction of all kinds of categories of experience into this very powerful image. But you can encounter a dragon, it can happen to you. And then when you tell the story, you know, you can give the details of it, but sometimes it's probably better to use a mythical image because it's the one that reflects your experience of it the most."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3030.7,"end":3045.34,"speaker":"Mark Manolopoulos","text":"Right, right. It does kind of make you wonder how many of the stories that have currency or popularity now, like, how many of those are going to last if they're not participating in those kinds of patterns, as opposed to these more ancient stories, which last for millennia."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3045.34,"end":3082.21,"speaker":"Jonathan Pageau","text":"Yeah. That's one of the reasons why movies might not last very long, because movies are so type. Like, they're so the type of the movie is so set. Like if you have a story about drug dealers and all these different things, and, you know, in a few hundred years from now, those just might not be even understandable to anybody. No one would even know what it is that the movie's referring to. Whereas the stories, which embody more universal patterns and are using tropes which can span through time, then those will just naturally survive in the long run because they're not so idiosyncratic."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3083.25,"end":3117.34,"speaker":"Mark Manolopoulos","text":"Right. I guess that's kind of what the purpose of the canon used to be insofar as, like, the text which didn't have that got weeded out over time because they weren't copied down. And then the ones that were copied down are the ones that lasted are the ones that had some kind of significance that transcended. So, like, Homer is relevant in all ages, not just in ancient Greece. Whereas now we have this weird thing because we preserve everything and, you know, and also a lot of these hierarchies are broken down. So the idea is like, well, you teach something as relevant and as political and, you know, it's going to speak to some kind of current issue, but like, is that going to."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3117.5,"end":3189.32,"speaker":"Jonathan Pageau","text":"Is that it's not going to last forever. Because one of the problems we're having now, and it's a big problem, everybody's seen it. It's the problem of the hierarchy of information is that we've created a world where information is near infinite, but attention is not infinite. And so there is a natural way in which the information will lay itself out in the hierarchy to you, and that hierarchy will end up look like a mythical structure. It can be, especially now, like with the social networks and Google and search engines. It can be manipulated and it can be manipulated politically, which is happening. But nonetheless, the problem of a hierarchy of attention is something that you can't avoid. And it'll make it that, you know, the third series of some random sitcom that no one ever cared about, like the third season is just. It's just not going to be easily in your attention span because it's. So far there's so much to attend to that it's just going to vanish. Even though it might exist physically on some server somewhere, it's still not going to. It's still going to be on the. On the fringe of people's attention."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3189.96,"end":3204.44,"speaker":"Mark Manolopoulos","text":"Right, right, exactly. And I guess it's kind of interesting that something like this, you know, the state market has been on the fringe probably a lot of places for a long time now, but through, you know, forums like this, I guess, I don't know, bring it back into people's attention, I guess."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3204.84,"end":3259.54,"speaker":"Jonathan Pageau","text":"Well, it's. It's relevant. It's relevant today. And also the reason why it was. It was eliminated was maybe not the right reason. And so I think that as postmodernism has its way and kind of modernistic thinking has its way, it's gonna have a surprising effect, which is going to be restoring some of these old stories that people discounted as silly just a few decades ago. Because the level of that story is no different than the level of the stories in the Bible. If you're bothered by the story of St. Margaret, you know, why aren't you bothered by the story of Tobit? And why aren't you bothered by, you know, the story, the Leviathan described in Job, or the Behemoth, or all these monsters, and the fact that God says in the first chapter of Genesis that he created sea monsters? It's like, you're going to have to deal with that stuff. You can't just. You can't just toss it off to the side. It's coming back."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3260.18,"end":3272.39,"speaker":"Mark Manolopoulos","text":"Yeah, exactly. It is so much easier, too, like when, you know, so you can look at the Norse stuff and you see the Midgard serpent encircling the world. And instead of that being like, oh, that's just like a cool Viking thing, it's like. No, that's like. It's in the Bible, too."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3272.71,"end":3274.15,"speaker":"Jonathan Pageau","text":"That's pretty universal, my friend."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3274.31,"end":3276.63,"speaker":"Mark Manolopoulos","text":"It's pretty universal. Exactly. It's all over the place."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3278.07,"end":3281.35,"speaker":"Jonathan Pageau","text":"We have our own. We have our own serpent encircling the world. Don't worry."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3282.23,"end":3289.51,"speaker":"Mark Manolopoulos","text":"It's out there somewhere. It's great. All right. Well, I think this was a really good conversation, I have to say."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3290.55,"end":3292.23,"speaker":"Jonathan Pageau","text":"Well, I hope it's useful and."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3292.31,"end":3292.71,"speaker":"Mark Manolopoulos","text":"Yeah."}
{"episode_id":"SW - #148 - 2021-03-17 - Mark Doerksen - St. Margaret the Dragon Slayer","start":3292.71,"end":3362.27,"speaker":"Jonathan Pageau","text":"And to. And I hope it will also be useful to your students. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
