{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":0.48,"end":57.96,"speaker":"Jonathan Pageau","text":"Hello, everybody. I'm really excited to be back here with Richard Rowland to continue the universal history. If you have not seen our first video, it has really taken off and also just sparked so much discussion. He's now flooded with emails. He tells me of all these people who want to ask about everything from universal history to psychedelics. And so I'm really happy that that's happening because Richard is a very interesting person and I'm looking forward to kind of continuing this conversation as we move forward. This is Jonathan Peugeot. Welcome to the symbolic world. So Richard, what is it that you wanted us to talk about today?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":58.76,"end":143.02,"speaker":"Richard Rohlin","text":"So now that we've laid out the idea of universal history and tried to establish the idea that the way that they thought about history in the ancient and the medieval mind, that that way of thinking about history and of reading history still has value and meaning to us. What I thought that we could do would be to take a closer look at one of the main patterns that I see within Western history, within the whole medieval project. And by Western, I mean, I mean the whole medieval Christian world, you know, so including Byzantium and that. And so I thought, what I thought we could do is take a closer look at this. One of the main patterns that manifests itself kind of over and over again and that really helps us to navigate the moment that we're in right now. And that's the pattern of Christ and Antichrist. So this actually starts, I want to start with kind of a deep pull here that maybe a lot of our listeners won't be familiar with. And that is a guy named Mithridates VI of Pontus. So Mithridates is a super interesting guy. He ruled over the kingdom of Pontus and over much of Anatolia. Again, so this is a guy, he's from the east, he's specifically from Anatolia, which is, which seems to keep coming up for some reason. And he's actually a descendant of both Alexander the Great and also of Cyrus."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":144.22,"end":145.02,"speaker":"Jonathan Pageau","text":"Oh, interesting."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":145.42,"end":214.16,"speaker":"Richard Rohlin","text":"So he basically understood himself. His self understanding was that he was the inheritor of both east and west, of both Greece and Persia. Right. So he's living, you know, Anatolia is the space that's sort of like on the border between these two worlds. And so he understood himself as, as having inherited both of these things. And he has a lot of, let's say messianic features about his life. There was a comet in the sky that was seen when he was born and all this other stuff. So he's, he's a really interesting figure. And when he's Quite young, I think about 10 years old or so. His mother actually tries to kill him along with. Along with his father and kills his father. But Mithridates escapes, and he spent the next 10 or 15 years kind of on the run, in hiding. And he's traveling around to all these different. These different tribes and these different kind of wild groups that are on the edge of Anatolian civilization. And he's making alliances, he's learning how to lead, he's learning how to fight, he's learning how to poison. His nickname is the Poison King because he just poisoned so many people. He also."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":214.16,"end":216.96,"speaker":"Jonathan Pageau","text":"This is in the first century BC is my understanding, right?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":216.96,"end":278.98,"speaker":"Richard Rohlin","text":"Yes, that's right. Yeah. Yeah. And so he. He also. He also. One of the things he's really famous for was developing basically like a universal antidote. And we don't know if he really succeeded in doing it or not. There's kind of like conflicting, you could say conflicting evidence. But the thing that he's famous for is developing something called mithridatum is what it's usually called now named after him. And it's the idea of basically it's got a small amount of every single poison in it. And so you take a dose of this every day and you build up. And you build up an immunity diet powder for those of us who are Princess Bride fans. So Mithridates, he did that. He had this dose that was like all these herbs and small amounts of poisons and stuff, and he took it every day. And he lived a really long time. So I don't know what's going on there. I'm pretty sure from a modern scientific standpoint, taking a little bit of arsenic every day is maybe not the best thing to do. And nobody really knows what was in it."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":278.98,"end":280.94,"speaker":"Jonathan Pageau","text":"No one knows. Yeah, it's a lost formula."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":281.02,"end":287.26,"speaker":"Richard Rohlin","text":"Yeah, yeah, it's a lost formula. But during the Middle Ages, actually, the whole lot of people tried to re. Like, figure it out."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":287.66,"end":289.58,"speaker":"Jonathan Pageau","text":"It was like the philosopher's stone of poison."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":289.9,"end":377.57,"speaker":"Richard Rohlin","text":"It really. Yeah, yeah. Or. Yeah. So anyway, so he comes back, poisons his mom and takes over the kingdom and becomes the worst enemy that the Roman Republic had fought since Hannibal Barca. And basically he just becomes. He's. He's considered one of the three great enemies by the Romans themselves, who always respected their enemies greatly. He was considered, along with Pyrrhus and with Hannibal, one of the three great enemies of the Roman Republic. He's eventually defeated by Pompey the Great and dies, according to. According to history, dies by suicide. Of course, the Story there is pretty fun. It's that he. He tried to poison himself and it didn't work because theoretically he was immune to it. He was also just an enormous man, like physically enormous, very powerfully built. So maybe, maybe, you know, who knows? But anyway, so eventually he either stabbed himself or he had one of his slaves stab him. But when he died, because he'd been such a nuisance to the Roman Empire when he died, there were legends which began to arise almost immediately after his death that he hadn't actually died. These legends that he had actually gone. He had a. He had a wife who was like. One of his wives was like the city and Amazon warrior. And so he had even like at one point had this like group, group of Amazons, like as his bodyguard. Really? He rolled with, I mean."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":377.57,"end":378.93,"speaker":"Jonathan Pageau","text":"Yeah, like Gaddafi."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":379.17,"end":381.77,"speaker":"Richard Rohlin","text":"Yeah, yeah. Or. Or like Wakanda or something."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":381.77,"end":383.01,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":383.01,"end":420.06,"speaker":"Richard Rohlin","text":"Like he's a fascinating guy. All the stuff that I'm saying. By the way, there's a really fun book called the Poison King, the Life and Legend of Mithridates, Rome's Deadliest enemy. And it's by Adrian, Adrian Mayor. And you can, you can find it on Amazon and audible and places like that. It's a, it's a really fascinating piece of history. But anyway, so one of the legends is that actually he goes north with these Scythians, you know, these, these Amazons to Scandinavia and that he is the origin of the Gothic people who come back for revenge against Rome a couple of hundred years later."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":420.3,"end":421.1,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":421.26,"end":616.77,"speaker":"Richard Rohlin","text":"Yeah, so. Or more than a couple hundred. But, but so all the way into the time, like when, when Rome starts dealing with a really serious barbarian invasions, one of the beliefs that they had in Rome was that this was Mithridates coming back. And actually they identified Mithridates with Odin and they. And so it was actually a. Like a pre Christian euhemerizing of Odin where they identified this, this figure from their past with the, this, this very fierce warrior God, but who's also. I mean, Odin's not just a warrior God. He's a. He's a trickster figure. Like he's always tricking people into things, which is very much like Mithridates and his, the way that he did things. So, so you have, so you had this idea then that, let's say the pattern and this is where the pattern of. It's both the pattern of Christ and of Antichrist. Right? The idea that you have a principality that is cut off, but then it reappears somewhere else unexpected later on. And so Mithridates is kind of the type of this. And one of the really interesting things that happens later in Roman history after Nero's death is that a lot of this gets transferred to Nero. So when Nero dies and this is in. I mean, we talked about the Sibylline oracles last time, right? This is in the Sibylline oracles. Nero, Resurrection of Nero or the resurrection of Nero. Yeah. And the idea is that Nero didn't really die, but that he actually escaped and he went to Persia. So it's always from the East. Right. So he escapes and he goes to Persia and then he's going to come back basically as this antichrist figure, as God's instrument of judgment against the Romans. That's how it is in the Sibylline oracles. So there was this idea that Nero, again, the idea of the principality being cut off and disappearing and coming back. Now I said this is the pattern of both Christ and Antichrist. Because, of course, within the Hebrew tradition, you have the idea of the stump or the root of Jesse. Yeah, Right. So the idea, you know, in this is in the prophecy of Isaiah. So that's in like the 700-bc that the, the line of David, the line of Jesse is going to be cut off. Right. And so a lot of times are like our King James translation says the root of Jesse, but it's the Hebrew. The word in Hebrew is really the word for a stump. And so the idea that the, the line of Jesse, like a tree, will be cut off and it'll be just completely obliterated. And then in a time that's unexpected, that's unlooked for, they're going to start being these shoots that come up. And that's, of course, you know, that's, that's the. The church understands that as the Theotokos and as Christ. So that's the. That's the kind of basic pattern that we can establish. And so by the time we get to the Book of Revelation, we see this pattern both in Christ and in the figure of Antichrist. Right. So you've done your. You've done a really great video on the. What did you call it? The system of a beast? Is that what it was called? Yeah. I'm really waiting for part two. I'm very excited."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":616.85,"end":637.97,"speaker":"Jonathan Pageau","text":"It's becoming the most complicated thing I've ever written. I'm trying to write this video on the mark of the beast and explaining what a mark is to people. It's so deep that it's. I struggle to do it in a way that won't be. Just go over people's heads. Like, it just. Just kind of not seem like what I want to make it seem like. So it's coming. I worked on it last night, very late. Good night."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":638.05,"end":659.45,"speaker":"Richard Rohlin","text":"Good, good. I'm glad to hear that. I'm really. I'm really looking forward to it. So. So in the book of Revelation, right, you have both this pattern of. Of Antichrist. Right. The little horn and Daniel and, you know, all that stuff. Right. So it's the idea of a principality that get. Gets cut off and then it comes back again later."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":659.61,"end":660.05,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":660.05,"end":701.51,"speaker":"Richard Rohlin","text":"But then also, ultimately, that's also the pattern of Christ, you know. And so, you know, it's not hard to understand the Antichrist as being sort of like the dark mirror of Christ. So if Christ is the master pattern, the Antichrist is the inversion of that somehow. Yeah, but what I think a lot of people don't understand or what they get really hung up on is, you know, you've got. You've got people who want to go and do just a purely historical reading of Revelation. And so they say, they'll say, oh, well, this Antichrist figure here, the beast or whatever, that's a Nero. It's only Nero. It's just Nero, you know, and the Christians mistakenly believed that he was going to come back, you know, and he never did. And so there you can see. Revelation is bunk."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":701.51,"end":761.61,"speaker":"Jonathan Pageau","text":"Yeah, that's man. Yeah. I mean, it's silly because like you said, there are so many versions of this pattern, and it has to do with the. It does have to do with something like the scale. It has to do with something like the enemy or the evil that is cast out but goes and wanders in the desert, let's say. But that this wandering can end and that this thing can come back because those remainders never get dealt with. There's an ancient Scandinavian story about the demon Sirt, I think he's called, where he comes to kind of attack the world and judge the world on a chariot made of everybody's fingernails. And this is the most. This is the best image of what this is about. It's like you clip these little things off these remainders of your body, your hair, your fingernails, all these remainders, and those have a power. I talked about this in the video. I did, actually. Sorry, I realize it's a patron only video on the symbolism of the inverted pentagram."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":761.61,"end":764.49,"speaker":"Richard Rohlin","text":"Or talk about how that was such a good video."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":765.37,"end":786.21,"speaker":"Jonathan Pageau","text":"The idea that black magic is about understanding the power of these remainders and how if we See the world that. Because we understand that. That the world has a. Has a totality, that anything you cut off, it has a power, it has a possibility of returning in revenge, let's say. You know, and I don't."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":786.21,"end":791.85,"speaker":"Richard Rohlin","text":"Did you. This is a totally random question, but did you ever read a book by Terry Pratchett called the Hogfather?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":792.5,"end":796.02,"speaker":"Jonathan Pageau","text":"I have it. Someone send it to me and I have it, but I haven't read it yet."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":796.02,"end":827.73,"speaker":"Richard Rohlin","text":"It's a fun book. It's one of my favorite books. It's kind of like fantasy, but it's also satire and everything. But like a major part of the plot revolves around collecting all of the discarded teeth of children so that they can. So that they can do, you know, do some magic, like something nefarious. Right. But it's, you know, so they have to like infiltrate the tooth fairy's castle and all this different stuff. And it's. Anyway, it's. It's a kind of a funny story, but also like, it's. It's one of those stories that has these moments of symbolic intuition that are just like a little. Just like a little too on the nose."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":828.05,"end":841.85,"speaker":"Jonathan Pageau","text":"Yeah. But there are many, you know, there are many versions of this story. The problem of the castaway, the problem of the remainder. Like, it's funny because talking about Santa Claus, the entire story of Rudolph the Red Nosed Reindeer, the one, the TV show. That's what it's about, right?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":841.85,"end":842.25,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":842.25,"end":843.61,"speaker":"Jonathan Pageau","text":"The land of misfit toys."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":843.61,"end":844.21,"speaker":"Richard Rohlin","text":"Yeah, the castaways."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":844.21,"end":913.87,"speaker":"Jonathan Pageau","text":"All this idea of these castaways that. That continue to kind of exist in the margins and at some point when the walls break down, they return. It's the same with Gog and Magog. The idea of putting these things out of the world and then they returning. And so the idea of the Antichrist is obviously in Christianity, it's a way to deal with this. It's a way to understand that this is inevitable. That as Christ comes, he cast a shadow and that shadow gets kind of put out of the world. But it has to return. For things to become complete and the story kind of has to be resolved in a way that will encompass all of it together. And so that's why when I talk to people about the image of the new Jerusalem as being something like that, as being something like. Or the crown of thorns as the crown of thorns as being an image of trying to resolve the problem of these remainders that come in the fall, that this problem of cutting off aspects of reality and pushing them to the outside."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":914.27,"end":933.35,"speaker":"Richard Rohlin","text":"I really Love. Just as kind of a side note, I really love thorns as a. That we see in the Genesis story and of course, ultimately in the crown that Christ has on his head as a. As a symbol of the fall, as a symbol of chaos. Because the thing with a thorn bush is that it's something that literally has too many points."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":933.67,"end":934.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":934.39,"end":970.32,"speaker":"Richard Rohlin","text":"And this is the. I mean, this is. I mean, literally, it's got too many points. And this is the. I mean, that's the world that we live in today. You know, it's a world where there's. There's too much. Everything is vying for significance. Like, everything is. Is disorganized. There's no real hierarchy of information, of knowledge, of attention, and just everything. I mean, just the news cycle, Twitter, things like this, where everything is basically constantly coming into our view and saying, I'm the most important thing. Give me your attention. Just at a totally unprecedented rate. Exactly. Too many points."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":970.88,"end":1006.9,"speaker":"Jonathan Pageau","text":"But there's an idea, there's a sense in which this is part of the process. It really is one of the mysteries of Christ, which is that as this multiplicity gets filled up in a way that sometimes is light, sometimes is scandal, in a way, it's almost as if for Christ, all of this is coming together. You can't totally discern what's going on until finally this whole thing gets caught up together into a final revelation. The image that Christ says that scandal must happen. I always come back to that image. But woe to those by who it happens. But the scandal is part of the revelation of Christ."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1007.97,"end":1013.41,"speaker":"Richard Rohlin","text":"So the spoiler is that, you know, Jesus wins, right? Spoilers."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1013.65,"end":1016.85,"speaker":"Jonathan Pageau","text":"Yeah. But in a way that might be very surprising to us. Like, that's the thing."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1017.17,"end":1049.34,"speaker":"Richard Rohlin","text":"That's the thing. Yeah. So you've got something like a book of revelation where here's this antichrist figure, this beast figure that is clearly Nero. Okay. And it would be. Be useless to deny that. Right. Because we know, you know, you can read all the things that the early church wrote about him and that even like non Christian sources wrote about Nero. Like, it wasn't just Christians who believed that Nero might come back as this really negative force. Right. The pagans believe that too. You know, so it's. So you have this figure that's clearly Nero."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1049.58,"end":1051.94,"speaker":"Jonathan Pageau","text":"I would say Nero's coming back right now. That's what I think."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1051.94,"end":1062.54,"speaker":"Richard Rohlin","text":"Well, okay, but you say that. I don't know if you saw this, but I think it's. The British Museum is just opened this exhibit about why maybe Nero was actually not such A bad guy."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1063.09,"end":1063.89,"speaker":"Jonathan Pageau","text":"It's inevitable."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1064.13,"end":1095.8,"speaker":"Richard Rohlin","text":"Like, I mean, I. When I saw that, I was like, well, of course. What else. What else could have happened this week? You know, it's very hard to surprise me at this point. So. So here's that. Here's the inversion that we're dealing with right now is that. Is that everyone hates Constantine, you know, basically. I mean, except for us. You know, like, you, me, and Dr. Mario. You know, like, I had a great exchange with him. It's really fun. And I'm actually really glad that you guys recorded your video before he saw our video."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1096.04,"end":1096.52,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1096.52,"end":1118.61,"speaker":"Richard Rohlin","text":"Because. Because it was just like this independent confirmation. Like. Like, the thing is, like, he knows so much more detail than I do about. About Constantinople itself. And so, for instance, I knew about the palladium being taken to Rome. I had no idea that the Constantine brought it or had one made or whatever in Constantinople. But. But, like, that. That really, like, takes that Troy connection we were talking about makes it. Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1118.61,"end":1119.09,"speaker":"Jonathan Pageau","text":"Brings in."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1119.09,"end":1119.49,"speaker":"Richard Rohlin","text":"It is."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1119.49,"end":1128.85,"speaker":"Jonathan Pageau","text":"In a way, it's like he wanted it to not be Troy, but Troy at the same time. Like, he wanted to create something that was both connected to the ancient but totally new at the same time."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1129.01,"end":1157.53,"speaker":"Richard Rohlin","text":"Yeah. So I loved. I loved that video. It was great. But, you know, everyone. Everyone hates Constantine. But even as we're hating on Constantine, you know, they were talking about taking down a statue of him in York as part of. I don't know if they ever actually did it, but back when, like, you know, America was tearing down all the Confederate monuments and things like this in England, they were. They were doing something similar, and one of the things that they were talking about was, you know, there's this statue of Constantine in York, which I think is actually my cover photo on Facebook right now."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1157.53,"end":1158.33,"speaker":"Jonathan Pageau","text":"Yeah, I saw it."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1158.49,"end":1178.06,"speaker":"Richard Rohlin","text":"Yeah. Yeah. But they were. So they were talking about, like, taking it down. I don't know if they did or not. I hope they didn't. But. So even as they're, like, trying to get rid of Constantine, they're saying, hey, but maybe Nero wasn't such a bad guy. I mean, like, if you think about what's going on right now. Yeah, it's very much. It's. It's exactly the pattern of Antichrist. Right. Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1178.06,"end":1212.22,"speaker":"Jonathan Pageau","text":"And there's. But it's. The pattern of Nero is really powerful, like, in terms of. If you want to look at. If you want to understand what's happening now, because one of the things people struggle to understand is how what we notice around us right now is a weird A weird mix of ultimate decadence and tyranny on the horizon. And people think, well, how? Like, how is that possible? How can you have both extreme degeneracy and tyranny at the same time? But if you want to understand that, look at Nero and you can see how that plays itself out."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1212.46,"end":1213.66,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1214.7,"end":1217.18,"speaker":"Jonathan Pageau","text":"And how Nero imposes degeneracy on others."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1217.82,"end":1219.86,"speaker":"Richard Rohlin","text":"Nero's, you know, like, his desire to."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1219.86,"end":1235.19,"speaker":"Jonathan Pageau","text":"Do that is because a lot of people think, like, well, just let people be degenerate. Like, does it. It doesn't matter. But that's not how it plays out. It ends up coming into a point of tyranny where Nero was imposing his. All his darkness on the people around him and the people submitted to him."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1235.59,"end":1262.03,"speaker":"Richard Rohlin","text":"I see you're an artist. I was just thinking about. About this the other day. Like, what is the significance of the fact that Nero thought of himself as an artist? Like, that's what he saw himself as doing. I mean, if we, you know, the story about his death is that his last words were something like, how great an artist the world is losing. You know, something like that. Right. So what's this. I mean, what is it you mean."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1262.03,"end":1296.97,"speaker":"Jonathan Pageau","text":"In the world where, okay, 20 years ago, the idea. The things that we're seeing the US President do would have been completely unimaginable. When Bill Clinton went on the Arsenio hall show and played his saxophone, the world went crazy. This was like the massive scandal, like, how can the president be involved in this entertainment world? And now it is taken completely for granted. Donald Trump was a wrestling villain, like Donald Trump was. Donald Trump has so much of Nero, like, not all the aspects of Nero, but he has certain aspects of Nero in him, like the show."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1297.13,"end":1301.05,"speaker":"Richard Rohlin","text":"Even some people who are afraid he's going to come back. Exactly."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1301.05,"end":1304.81,"speaker":"Jonathan Pageau","text":"Or want him to come back, because some people in the time of Nero wanted him to come back too."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1304.99,"end":1305.67,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1305.67,"end":1326.83,"speaker":"Jonathan Pageau","text":"So he. I don't think. I don't think Donald Trump is like, it's totally Nero, but I think that there are elements of Nero popping up. Like the idea of the entertainment president, the idea of the president as a spectacle. You know, all of this is becoming almost taken for granted. We think this is completely abnormal, but it's completely taken for granted."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1327.07,"end":1331.83,"speaker":"Richard Rohlin","text":"Yeah, yeah. So the beast of the world, Barack."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1331.83,"end":1333.3,"speaker":"Jonathan Pageau","text":"Obama, went to work for Netflix."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1333.69,"end":1334.33,"speaker":"Richard Rohlin","text":"Yeah. Right."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1334.97,"end":1346.81,"speaker":"Jonathan Pageau","text":"Like, this is something which in any. I mean, it was started even with Ronald Reagan, like, the idea that. That an actor could become president. You know, tell the. The Founding Fathers that they would have just laughed in your face."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1347.45,"end":1524.82,"speaker":"Richard Rohlin","text":"I mean, tell, tell anyone. I mean, like, even, even pagan Rome despised actors. Like, actors were the lowest, they're the, they're the lowest level of society. Like they're under prostitutes as far as respectability goes in the ancient world. And so when, when you have somebody, like, it wasn't just, it was just, wasn't just Nero, like there was some decadence leading up to, up to near. So for instance, during the reign of Tiberius Caesar, according to. I think it's Tacitus, one of the historians, I'm pretty sure it's Tacitus, he talks about the riots and the street fights that broke out in Rome during the reign of Tiberius over these rival troops of dancers. Because there was like one troop of dancers that some of the aristocracy backed and there was one troop of dancers that the Emperor really liked. And people are having fights like riots in the street over these different things. And Tacitus saw this, I think rightly, as a sign of, as a sign of the decadence and the sort of the impending, you know, problems in Roman society. Because you had people, actors and dancers, and those are sort of the same thing in, you know, at this time in history who, who are supposed to be on the very bottom strata of society. And now suddenly they're driving policy and they're driving intrigue and they're driving politics. And basically, like, if you had an actor driving politics, you know, it's the same thing with like somebody like, what's his name, Joaquin Phoenix's character in Gladiator. Yeah, Commodus. Commodus who really did fight in the arena. That's a thing he historically did. In fact, one of the things that Commodus did. I just have to go on a little tiny Commodus rant here. I'm very sorry. One of the things that Commodus did is that he would get a bunch of crippled war veterans together and he would tie them all up, like 10 or 15 of them, tie them up in a big bundle in the middle of the arena. Of course they're crippled, they're hobbled, they can't walk. And then he would dress as Hercules in like the lion skin cape and everything, and take a club and beat them to death one by one in the arena for his own amusement and the amusement of the people around him. I mean, these are crippled war veterans who can't fight back. Right. And he would say, what he would say was that he was Hercules slaying the giants. Yeah, that was what he. Yeah, so I think you're Absolutely. Right. Like this idea of. Of like a celebrity, like an actor, a. An entertainer, an artist, then you know, suddenly becoming like, the highest thing, like the principality that's now driving things. Like, that's. That's definitely part of the pattern of Antichrist. And it's really. I don't know, it's really interesting to watch what's going on right now on both sides. Like, you know, in America right now, Republican or Democrat, like you, the same pattern is. Is going. Is happening. Yeah, yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1524.82,"end":1525.58,"speaker":"Jonathan Pageau","text":"It's a circus."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1525.9,"end":1529.38,"speaker":"Richard Rohlin","text":"So the beast in Revelation to kind of get us back on track a little bit."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1529.38,"end":1529.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1529.98,"end":1662.37,"speaker":"Richard Rohlin","text":"The beast in Revelation is Nero. Right. But he's also more than just Nero. Right. This is something we talked about in our previous video. Reality lays itself out in these fractal patterns. Right. So that, you know, these patterns that we have happening over and over and over again. And what the. The, you know, what's good. So what's going on in Revelation is. Is taking. Taking history and recent history that. The history that, you know, especially, like the recent pain of persecution and of, you know, wondering, okay, where is God? And all of this pain that's going on around me. Right. Which is a very frequently asked question, you know, and. And then taking. Taking history and looking at history really through the lens of the liturgy. And I. You're probably aware of this, but there are now quite a number of biblical scholars and also some people who have done a sort of more mystical read of actually looking at the structure of ancient Christian liturgy and then reading the Book of Revelation through that structure. And so that you actually see there's this moment where John eats the book, and that sort of corresponds to. So that sort of corresponds to the moment of communion in the liturgy. So the idea is that you get this one vision of history that's like before Communion, and then the whole thing is recapitulated again. But it's. It's through the eyes of, like, through. Through the sacramental lens. So you actually sort of get this view of history twice. And, you know, I'm not a. I'm not a Revelation scholar. I don't know how much there is or isn't to that. I think it's very interesting. But. But I think that on a certain, like, symbolic sense or in a sense of, you know, the patterns that we find in the Book of Revelation, I think there's. There's definitely something true about that. So it's basically. So what Revelation is doing then. It's taking. It's taking history, but it's Saying there's something more going on here than just history. Something more is going on here than just the things that happened yesterday. That the things that happened yesterday actually participate in this cosmic pattern, the end of which is that the new Jerusalem will descend, right? And so you can sort of take comfort in the final. In the final victory of Christ."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1662.61,"end":1712.71,"speaker":"Jonathan Pageau","text":"And so we have. So we have these two patterns. We have the pattern of Antichrist, which also appears as a kind of mock resurrection or as a resurrection. We see it in script, in the revelation itself, as the idea of the fatally wounded beast that returns to prove the power of the. Of the beast. And so you can see that almost like as a mock resurrection. We saw it in the story of Nero. We see it as this. The return of this. This evil figure, whether it be cert in the ancient. In those kind of ancient cosmologies, whether it be the unleashing of Gog and Magog at the end of the world. All of this is part of how, when you come to the end of things, that which has been rejected will reign again. It will show itself because it has been cast out to the edge of the world. And so when you get there, it's like, you know, you're traveling there."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1712.71,"end":1713.27,"speaker":"Richard Rohlin","text":"Waiting for you."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1713.27,"end":1784.3,"speaker":"Jonathan Pageau","text":"Exactly. It's like you're traveling. You're traveling towards the end. And you keep. You push these things back, you push other things back because they're not part of the world. Like, they're not. They're not conducive to the existence of the world. But then at some point, you reach the end where there's more of that which you rejected than that which. Where you came from. And so you end up in a circus and, you know, the freak show, all of this kind of stuff that. Exactly. And so the idea of this idea of the return of Antichrist or the appearance of this at the end of the world makes sense even in terms of any normal process of the development of any story or any cycle or any, you know, any. Anything that. That exists. And so then you. So you have this pattern of Antichrist, but then there is a bigger pattern, or there's something which. There's a mystery which. Which flips it back, you know, and like. Which defeats Antichrist or uses Antichrist against itself or swallows Antichrist, you know, there. It's hard to sometimes completely understand it, but it's as if when you reach the end, all these things, even the scandals, even the breakdown, all of this then suddenly gets brought together and it makes sense in the whole."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1784.7,"end":1836.4,"speaker":"Richard Rohlin","text":"So maybe, maybe A good example of this that we can get people to sort of like key into on a narrative level would be the Arthurian material, which is really important for English speaking people. Even though ironically, like most Arthurian material actually comes from France. But it's funny, like in, in the Middle Ages, they basically considered there, there were three kinds of stories or three cycles of stories that were worth telling and retelling. There was the matter of Britain, which is written mostly by French people. There's the matter. Matter of France, which is written mostly by Italians. And then there's. And then there's of course the matter of Rome, which is like the old Greco Roman. Yeah, the ancient, ancient stuff, the ancient mythology. Right. And basically. And people realized that there was a high degree of fiction involved in these things. Like they weren't naive, they just didn't really like. But that didn't bother them."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1836.56,"end":1840.2,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly. And the matter of Rome also included Alexander, which is."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":1840.2,"end":2010.65,"speaker":"Richard Rohlin","text":"Yeah, matter of Rome included Alexander. Yeah, yeah. So to talk a little bit, last time we talked about the idea that, that Britain is founded by Trojan exiles and that Constantine kind of comes out of this. And if you read Geoffrey of Monmouth, he has this idea that there's this const. There's this idea in the genealogies that he presents for Constantine and ultimately for Arthur where the proper line keeps getting lost and that it survives somewhere else. So it was like there was a. So the idea is you have like, here's the king, this guy's the rightful king of Britain, but then he dies and all of his kids get killed, except for the youngest son who was in France at the time. So he survives and he comes back. Right. So it's the idea of the principality that gets cut off and then resurfaces. And that happens over and over again until, until eventually Arthur kind of comes about. And so Arthur has multiple iterations of this pattern of the, like the messianic pattern in his, in his lineage already. And so this idea. So the idea is that this line of romance, of these. The idea of Roman British Trojans eventually produces, via this repeated pattern, it produces Uther Pendragon and of course his more famous son Arthur. And I just have to point out here that if somebody says, you know, starts talking, you know, a few, a few years ago, like maybe 100 years ago, there was this huge search for the historical King Arthur. And every, every few decades, like that becomes a thing again. I think the most recent time was like in the early 2000s, where that was like a really big focus in Academia. But if somebody, if somebody talks about the historical art, King Arthur being a survival of a Roman British general or something like that, they're not really contradicting the legendary material and they're not really saying anything very important about it. Right. Because the whole story of Arthur is the story of the seed falling to earth, being lost and then shooting up again in kind of this unexpected place. And of course in the case of Arthur, something you said in our previous video is that England is the edge of the world. Yeah, right. So, so, so we have the seed falling to earth, being lost and then shooting up again on the margin of the Western, of the margin of the Roman world. And of course, you know, this is the, this is the messianic pattern. Right. Again going back to the idea of the stump of Jesse, which is the springing up again of the long lost Davidic kingdom, once again on the margin of the Roman Empire. And then he becomes the Pantocrator. You know, the idea is that Christ becomes something beyond the Roman emperor himself, which nonetheless contains the idea of the Roman emperor, which is, by the way, one of the things that happens in some of the Arthurian stories. Arthur actually is sort of acknowledged as like the emperor. And that's in Mallory and some other places."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2010.65,"end":2013.57,"speaker":"Jonathan Pageau","text":"Yeah, there's some versions where they actually take Rome."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2013.89,"end":2014.93,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2015.49,"end":2016.37,"speaker":"Jonathan Pageau","text":"Which is amazing."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2018.21,"end":2426.18,"speaker":"Richard Rohlin","text":"If the story of Arthur contains Christ we shouldn't be surprised that it also contains Antichrist. Right. That there's something, and this actually begins with Arthur's birth, that there's something ambiguous and even kind of sinister sort of left handed about the parentage of Arthur himself. So in the very early legends, Uther Pendragon is actually himself a shapeshifter. So he changes shapes and uses those powers to beget an illegitimate child on Princess Igraine of Cornwall. And in the later, this is later amended that he did this with the help of Merlin, who we probably just need a whole video to talk about, maybe Merlin. And I know you've done some in the past, but he's a very interesting figure. So by the time of Malory's La Morte d' Arthur, the idea of illegitimacy is actually removed from the story. It's clarified that, okay, yes, Uther did rape Igraine, but when Arthur was conceived it was already after they'd been legitimately married. So like they have to sort of clarify that Arthur is actually a legitimate son and therefore it's okay for him to be king and all this stuff. But the problem here of illegitimacy that exists in the seed of the Arthurian story is never fully removed. It just gets transferred to these other characters in Arthur's immediate circle. So the story of Arthur that develops particularly in the Francophone world. And again, most of the stories that we remember as the Arthurian legends, like Lancelot, Guinevere, the Holy Grail, all that stuff come from French authors. Yeah, yeah. There are these really intricate patterns of, you could say sexual deviancy in these stories, Right. Which include things like incest, adultery, cuckolding. And I think that these stories are difficult. They're problematic. I hate that word problematic. I shouldn't. I shouldn't use that. But they're. They're difficult. They're difficult to sort of like, look at and respond to and, you know, to the point that when I was. When I was a kid, I wasn't actually allowed to read the Arthurian stuff. And it wasn't really because my parents had read it themselves, I don't think, but they just sort of knew that there was some adultery and some other stuff happening. And so I wasn't actually allowed. I mean, I read them anyway. I read Howard Pyle's the Boy's Own King Arthur, which actually doesn't have any of that in it. It's kind of sanitized and just really fell in love with the Arthurian stories as a kid. But I think that people who have been paying attention to your videos recently especially, and. And this is the. This is the Lil. Lil Nas X or. I don't even know how to say his name, but this. The. The Lil Nas X King Arthur connection that. That all of your viewers have been waiting for here. Okay. I think that if people go back and watch that video that you made on Lil NAS X and WandaVision talking about. Talking about the pattern of witchcraft, Right. And, you know, sexual deviancy and all and the way that all relates to each other, that you will actually be able to understand something really profound about the Arthurian story, and that is that, you know, in the most popular versions of the Arthurian legend, Arthur's relationship with his queen Guinevere is sterile. Right. And there's no biological cause given for this. In fact, it doesn't appear to be like a problem with Arthur. Right. He does actually sire a son due to a case of sort of accidental incest with his half sister Morgoz. And this character Morgoz is the queen of Orkney. She's really interesting because she's from an island in the middle of the sea, right. This Orkney is Basically a rock in the middle of the, you know, the North Sea. So she's from an island in the middle of the sea. You can think about the symbolic implications there and then. And she is. She's also the sister of Morgan le Fay, you know, who's this? And like her, she's associated. Particularly in the later literature, both Morgase and Morgan le Fay are associated with witchcraft to the point that eventually the two of them are combined into a single character. So in most modern retellings of the story, they combine these two characters because there's this sort of sense, there's this intuition that they're a little redundant. And Morgaz is herself. She's unfaithful to her own husband multiple times. And all four of her sons, including Mordred, who is Arthur's bastard child, they're portrayed in the Francophone Arthurian material. And this includes Gawain, right? Who is actually like a great dude in the British story. Like, he's the original King Arthur's best knight. And then he eventually gets replaced by Lancelot in the French versions of the Arthurian material. And when he does French, you know. Right, because he's. Because, yeah, yeah, because Lancelot is French. And. And. And so when he does, then suddenly all of these guys from the Orkneys, which, if you are French, that's the. The literal edge of the world, right? They become. They're. They're portrayed as being uncouth, dangerous, capable of both great loyalty but also great harm. Like, they're. They're deeply loyal until they think you've betrayed them, even if they're wrong. And then they stab you in the back. Yeah, they are, in other words, sort of, you could say, shifty characters like the sea. Right. And so. And so this doesn't. Like I said, this includes Gawain. And although even in the. In the British versions, and this is still in. In Mallory, Gawain. Gawain has powers that are cyclical. They. That they. He becomes stronger or weaker with the cycle of the movement of the sun across the sky. So, like human, he's strongest at noon and he's weakest at night. So there's something even. Even in his British origins, there's something like cyclical and kind of wave, like, about. About him. But the second reason for Arthur's lack of a legitimate heir is that he is cuckolded by. By Guinevere and Lancelot, right? So Guinevere carries on an also sterile affair with. With Lancelot, who has an illegitimate son of his own. Right. So again, the problem is not Lancelot. Lancelot can totally have kids. And Lancelot's illegitimate son is Galahad, who is like the only. Like the only really pure, righteous, virginal knight in the later Arthurian versions of the legend. And so what we can see there is kind of this perpetuation of that uther to Arthur fractal pattern of you have like a wicked father, or like, maybe not so much wicked, but just like a shifty father who begets this. This totally righteous son. Right."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2427.54,"end":2437.46,"speaker":"Jonathan Pageau","text":"That has to do, like, just to help people understand. Also we would. In order to understand this, we always have to remember that this is happening on the edge of the world."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2437.7,"end":2438.1,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2438.18,"end":2465.95,"speaker":"Jonathan Pageau","text":"Arthurian stories are about how it's almost like, how can there be resurrection? Or how can the seed be planted in unrighteousness and come up in righteousness? Like, how is that possible? Like, how does the world end and start again? And so all these irregular patterns that you see, all the sexual deviancy, all the incest, all of this has to do with the problem of dealing with this. And it feels like it was a."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2465.95,"end":2477.64,"speaker":"Richard Rohlin","text":"Way for these French authors to sort of take their own. Take what's going on in their own society and then place it on the edge so they can deal with it, I think, a little bit. Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2477.64,"end":2519.93,"speaker":"Jonathan Pageau","text":"But it's also. It's also. It's also trying to deal with the mystery, like the mystery of something of resurrection or the mystery of the. You know, this is one of the strangest and most difficult mysteries that you find in Scripture, which is the mystery of the levirate, the idea of how resurrection comes out of death. Death through a. A. Through a taboo act, you know. And so the incest of the lever, it is the. Is justified, but it. In any other situation, the lever, it is actually, you know, the idea of taking your brother's wife is completely a sin. Like, it's a sin. It's a taboo. It's a. It's a."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2519.93,"end":2520.37,"speaker":"Richard Rohlin","text":"It's a."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2520.37,"end":2538.49,"speaker":"Jonathan Pageau","text":"It's. It's unacceptable because it breaks it. It breaks the laws of causality. It breaks the laws of natural causality. It's like if you marry, if you have a child with your brother's wife, then that child, like, what is he to you? He's a confused identity because he has multiple sources."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2538.49,"end":2540.53,"speaker":"Richard Rohlin","text":"And is that your nephew or is that your son?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2540.61,"end":2577.28,"speaker":"Jonathan Pageau","text":"Exactly. And so that's the problem of incest, is that it actually breaks the world apart in confusion. So with the idea. So you can understand that that's kind of what's happening on the edge of the world, all this confusion, all this breakdown. But in that darkness, you know, you could almost say, like, despite that darkness, then a seed appears in that darkness that becomes the. The seed for the future world, you know. And so it's. It's very mysterious. It's a mysterious pattern and it's a dangerous. It's a dangerous pattern if you take it the wrong way. But it's, it's also. It's also very much a Christian pattern."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2577.73,"end":2806.12,"speaker":"Richard Rohlin","text":"So the thing that's really interesting to me about Mordred, right, so Arthur's illegitimate son, it's his nephew, but it's his son. And by the way, there's that pattern, that basic pattern of accidental incest followed by a character who is your nephew but then ends up killing you. That's actually also in Scandinavian legends. In fact, it's alluded to in Beowulf and it's alluded to in this very. So almost every time in medieval literature, when somebody, when the text makes. Makes a point of saying, and so and so was so and so's nephew and he succeeded him, that's a way of saying that some. Something happened there. Like, it's, it's, it's. It's like a, you know, it's like a nice way of saying, yeah, something happened here that shouldn't have happened. But. So in the sort of the final version of the Arthurian legend, Mordred, it's Mordred himself who raps on Lancelot and Guinevere. He's the one that reveals the adulterous affair of his aunt, who sort of been his mother, right? But of his aunt and King Arthur's best knight, which. What's interesting is. And TH. White in his. In his retelling of the story, he really suggests that Arthur probably knew this was going on the whole time. I mean, how sort of. How could you not know, right? But exposing the sin publicly in this way, like uncovering the nakedness, right, forces Arthur to. To confront it. And the resulting fallout destroys the. Destroys society, destroys the Round Table. So the sterility of Arthur's marriage and the way that it brings about the downfall of his kingdom, which is kind of the symbolic end, you could say, of the Trojan Roman British line. After that, it's the Saxons who come in, you know, AKA the English, right, they take over. But I think that this, this, this pattern is actually foreshadowed in the legend of Excalibur, right? The. The sword, you know, you know, Arthur's legendary sword. And so in the version that Mallory has, there are two different swords. There's the sword and the stone. But that's not that. When I break out. Yeah, that one actually breaks in battle. And so he's given Excalibur as a replacement by the lady of the Lake. And again, there's this idea. There's this feminine presence in the water, which is very. Which is related to, like, there are all these, like, sort of troublesome feminine characters in the Arthurian legend, and they're all tied to, like, bodies of water in some way. So. But in this case, it's a positive presence. Right? So the feminine presence in the water, and she gives Arthur the gift. But what most people don't remember is that in the main version of the story, in Mallory, it's not one gift, it's two gifts. There's the gift of the sword, and anybody injured with a sword will, like, the sword makes wounds that can't be healed. Okay. And that's what the sword does. But there's also a second gift. And the second gift is the scabbard. And in the legend, if you wear the scabbard, any injury that you're dealt will heal. Right? And so it's. So basically, there's this. This in the get. There's the capacity to both wound and to heal. And of course, in Mallory, the scabbard, which, of course, the word for scabbard in Latin is, I'll let people go look it up. But it's a sexual word. Like, where do you put a sword? Right. Early on in his career, Arthur is tricked out of the scabbard. The possession of the scabbard, which is the proper resting place for his sword by Morgan le Fay. So Morgan le Fay actually tricks him out of the scabbard, steals it and throws it into a lake. And so Arthur, for the rest of his life, he has the sword, but he doesn't have a proper resting place for the sword."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2806.28,"end":2807.72,"speaker":"Jonathan Pageau","text":"Hence the sterility of."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2807.72,"end":2866.15,"speaker":"Richard Rohlin","text":"Hence the sterility. Right. And so the idea is that if you think about the way that Morgos and Morgan Le Fay are often sort of conflated as the same character. And so Morgause is the character, or Morgan le Fay is the witch that steals Arthur's seed. Right? So Arthur has this bastard child and makes it impossible for him to bear a legitimate heir. And note that, by the way, we've now come full circle all the way back from the Greek princess that gave giant birth to the giant Albion. Right? This idea that you had, you had an improper union with a principality that results in the creation of this monstrous child. And so the resulting illegitimate heir of Mordred manifest here as Antichrist. And of course, the Arthurian legend ends with this apocalyptic battle, you know, Cam Laden, when where. Where Mordred and Arthur injure each other, Arthur kills his son, and then Arthur is himself mortally wounded."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2866.15,"end":2866.55,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":2866.55,"end":3037.68,"speaker":"Richard Rohlin","text":"And what maybe a lot of people don't know is that in the Middle English literate of Mort, Arthur, Mordred is wielding another one of Arthur's sword. And the sword that he's wielding is the sword Clarence, which is Arthur's sword of peace. It's not supposed to be used in war. It's only supposed to be used to knight people and for other ceremonies. But it's never supposed to be drawn at violence. And you can think about, in going back to the Apocalypse, the promise of peace that's associated with the beast, with the Antichrist, that this is what people believe he's going to bring. He's going to bring peace. So I think that Arthur's death, and it's notable that the most famous versions of his story are always called the death of Arthur. They never called that. There's no story called the Life of King Arthur. You know, there's the death of Arthur. And Arthur's death involves two movements that involve magical women in the sea. And the first is the return of the sword. So when Malory, Arthur instructs one of his knights to return Excalibur to the lady of the Lake. Of course, it takes three tries. The sword is beautiful. He doesn't want to throw it away, but he eventually cast it into the lake where the lady catches it and it returns to the place that it came from. And the second is the passage of Arthur himself. This is, to me, one of the most mysterious things in medieval literature is that Arthur is taken away to Avalon, to the island of Apples to be healed of his wound. And he's taken away by three magical queens, one of whom is Morgan le Fay. Like, what's going on there? Why has she switched sides? What is happening? And so in Malory, you know, to finish the story out, Guinevere and Lancelot end their lives the only with the only happy ending that you could have in a story like this, which is they both become monks, they both become monastics, and they end their lives. Lancelot as a hermit and Guinevere as the abbess of a monastery. They take monastic vows and they become holy. They repent, Right? And so in this way, you can sort of see the sterility of Arthur's reign is transformed into the holiness of consecrated celibacy. So there's this resurrection that actually kind of takes place there. And Arthur himself continues to participate in the same pattern which gives him birth. So he becomes the once and future king. Which is almost the very last lines of the death of Arthur le morte d' Arthur is, you know, here lies Arthur, the once and future king. So there's this idea that Arthur is going to return to Britain one day, you know, in the eschaton, right. He becomes the once and future king. He becomes the seed that falls to earth or goes over the sea, you know, to the margin. So he's going to spring up in that unlooked for place. And I think it's the fact that it's not just the Antichrist that's on the margin, but it's also the Messiah, the messianic figure that goes to the margin so that when you reach there, you hit the Antichrist first. But then Christ is also there. Right. He's filled all things with himself."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3038.18,"end":3207.46,"speaker":"Jonathan Pageau","text":"Yeah, that's the image of Christ moving from east to west that you find in scripture like that, you know, like lightning moving from east to west that, you know that it's. This is the hardest thing is to understand. So, for example, like you said, you know, why is Morgan le Fay there? Why is Morgan le Fay part of those that bring Arthur into this hidden place for him to return? And I think that this is. This is, of course, these are attempts to try to deal with this problem, like to deal with the problem of the end and to deal with the problem of how is it that. How is it that things can start again without re encompassing even, let's say, the dark elements of the story. It's difficult because this is like the final. This is the final image is the idea that somehow all of these things will participate in the eschaton in some transformed way. And it's hard to totally understand it. We can see it like we can have a little glimpse of it. I think in the Conversion of Rome is a place where we can have a glimpse of it. Where as Rome was, Antichrist was the Rome destroyed the temple, Rome persecuted Christians, the emperors did all of that. But then in a strange turn from Diocletian, who was also this persecuted, persecuting emperor, to Constantine, who kind of changed all kind of flipped the story, but also reuse the elements of the story, we have a sense that there's a puritan sense that we always kind of have in our mind, which is that Christ brings a kind of purity where all the things are going to be cast aside and there'll be something new. But that new has to be nonetheless made out of the gathering in of everything together. And so there's like a destruction and a recreation, but that return to potential and that bringing together of a new body has to be made out of that which was there before. And so what's the difference? This is a question that I have. Like, I'm not sure you can even answer that. What's the difference between the demon search, who gathers the fingernails of all the fallen to create a chariot on which to destroy the world? What's the difference between that and the resurrection of the dead? Like, there's a difference. Of course there's a difference. There has to be. But the fact that they look like each other, the fact that they look like each other makes it difficult, I think. Makes you understand why in Scripture there's a sense in which even Christians will be duped by Antichrist."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3207.86,"end":3208.26,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3208.26,"end":3210.86,"speaker":"Jonathan Pageau","text":"Because it's going to look like the resurrection."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3210.86,"end":3280.91,"speaker":"Richard Rohlin","text":"He says even if it were possible, he would deceive. Even if it were possible, the elect. Right. It's the idea that a lot of people. And of course, this is why, you know, St. John, in his, his, his letter to his spiritual children, he's warning his, his, his, you know, you know, you know, there, there are many antichrists will come into the world. That's what he tells, that's what he tells them. He's saying, listen, these Antichrist figures are going to pop up and people are going to say, oh, there's Christ. Oh, there's Christ. Oh, there's Christ. Right. And that every time somebody says that, you have to just be still because, like, what, I mean, when Christ, like, people will know, there won't be any ambiguity about it. Right. So this is, this is interesting to me because one is, I think that it's the difficulty in telling the difference between these two things that is why some Christians get hung up on the idea of universalism. Because, you know, there is this sense in which all the margins are accounted for. But there's also the sense in which, like, there will be some things that will be outside the walls of the city and sort of like perpetually, eternally, forever outside the walls of the city. Some things can't be integrated."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3281.07,"end":3306.59,"speaker":"Jonathan Pageau","text":"Yeah. One of the images of the new Jerusalem in Revelation, it says that, that all the glories of all the nations will be gathered into the new Jerusalem. It's like, that's a Beautiful way of understanding. It's like all that which is glorious, of all the stories will be gathered into that final image. But then there's also things that won't be gathered in. Like, you know, there are aspects which will."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3306.59,"end":3306.99,"speaker":"Richard Rohlin","text":"That."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3307.15,"end":3314.82,"speaker":"Jonathan Pageau","text":"That will. But it's hard to understand it because. Okay, so here's another image. It also says that there will be no ocean, Right?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3314.82,"end":3315.78,"speaker":"Richard Rohlin","text":"No. No more sea."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3315.86,"end":3316.82,"speaker":"Jonathan Pageau","text":"No more sea."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3316.82,"end":3317.22,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3317.22,"end":3318.66,"speaker":"Jonathan Pageau","text":"That means that there's no remainder."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3318.98,"end":3319.46,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3319.7,"end":3346,"speaker":"Jonathan Pageau","text":"So I don't totally understand it. I mean, obviously, obviously I can't understand it. But it's like this image of, on the one hand, this image of the new Jerusalem, because there are these images where it says, like, out that there are things that are outside, like with the dogs, and there's all these images of what is outside of the Jerusalem. But. But then, but then there's also this image that there's nothing remaining. These two contradictory images are difficult to. For me to reconcile. That's why revelation is so difficult to think about."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3346.32,"end":3372.21,"speaker":"Richard Rohlin","text":"Yeah, so. So this, this idea of, you know, the principality who's cut off and returns. Right. Obviously you have Arthur is, Is the example that most people who are listening this video are going to be really familiar with. Yeah. But I just want to point out that in the Middle Ages, this pattern manifests itself in places other than Britain. So, for instance, there are. There are stories about the idea that Charlemagne is going to come back. Really?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3372.21,"end":3373.61,"speaker":"Jonathan Pageau","text":"I didn't know. I had no idea."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3373.61,"end":3470.4,"speaker":"Richard Rohlin","text":"Yeah, there are stories, stories about the return of either Charlemagne or Frederick ii, the Holy Roman Emperor. Frederick ii, the idea that, you know, in the final showdown with the enemies of Christianity. Right. In other words, that basically the final showdown with Islamic, that Charlemagne or Frederick will return to lead the armies of Christians in kind of one final battle in Denmark. It's actually not a king. It's one of Charlemagne's Paladins, Ogier the Dane, or Holgerdansk, who is the. He's the one that's going to return. And there's a 16th century legend about him actually conquering all of the countries from Jerusalem at the center of the world, all the way to paradise in the East. So the idea is that he went all the way from the center to the margin and basically converted all of them to the Christian faith. And so then the idea is that he's going to. He's going to. He's sleeping now. He's slumbering. Right. And that he's going to come back and rescue Denmark, which is on the edge of the world. Right. He's going to come back and rescue Denmark, and it's in its hour of need, kind of at the end of time. In your video with Dr. Mario, you talked about the, you know, the marble emperor, right? This idea that Constantine Paleologus, that he, you know, who dies in battle with the Turks, you know. You know, not all of the last. Not all of the Byzantine emperors in the waning days of the empire were like, awesome people, let's just say."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3471.52,"end":3473.44,"speaker":"Jonathan Pageau","text":"But there's a reason why things waned."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3473.44,"end":3501.67,"speaker":"Richard Rohlin","text":"Yeah, there's a reason why things. Reason they were in decline at that point. Yeah. But the last guy, I mean, he goes out the way that you're supposed to go out, right. He, you know, at least from a. At least from a. The perspective of a Germanic philologist, right, you're supposed to. You're supposed to die facing the enemy. Right. But there's this legend, you know, that. That he. He didn't die. That he was basically, like, turned into marble by an angel and buried beneath the gate of Constantinople, and that one day he'll awaken and he'll return. You know."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3503.51,"end":3547.97,"speaker":"Jonathan Pageau","text":"There are these stories. There are crazy stories about the fall of Constantinople, about how all the priests and the people serving. That they were serving the liturgy during the attack, and that all the priests and the people actually kind of entered into the walls without finishing the liturgy, without reaching the. The point of communion, and that, you know, at the end they will come out and serve the last liturgy. And. But it's a. It's a. It's very romantic, but it also. It also is a testimony to the pattern of this resurgence of light, the resurgence of. Of the pattern itself, that how, as the pattern breaks down, there is in that breakdown, a promise that it's going to return inevitably, because it's what holds the world together."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3549.16,"end":3721.25,"speaker":"Richard Rohlin","text":"So in that legend, I think there's something particular about the very Byzantine insistence and the very Christian insistence that there is something liturgical to the pattern of the world. So you can think about this idea that we find. I think that this is in St. Nicholas Cavassilas, in his the Life in Christ. But I could be wrong, but there's this idea that we find in the Fathers that communion is the eschaton. Right. That in some sense. And like, this is why. And I know that you've recently had a conversation with Eugene Vadolaskin, which I'm really excited to see, but in his book In Loris, which I think is a really important book for where we are right now, you know, one of the Things that. One of the main themes in Loris is that a lot of people are anticipating the end of the world because they're approaching the end of the sixth millennium since the creation of the world according to. According to the Byzantine reckoning. And so a lot of people are anticipating the end of the world. But there's this one point where one of the priests in the book basically says, listen, you don't know when the world is going to end, but you have a pretty good idea of when you're going to die, so prepare for that. Right. I know as a matter of fixed certainty that sometime in the next 50 or 60 years, I'm going to die. Like, you know, that's. That's a. You know, you could bank on it, you know. And so. But. But there's. There's this. There's this sense that, you know, that's kind of related to that, that, you know, when you take Communion, you know, even if you're, you know, in some. Some cities, you know, some cultures in the Middle Ages, you know, a lot of people only. Only commute at Easter and Christmas or only at Easter, you know. But. But this. This idea that communion is the. Well, this is in Saint Maximus. There we go. This. In his ecclesiastical. Ecclesiastical. Mystical. Mystagogy. Mystagogy, he. He talks about this idea, you know, that the. That every part of the liturgy corresponds to a moment in history of salvation, and that the. For instance, the dismissal of the catechumens is the Last Judgment, right? And that. So what's beyond that, which is the Eucharist, it's the Liturgy of the faithful, you know, is the. That's the eschaton. That's the. That's the. The life of. Of God, the life of the Trinity, the life of the age to come. So you've got to. You've got to prepare yourself for that. That, you know, don't worry about, like, when is Jesus coming back? You know, like, we know that Jesus is coming to my mouth like this Sunday. So get ready, you know, confess and prepare yourself. But the. So this idea then, that the liturgy is interrupted in the fall of Constantinople and that it's going to be finished one day. That's."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3721.25,"end":3723.57,"speaker":"Jonathan Pageau","text":"Yeah, it's the eschaton itself, like you said."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3723.57,"end":3750.99,"speaker":"Richard Rohlin","text":"Like, that is the. Like, that's. That's a very true pattern. Like, that's a. That. That idea would have made really deep, intuitive sense to people in the Middle Ages, you know. You know, even if it's, like, really fabulous or, like, difficult to get your. You Know, like, no one's treating it, like, as a historical, you know, fact or something like that. But it's, but it's. But there is a sense in which the liturgy was interrupted. But it's. But it, but it is going to finish, you know, like, it. It will."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3751.95,"end":3759.39,"speaker":"Jonathan Pageau","text":"So maybe tell us about. I could, I think, tell us about the last emperor, the Virgin, that's found in the Apocalypse of Pseudo Methodius."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3759.47,"end":3968.83,"speaker":"Richard Rohlin","text":"That's what I was getting to. And I think that we could get to the end of this and then just sort of tease Ethiopia and then maybe come back and talk about Ethiopia in another video. Yeah. So this is in. Again, this is the Apocalypse of Pseudo Methodius. So there's this idea that, that we have in the, in the Apocalypse of the Pseudo of Pseudo Methodius, the two ideas that are really important. One is the coming of the Antichrist, Right? And of course, the Apocalypse of Pseudo Methodius is really dealing with the rise of Islam. And why is, you know, Jesus has already come and the empire converted, so why are we losing, like, what's going on? You know? But what's really interesting is that these. The actual Antichrist himself does not come from Islam in the Apocalypse of Pseudo Methodius, that he follows the Church fathers in saying that the Antichrist is going to come from the tribe of Dan, that he's going to. Basically, he's going to be one of these, in other words, from one of these Israelite tribes that was wiped out, that vanished, but is going to again resurface at the end. Right? And so he talks about the Antichrist and he says, this man is born at Chorazin and will be raised at Betha and will rule at Capernaum. And Chorazin will be glad because he was born in her, and Bethsaida because he was raised in her, and Capernaum because he will have ruled in her. So he's quoting Old Testament prophecies. And then he says, for this reason, in the Gospel, the Lord three times passed a sentence of woe, saying, woe unto thee, Chorazin, Woe unto thee, Betseda, and unto thee, Capernaum. If thou hast been exalted unto heaven, thou shall be brought down to hell. So these are the places where Christ did, like most of his earthly ministry. And those are the places where the Antichrist is going to manifest in the last days. So that's one pattern, this pattern of Antichrist. The other pattern that we see coming up here at the end of the Apocalypse of Pseudoma Thorius is the idea of the Last king of the Romans. That's how he's referred to in this. The Latin version of the text is called the Rex Romanorum, so the king of the Romans. So in other words, the last Roman emperor. And there's this idea that the last Roman emperor survives sort of hidden, that the line of the emperors sort of survives hidden within the nation of Ethiopia, and that in the last days, the last Roman emperor manifests himself and he rules over sort of like one last moment of Christian revival, of Christian conquest over their enemies, of Roman conquest over their enemies. Because there's the same thing by this time, before the Antichrist comes. And that when the Antichrist comes, this is what it says. It says the king, in other words, the last Roman emperor will take the crown from his head. So he'll take the crown off of his head and he will place it on the cross, and then he will spread out his hands to the heaven and deliver the kingdom of the Christians to God. And then the cross will be taken up into heaven along with the king's crown. So this is a prophecy, and this is a long time. This is written several centuries before the fall of the Roman emperor Empire. Right. That it prophesies that there's a day coming when the king's crown. So the Roman Empire will still sort of exist, but only Christ will be. Will only have Christ as an emperor, because the earthly empire will have been brought to an end."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3970.99,"end":3979.67,"speaker":"Jonathan Pageau","text":"Yeah. And it's almost like it's the end, but it's the resolution within that end. It's becoming fully what it was supposed to be in its end."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":3979.67,"end":4015.1,"speaker":"Richard Rohlin","text":"At the same time, an interesting manifestation of this is when in the Orthodox Church, we put our bishops partially in the garb of the Byzantine emperors, the Sakos, the main vestment of the bishop. It's not originally an episcopal vestment, it's an imperial vestment. Even Charlemagne, when he was coronated, he sent off to Byzantium to get one because he wanted to associate himself. So he was. When Charlemagne was crowned, he was coronated in the garb of a Byzantine emperor."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4015.1,"end":4015.62,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4015.86,"end":4016.9,"speaker":"Richard Rohlin","text":"Yeah. Very deliberate."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4016.98,"end":4028.5,"speaker":"Jonathan Pageau","text":"Yeah. Well, I know that he really wanted to see himself as the continuation of the Byzantine Empire, you know, in his succession, he's this. He's like the. He's the. He succeeds Irene's dead husband, basically."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4028.5,"end":4097.48,"speaker":"Richard Rohlin","text":"Right. So when we, when we put our, our bishops in this garb, one of the things that we're sort of saying by that is that the. The kingdom continues, but now it's totally vested in Christ. Right. And of Course, the bishop is just like the icon, the living icon, you know, of Christ within the community of Christians. So it says that, it says that when this happens that the, the cross will be taken up into heaven along with the king's crown, because the cross on which our Lord Jesus Christ was hanged for the sake of the common salvation of all, the cross itself will commence to appear before him at his coming as a refutation of the treachery of unbelievers. And the prophecy of David will be fulfilled which says, in the last days Ethiopia shall stretch out her hands unto God, because from the seed of the sons of Joseph, the daughter of full, the king of Ethiopia, these last will stretch out their hands to God. So again, there's this idea that the last Roman emperor somehow survive or endured in Ethiopia manifested in the last days and then the kingdom, and then hands the kingdom over to Christ."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4097.96,"end":4107.56,"speaker":"Jonathan Pageau","text":"Yeah, and it makes sense in terms of the role of Ethiopia. We'll talk about another, in another episode of what let's say the cosmic role of Ethiopia seems to be in this, this universal story for sure."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4107.56,"end":4219.53,"speaker":"Richard Rohlin","text":"And so, and so, you know, and then from that point the story goes kind of the place that you would expect it to go, which is the Antichrist rules over mankind in the absence of the, of the true Roman Emperor. Things get really bad. The faithful are persecuted and then Christ returns and the righteous shine forever as stars in the world, which is how it ends. So it's a really beautiful, you could sort of say extension of revelation, like there's nothing in the. Which by the way, one of the things that you get a kick out of is that early on in the Apocalypse we get the, the origin of dog headed men like which, which son of nowhere they're descended from. So just, just tease that out there for people who want to go looking for it. Yeah, exactly. But there's, we can guess. Yeah. But I really love the apocalypse of Pseudo Methodius because it, it really functions as an extension of revelation. Like there's nothing in it that doesn't, that's not, that's incompatible like that the two sort of map onto each other really, really well. And what the Apocalypse is doing is it's trying to. Pseudo Methodius is doing is it's trying to clarify what's the role of Rome. It's trying to clarify when the Roman Empire falls. And this is, you know, hundreds of years before it falls, you know, but when the Roman Empire falls, is Christianity invalidated? Does it cease to exist? And the answer is no, that basically this pattern that we see first see in the apocalypse of St. John and that we see foreshadowed in Alexander, in Constantine, in Nero, like all these patterns that they continue to work themselves out in a way that is consistent with the, the ultimate victory of Jesus Christ. Right. The becoming, the sign of the coming of the Son of Man as the, as, as the text says. Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4219.69,"end":4277.54,"speaker":"Jonathan Pageau","text":"And there's also a sense in which Rome persists, you know, even today. People think that's a funny idea. But you know, the ideal of Rome is still continued on. You know, whether it is in the two headed eagle that, that ended up in the Austro Hungarian Empire or the same two headed eagle that ended up in the Russian, the Russian Empire, they saw themselves as a continuation of Rome. Whether historians like that or not, or whether they think it's legitimate or not, it means that the Rome had not yet passed and in a way Rome hasn't yet passed it. We're on the, I would say we're very close to the end of Rome in a, in a, in a bigger scale because it's like the idea of Rome is kind of, has this weird last glimmer in a, in the unified Europe, but it's a kind of strange, perverted, you know, fragmented version of it. But it, the idea of Rome is still, it's still there and it's still, it's not completely dead."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4277.62,"end":4279.22,"speaker":"Richard Rohlin","text":"So can I throw one last idea at you?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4279.22,"end":4282.62,"speaker":"Jonathan Pageau","text":"Go for it and then we'll, we'll, then we'll have another conversation."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4282.7,"end":4303.82,"speaker":"Richard Rohlin","text":"Yeah. So Tsar Nicholas the second, the last Russian Caesar. Right. There's a, there's a, like it's, it's to the point where it's, you know, maybe sort of a meme of like these, these young guys who convert to Orthodoxy and then just develop the biggest possible man crush on Tsar Nicholas ii. Like I don't know if you've noticed this."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4303.82,"end":4306.5,"speaker":"Jonathan Pageau","text":"Oh yeah, well, you see it in facial hair."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4306.5,"end":4306.86,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4306.86,"end":4312.77,"speaker":"Jonathan Pageau","text":"You don't even have to ask them because they start to sport the hair. The same facial hair star Nicholas."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4312.85,"end":4361.16,"speaker":"Richard Rohlin","text":"Yeah. So, so what's really interesting to me here is that I think that this is really, this is that same pattern manifesting itself, that the, the seed is cut off. Right. And then it springs up again in what's the most unlikely place in the world for a, for the veneration of a Russian emperor to, to spring up? I would say West Virginia, you know, like, you know, I would say Texas. Like, like, you know, there's, you know, in America we have multiple layers of, you know, we don't like kings, you know, but also, like, we don't like Russians. And so, you know, for the veneration of, like, the last Russian emperor to spring up in such a surprisingly strong way, you know, the devotion, you know, to the royal family."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4362.12,"end":4374.16,"speaker":"Jonathan Pageau","text":"But it's also because everybody knows that there's a relationship between Britain and. And Russia, right. In terms of that final emperor, like, that the connection is so strong that one of them became a saint."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4374.4,"end":4380.48,"speaker":"Richard Rohlin","text":"It's like, so that's one of our family saints. My daughter is named after Saint Elizabeth."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4380.48,"end":4402.9,"speaker":"Jonathan Pageau","text":"And so it's not as far. Again, just like the idea of Troy and Arthur and Constantine and Arthur, you know, in these surprising joining together, the connection between the extreme east and the extreme west or the, you know, these two extremes of the world in the. In the character of Tsar Nicholas is something which I think is playing a narrative function as well."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4403.22,"end":4409.94,"speaker":"Richard Rohlin","text":"And that's. I mean, so in our last episode, you famously said that America is the whore of Babylon. So. But we're also."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4409.94,"end":4410.94,"speaker":"Jonathan Pageau","text":"And I stand by that."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4410.94,"end":4416.98,"speaker":"Richard Rohlin","text":"I know, I know. It's fine. We are also, though. We're also the end of the world."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4417.06,"end":4418.18,"speaker":"Jonathan Pageau","text":"Yes, I agree."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4419.14,"end":4473.36,"speaker":"Richard Rohlin","text":"In fact, one of the things that's. I'm going to try to have a conversation, I think, with Paul vanderkly about why did the medieval model. Why did we lose it? What happened? Why did that transition happen? And one of the things that people don't always understand is that one of the things that brings about the end of the medieval model is the discovery of the New World. That there is such an influx of resources, gold and other things from the New World. We can't even understand how much it just destroyed the traditional trade networks and economy, economic things that were kind of holding Western Europe together. But. But basically, you know, America is the. Is the sort of. It is the end. It's the. It's the. In one sense, like, it's the ultimate margin. Yeah, right. Especially. Especially California. California, yeah, that's exactly what I was getting to. California. Seattle. Right. That these are. It's as far west as you can go. Like, that's the end."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4473.68,"end":4474.2,"speaker":"Jonathan Pageau","text":"Yeah, it is."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4474.2,"end":4477.03,"speaker":"Richard Rohlin","text":"You can't go. You can't go west any farther after that. It's east."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4477.42,"end":4478.02,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4478.02,"end":4478.26,"speaker":"Richard Rohlin","text":"And."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4478.26,"end":4506.1,"speaker":"Jonathan Pageau","text":"But there's something also interesting, like, if you look at California, it's an interesting. It's interesting how you can see some of the seeds. How can I say this? Like, it's. California also has a microcosmic form, like structure, and it has aspects of it which is actually the most, like, traditional, most spiritually alive place, and also the worst degeneracy that you can ever imagine in the same spot."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4506.81,"end":4508.05,"speaker":"Richard Rohlin","text":"Where was Father Sarah from? Rome."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4508.05,"end":4508.49,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4508.49,"end":4528.17,"speaker":"Richard Rohlin","text":"He's in California. He's like, as, you know, like a sort of like hardcore traditionalist, as you could sort of possibly imagine. Right. And, yeah, because it's the same thing. It's. You get to the edge, you get to the end of the world, and all that's left is the remainder, you know, so."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4529.05,"end":4533.53,"speaker":"Jonathan Pageau","text":"So King Arthur will land, you know, on the west coast somewhere in California."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4534.25,"end":4578.86,"speaker":"Richard Rohlin","text":"I wouldn't be, like, totally surprised if that happened, honest. But anyway, I think that Tsar Nicholas is. I think that he is manifesting. He's manifesting this pattern, and that's why I don't really mind. I'm happy to see a lot of these guys, they know intuitively in their hearts they need a king. And of course, then ultimately, that's Christ. But then to also have this deep love for kind of the last emperor, who is. Who is manifesting again, you know, as a saint. He's manifesting again in the most unlikely of places, I think is. I think that's another way that we see this pattern kind of playing out in the Orthodox Church right now. And I do think it's actually ultimately a beautiful thing."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4578.86,"end":4587.18,"speaker":"Jonathan Pageau","text":"Yeah, I think so, too. All right, well, look, we. I think this might have been the longest conversation that I've had probably on my channel."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4587.34,"end":4588.14,"speaker":"Richard Rohlin","text":"How long was it?"}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4588.22,"end":4591.48,"speaker":"Jonathan Pageau","text":"I don't know, like an hour and a half maybe, which is totally cool."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4591.64,"end":4593.72,"speaker":"Richard Rohlin","text":"I didn't even. I didn't even notice that it was."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4593.72,"end":4608.36,"speaker":"Jonathan Pageau","text":"It was great. And so next. Next. Next conversation, we will definitely go into all the mysteries of Ethiopia, and I'm looking forward to that, definitely. So thanks, everybody, for your time and your energy. And Richard, go ahead and plug again all the things you're involved in, because."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4608.36,"end":4681.27,"speaker":"Richard Rohlin","text":"That'S the big thing is, of course, I'm on the Amity podcast, if you want to hear me talk Tolkien. I'm actually pretty excited about this next episode of that'll be coming out on the 10th of June, because I had Dr. Lisa Kudras back on to talk about Marian figures in Tolkien's legendarium. And this is the. The, like, I'm always nervous about talking about the Mother of God because I feel like she's the sort of, like, you just can't talk about her. You have to. You have to venerate an icon. I don't know what else to say. And yet I keep finding myself places where I'm. Where. Where I am talking about her. So this is like the most Marian thing that I've ever done on the Internet and I'm pretty excited about this episode. We are also still working on getting a website up for a book that I want to publish. And hopefully you'll be contributing to it and some other people will be contributing to contributing to it. It's called Finding the Golden Key Essays on a Toward a Recovery of the Sacramental Imagination. And it's kind of. I'm hoping it's going to be sort of a nexus for this project of re enchantment that we've all kind of been involved in. So look for that. I'm hoping the website will go up in the next week or two and people will be able to actually submit abstracts for essays to be included in the volume."}
{"episode_id":"SW - #169 - 2021-08-06 - Richard Rohlin - The Apocalypse and the Return of the King","start":4682.07,"end":4756.96,"speaker":"Jonathan Pageau","text":"All right, everybody, so stay tuned and we'll definitely be back with some other surprising and wonderful wondrous stories. So thanks everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
