{"episode_id":"SW - #003 - 2018-05-28 - Encountering God in Stories","start":1.12,"end":59.75,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'm playing for you a talk that I gave at the Climacus conference in Kentucky in 2017. And in this talk, which is the first part of a two part discussion, in this talk entitled Encountering God in Stories, I look at the patterns of storytelling and how they underlie and are the basic structure of our engagement in our understanding of reality. I show how these stories culminate into the great mythical stories, but ultimately how all these mythical stories find their synthesis in the story of Christ. This is Jonathan Peugeot. Welcome to, to the Symbolic World."}
{"episode_id":"SW - #003 - 2018-05-28 - Encountering God in Stories","start":69.67,"end":2483.68,"speaker":"Jonathan Pageau","text":"I'm actually not going to talk about icons today. I always talk about icons and I always write about icons and I'm not going to talk about carving. I'm going to talk about stories. The talk that I was supposed, that I was supposed to give was called Encountering God in Story and Image. But as I was preparing the two talks, the one I'll give today and tomorrow, I decided to put them together. They're kind of fused together. And so images will come tomorrow in my talk. And today I'm going to bring in some of St. Gregory of NYSE's ideas into the talk I'm going to give today. So I'm going to start with a statement. I'm going to start with a statement that is the world is made of stories. I mean, of course, the world is made of things as well, but mostly I would say most significantly, the world is held together by stories. You know, as Orthodox Christians, we say, we believe that we can encounter God anywhere and in everything. That in the language of St. Gregory of Palamas, the uncreated divine energies are hiding behind phenomena. We believe in the wonderful frame given to us by St. John the Theologian and expanded by St. Maximus, that the logos of things, everything in the world that's created has a hidden purpose, has a hidden Logos, and all things are connected and they're united by their Logos to each other and ultimately to the divine Logos in love. When we hear such phrases, I mean, the first times I started to hear this type of language, I have to admit that it was easy for it to sound like kind of esoteric mumbo jumbo, you know, has that strange sound. Here's my, here's my first thought, and I can understand that, you know, and sometimes it looks like something so obscure that we, you know, we have to just make that leap of faith to believe it, but really get rid of that really. Beyond the technical wording, this way of seeing the world is simply how the world presents itself to us. In fact, these truths about Logos, about divine energies, are so close to us that they permeate all our experiences. And it does begin with faith. And not just faith as this mental belief in something, but I would say faith as a commitment to the invisible. And this faith will help us experience how the invisible not only transcends the visible, but it also is the thing that holds the visible world together. So how in the world can the invisible hold the visible together? It can actually be quite simple. And stories are one of the most immediate examples in our daily experience of how the invisible holds the visible together. A story is a series of facts, facts chosen among an indefinite amount of possible facts. These facts are characters, they're places, they're objects that all interact in a string of events threaded together in a pattern of meaning. And the pattern of a story is the invisible part of a story. See, a pattern can't be found in the individual elements of a story or even the accumulated elements of a story. But it appears as the reason why those things are brought together. And the pattern isn't arbitrary. It imposes itself on us to our intuition by how much it is meaningful to us. We know something is a story because it awakens our humanity, because it captures our attention. So, like, imagine. Imagine a series of events. Okay, let's say this happened this morning. So this morning I got up, I put on one sock, and then I scratched my nose. I breathed three times and my heart beat about 20 times. Then I put on the other sock. I coughed a little, I blinked a few times. I glanced at the belt on the chair. I breathed another two times. And who's bored? I mean, although there's clearly a character in what I just said, and there are events in the description, but that's not a story. I mean, it's boring. If I kept going like that, I'd have people walking out of the room. So for your consideration, let me give you another series of event events. So last Sunday morning I got up and we were late for church. So I getting ready, I go to put on my socks. But looking into the drawer, I realized that all of them were in the wash. So here I am, starting to panic. I'm running around the house trying to find a clean pair of socks. And after another five minutes, I'm at the point of giving up. All hope is lost. And I'm thinking, okay, I'm going to have to dive into the hamper and gonna spend the day in dirty socks. Or else I start to wonder, would it be considered Cross dressing if I borrowed my wife's socks. And so as I'm shamefully sifting through my wife's socks, you know, looking over my shoulder, hoping she won't see me and wondering, like, am I gonna have to confess this? And if I'm gonna confess this, is it because, you know, I'm cross dressing, Is it because I'm taking some. Anyways, so as I'm sifting through my wife's socks, what do I come upon? A pair of my own socks that were right there, you know, put there by some mischievous elf, some minor miracle, you know, that's more of a story. I mean, of course, we could say that it's a trivial story, it's a very localized story that could only be understood by modern people. And that's true. But the pattern of the story, the invisible structure which makes one see that it is actually a story and not just a random accumulation of facts, well, that pattern is something that is truly universal. It's something which is written in human consciousness. I would say that it's actually a mode of human consciousness. Now, in the little story of Socks I just told you, one sees the loss of something important. Socks. In this case, because I come from Quebec and in the winter you don't go without socks. It's not going to happen. But more far reaching stories will have more significant terms. So what's lost could be the Holy Grail, or what's lost could be Sauron's ring, or it could be the paradise of Adam and Eve. And then comes the panic. All hope is lost. But it's in the very descent into chaos and inversion that the thing is finally found by some surprise. So for the Grail, it's found in the castle of the wounded fisher king. For the Ring in the dark cave of the riddling monster Golem. And the lost paradise is recaptured on the cross, where death and derision are transformed into glory. But in my benign missing saw case, the solution came as I'm sifting through my wife's sock drawer, which is not chaotic at all, by the way, because she'll be listening to this. So, yeah, all right. Of course, there's some stories that don't follow these patterns very well. And those stories, they just kind of fall to the wayside and they're forgotten. I mean, all of those How My Day Went stories or the novels that you find in the discount bin, or those TV shows that get canceled after one season, but those stories that embody universal patterns in terms that have wider importance. Well, those stories last they enter our consciousness and they support our identities, and they become this underlying web of references with which we encounter the world. And that's really important because we all have this underlying web of references with which we function. And that's part of what the Bible does. That's one of the points of all these stories. We, the creation, the flood, the life of Abraham, his descendants, the kings, the prophets, all of that is a giant pattern. And it's part of this cosmic web of Logos that holds the universe together and prevents it from fragmenting into isolated particular events. This fragmentation is a process which leads to killing and even the reduction of these particularities into statistical possibility. I mean, just look at where particle physics have brought us as they cut up the world into smaller and smaller, discrete points. We need to guard our stories because the chaos that's described in Genesis when it says, in the beginning, God created heaven and earth, and the earth was empty and void, that primordial chaos which precedes the light and sound of Logos, that still lingers. It hasn't gone anywhere. It still lingers at this bottomless ambiguity under and around the ordered world, under the pattern that stories give us. This chaos is held at bay by the edifice that Logos establishes to hold creation together. So, like I said at the beginning, I'm going to be speaking of St. Gregory of NYSE tomorrow as we explore his amazing book, the Life of Moses. But I want to bring him already into the conversation today because he gives us the key to some of the questions, some of these things that I've been bringing up about patterns. So in his book, St. Gregory, at some point, it's the culminating point of his book, he describes the ascent of Moses unto the Sinai to receive the law given to him by God and also to receive the pattern of the tabernacle. So first, Gregory says Moses leaves behind the base of the mountain and is separated from all those too weak for the ascent. Then, as he rises higher in his ascent, he hears the sound of trumpets. Thereupon he slips into the inner sanctuary of divine knowledge. And he does not remain there, but he passes on to the tabernacle not made with hands. For truly, this is the limit that reaches that someone reaches who is elevated through such a sense. So God shows Moses a pattern of the tabernacle, which he's going to have built as the center of Israelite worship. And in his interpretation of this event, St. Gregory does some amazing things. He speaks in somewhat hushed tones of that spiritual pattern that was encountered by Moses as an archetype. So that he might reproduce in a handmade structure that marvel not made with hands, unquote. And St. Gregory almost hesitates, and you can feel it in the text. But then he goes on. We say that Moses was instructed by a type in the mystery of the tabernacle which encompasses the universe. That tabernacle would be Christ, who is the power and the wisdom of God, who in his own nature was not made with hands, yet capable of being made when it became necessary for this tabernacle to be erected among us. Thus, the same tabernacle is in a way both unfashioned and fashioned, uncreated in pre existence, but created in having received this material composition and worried that we might be offended to see see God himself compared to the tabernacle, St. Gregory tells us to not be afraid, quote. For the power which encompasses the universe in which lives the fullness of divinity, the common protector of all, who encompasses everything within himself, is rightly called Tabernacle, unquote. And so here we have this amazing description of a pattern encountered beyond the inner sanctuary of divine knowledge by Moses. It's an architectural pattern which is Christ and contains the universe within itself. Now think about that for a second. Moses is ascending a Mountain. But St. Gregory talks of an inner sanctuary of divine knowledge. That is, he's using this general notion of place, right? A sanctuary is a holy place. The inner sanctuary is the inner holy place, which is equivalent to the holy of holies of the tabernacle itself, the place where the high priest could enter and where the divine glory, the presence of God, descended on the Ark of the covenant. And so the top of this mountain that Moses is ascending is put in comparison. It's made analogical to the sanctuary. And we know later in our tradition that the human heart, the person's heart, will play the same analogical function as that holy of holies, where the human must enter to find illumination. So then, moving beyond the holy of holies, we encounter the invisible pattern of that very sanctuary which was surpassed. So St. Gregory then goes to describe the different aspects of the tabernacle, how the different aspects represent different aspects of Christ, but also Christ's church. And so what ends up happening to us as we look at this is we see these patterns within patterns. So the structure of Israel's tabernacle, which was going to be built and be the center of Israel's worship, is also the mountain which Moses ascended. It's also the person and the life of Christ, and then becomes the structure of the church itself, all its members. And at the Same time, it's an image of our own experience as we approach God, our own experience as we enter our own heart to find illumination. And so it's something like the vision of the prophet Daniel. I don't know if you know, this vision where he looked at the divine chariot which was carrying the presence of God, and he saw wheels within wheels within wheels. And so these patterns that lock together and create like a. Like a mesh that makes us understand what things are referring to. So, okay, what I've said might still sound a bit obscured to everybody. Okay. So hopefully I'm going to bring it more into a more applicable way. And to be honest, it is way. It is way far beyond my capacity to resume this universal pattern. I'm not Moses, and I'm not St. Gregory, and I have definitely not entered into the divine darkness. But I think like most people, like most of us here, I mean, we have these intimations, we have these moments, these glimpses of some of the smaller aspects or some of the smaller patterns which embed themselves to the larger one which constitutes this infinite tabernacle. So hopefully, what I can do with you today is maybe provoke some intimation or give a little glimpse. And I think the only fruitful way to do this in our context is to do it the way the Fathers did it, and it's the way St. Gregory did it. And it's to show how everything, how this whole pattern, how all the patterns of meanings point to Christ. And I think that that is the surest way for any of us to encounter God in stories. And so we come back to a familiar territory, because for Christians, you know, the traditional vision of the Old Testament is that all the stories point to Christ. Right? All the Old Testament stories contain prototypes of Christ. Saint Irenaeus tells us that if anyone therefore reads the Scriptures with attention, he will find in them an account of Christ. For Christ is the treasure which was hid in the field, the treasure hidden Scriptures is Christ, since he was pointed out by means of types and parables. And so from a theological and even an epistemological point of view, that makes total sense. All the instances of meaning extend from and point to the origin of meaning, the origin of everything, which is the divine Logos, that pattern not made with hands, who entered through his incarnation into the cosmic story, so to become not only the origin of the story, but its very center. And in practice, anybody who reads the narrative parts of the Old Testament simply as stories, you know, rather than attempting to decompose them into competing mini narratives of religious and political struggle, like a lot of the scholars want to do. I mean, if you pay attention to those stories, you can't help but notice that each story is like an extreme facet of something. You know, these stories in the Old Testament are like these sharp slivers that come together into a smooth whole and brought together in Christ. So as an example, I want to give you the story of. I'll give you one of the major stories I chose, one that I think everybody knows. It's the story of Cain and Abel. So I want to tell. I want to see how one of the ways that we can see this pattern appear in the story of Cain and Abel. So Cain is an agriculturalist, Cain grows his food. And Cain is also the founder of the first city in the Bible. He is the founder of the first city and his descendants. Actually, all the aspects of culture, all the aspects of sedentary culture come from the descendants of Cain in the genealogy of Genesis. And his brother Abel, on the other hand, he's a shepherd, so he's a nomad. So when they sacrifice, what does Cain offer? Cain offers to God the product of agriculture. So when they sacrifice, Cain offers the product of agriculture and Abel offers from his flock. But the two sacrifices are unequal, right? Cain's sacrifice is rejected by God, and Cain killed his brother out of resentment. So we all know that story very well. Now, if we look at that story, I mean, the first, if you look at that story, if you try to look at that story in light of Christ, the first thing that would tend to come out is that we would say, okay, well, Christ is of course, able, that the good shepherd, and Christ is the innocent who dies at the hands of the jealous establishment. Makes sense. That's what Christ's story is like. As we look a little bit deeper, we actually realize that Christ is also Cain. Because Christ is the sower and the reaper. And Christ is called the son of an artisan. He is the firstborn. You could say that he is truly his brother's keeper. So Christ unites and reconciles in his very person that first and primordial conflict of humanity. Then if we push that point even further, we realize that Christ takes the sacrifice of Cain, the product of the earth, like bread and wine, and he unites it to the sacrifice of Abel, flesh and blood, and he makes them one. So this takes us to the Eucharist. It takes us into communion. But if we start to ponder on communion, we know that it can't stop there. Because if it was just the story of Cain and Abel, that gave us the key to communion. I mean, it might be enough to blow our mind already, but it's more. It's always so much more. Christ's offering also takes the showbread, which in the tabernacle was offered in the hidden holy place, and he unites it with the animal sacrifice which was offered in the outer court. And communion is not just about sacrifice, right? It's the fruit of the tree of knowledge and the tree of life hanging from the ultimate tree, which is the cross. It is the hospitality of Abraham uniting us to the angels. The offering of Melchizedek, the strange dream Joseph interprets in prison. It contains bread, which is a staple food, with wine, which is a euphoric drink. It unites meat, which in the Old Testament was offered up to God and eaten by those sacrificing, and blood, which in the Old Testament was never consumed, but was placed on the frame of the door, sprinkled on the outside of the altar, the outside of the mercy seat, and poured out on the ground. Yet it is now part of the totality which the divine mysteries make available to us. And that last example, that blows my mind. And I could spend all day pointing at intimations of the divine mysteries based on Old Testament examples, and I would always find one more example of what the mystery contains and what it also transforms and transcends and strangely establishes at the same time. So just like in the example I just gave you of Cain and Abel, the stories in the Old Testament and other important stories, they never attained to Christ. That is, if you look at Christ and his own story, they always exceed those stories. But because of that fact, Christ also becomes that place where all the stories come together. You know, we can get intimation of Logos from all types of stories. I believe when we approach them with humility. And the patterns which reveal themselves to us in those stories can be like many, many epiphanies. And we can experience them on a very existential level. I mean, I have been brought many times to tears by the beauty and the power of this sudden connection. You know, you're meditating on a story that you've known your whole life, that your parents told you when you were a child. And all of a sudden, it's like a bolt of lightning, you know, becomes transparent, and you see that hidden pearl that it contains. So Christ is the key to Old Testament stories, but as the incarnation of the Logos, I believe he's the key to all stories. I believe that in him, the major patterns of universal storytelling find Their summit. Okay, now that I admit is a bold statement and I can't extensively prove it today. But what I want to do is I'm going to give you one example, one major example, and hopefully it will give all of us that little spark, that impetus to meditate on other stories and other patterns which exist in storytelling. So the example I've chosen to use is the common theme in storytelling, which is called the katabases and the katabasis is the descent into the underworld. By the way that I hinted to in my story of socks at the beginning, that was a little descent into the underworld. So, you know, scholars have often pointed to the fact that the Christian vision of the harrowing of Hades, of Christ descending into Hades to free its captives, is a theme that's taken from world myth. And often, as is common with scholars, there's a tone of smugness when they communicate that to us. You know, that, oh, you know Christians, you think you're so special with your story of a descent into Hades. Well, you know, it's a story that's been around for thousands of years, so. And so for them it points not only point to the fact of how unoriginal Christianity is, but also to how untrue it is. And so I have to be honest, I mean, that line of argumentation has always baffled me. I mean, I remember in my first year of college, one of my opening college traumatisms you would call it, and there would be several more. I remember there was some grad student who was giving a lecture on flood narratives. And her point in her talk was basically this, that there are flood narratives in pretty much every single culture. And what that means is that the Bible isn't true. And I remember when I was like 17 or 18 and I was already baffled, I was being told that there is a pattern of storytelling which exists in almost every culture on all continents. I mean, it is either the oldest memory held in unison by all men, or there is some mental structure that is so deeply embedded in the human constitution that it manifests itself through this universal image of an all destroying flood. And the reaction to that awesome reality is to tell people that the Bible isn't true. It is baffling. So let's get back to our katabacha. So like the flood narrative, the descent into Hades is nearly everywhere. In Mesopotamia, in Egypt, in the Mediterranean, but in Asia as well. Africa, the Americas and in the West. We're most familiar of course, with the stories that come from Greek and Roman myth. And in those stories we find these Visits to the underworld. For example, we know the story of Odysseus on his voyage home, who enters the underworld and summons the prophet Tiresias. Or the story of the hero Aeneas, who goes down through the underworld and then up, if you will, anticipating Dante, and travels to Elysium, the land of the blessed, where he encounters his dead father. And there are also stories of salvation from Hades. I mean, the salvation usually includes someone from the living or some God that descends into Hades in order to find someone else, in order to save someone who's stuck there, someone who got trapped there for some reason. So in this pattern we find the story of Theseus and Pirithous. Those two fellows, they descended into the underworld because they wanted to steal Hades bride Persephone. And then they made the mistake of sitting down in the underworld. So don't sit down in hell. That's a life story. That's a life lesson that you need to know. Okay, Resurrection means standing up again, so don't sit down. It's not useful. So they get stuck there for a little while. And then Heracles, when he's going in his voyage down into Hades, he's going to, to capture the dog Cerberus, the three headed dog who guards Hades when he goes down there. Then he goes and he frees his friend Theseus. But sadly, Pirithous stays stuck to his chair. So as I mentioned, in Christianity, as everybody here knows, we have this tradition of the heroine of Hades, which of course is the basis of this icon, the icon of the Anastasis. So Christ, upon his death on the cross, descends into death. And the images and the narrative around the story, scholars have noticed that it, you know, according to them, it just repeats the Katabasis pattern that we've examined. And so obviously it is just one more example of that universal myth. Or is it? I mean, there's been a lot of discussion about this and very provocative scholars like James Frazer at the beginning of the 20th century, he kind of started this. But other scholars have tackled this, like Jung and Joseph Campbell, and they've all attempted to show the similarity between Christ's story and the other ancient myth. And, you know, and then they're discussed and debated and they're argued about. And you find Christian apologists who are fighting against these people, you know, as if to defend the accusation that, you know, that Christ's story is analogical to other ancient story. But for me, you know, I'm actually willing to be extremely generous with these scholars. I am, you know, like, if you, if you Just take the very broad pattern of someone that goes down into the underworld or even down into the water or into a cave, you know, to encounter someone or to retrieve something, to look for a treasure like Aladdin, or to save someone, like Horus did. Osiris, you know, like Heracles, saved Theseus, although he couldn't save Pirithous, though I'm willing to give it all to them and say, yes, that pattern exists and it is one of the most basic structures of human consciousness. But then you have to ask, what does Christ's story do to that pattern? You see, these scholars like Frazer and Jung and even Campbell, they have actually ignored the story that Christians actually tell. They've ignored the whole story. It is false that Christians believe Christ traveled to the underworld and then came out. First of all, we believe that Christ died with everything that implies he was not visiting death. He united himself to death. He took death within himself. In the extra biblical traditions, we have these images of Hades rejoicing, right? Rejoicing, thinking he has won because he has taken everything in only to be surprised. And then did Christ just go down into Hades to save someone and then come back? No, that's not the story we tell by bringing God into death. We believe, as Christians, in the words of the apostle, that Christ abolished death completely. And we say it over and over. At pascha, we read St. John Chrysostom's homily every year, Christ is risen and you, O death, are annihilated, the evil ones are cast down, the angels rejoice, life is liberated, Christ is risen and the tomb is emptied of its dead. O death, where is your sting? I mean, even Pirithous is gone. Now, even before you believe it or not, even before you begin to ponder the insane paradox that such a statement brings about, if we just look at it in terms of a story, if we just look at it, at how that story engages that pattern, that ancient pattern of katabasis, of that descent into Hades, we find an example of what Christ's story does to all stories, what he does to all things that he all at once transcends. He even obliterates the pattern. Yet simultaneously he universalizes it, connects it, grounds it, illuminates it. The pattern of the descent and return from Hades is both transcended and fulfilled at the same time. And that's transfiguration. And it's not only that, but suddenly all these old stories are implicitly seen through Christ. And one of the hilarious ironies of the anti Christian 20th century is that These scholars like Frazer for example, who use all the ancient myths, you know, the so called dying God to trivialize Christianity, you realize that he's looking at all those myths through the lens of Christ. The event of Christianity was so ground shaking that so many of those that oppose it, even today, they can't help but do that looking through the glasses that Christianity gave them. And so the encounter of the divine in stories is something which can happen anywhere, anytime. But in order to experience this, our eye must always be focused on Christ and we must progressively strip away our passions. Now I know a few people, even maybe here, will have listened to this talk and felt maybe a bit uneasy, you know, and think that maybe I'm just proposing some intellectual gain for people to play. But encountering Christ in stories is a work of our entire being. Because in pondering and meditating on the story of Christ, what we realize and that what I realized is that we all have these, we all have a little Christ. And I think that all Christians do, we have this small, limited Christ which is actually an image of us. And in this little image of Christ we want to see the highest thing because it is an image of us. And that's a lot easier. And some of us might be attached to certain aspects of Christ's story. So I mean, you meet people who are attached to, for example, the infant blessing, sermon on the Mount aspect of Christ. And we want to see in that the highest thing. And other people are attached to the denouncing hypocrisy and laying it out as it is facet of Christ. Others to Christ as the ruler and the judge of the world, still others to the teacher of truth or Christ as the healer. And still others as the self sacrificing aspect of Christ, of this innocent victim of a corrupt establishment. And the list goes on and on. And each of these facets of Christ are good. But if we take them alone, without committing ourselves in faith to the whole, in those facets we can hide our own passions. And so, for example, those who prefer the denouncing, hypocrisy facet of Christ might resent authority. Those who prefer the teacher of truth might ignore the significance of Christ praising Samaritans who were the heretics of his day. In order to encounter God in stories, we must first renew our intelligence. But we must also slowly let go of our passions, our pride. And as we do, the story of Christ opens itself to us and we will see more of him in it. I mean, I am always amazed every time I go through the gospel. I'm knocked down and I'm like, how is it that I didn't notice this before? It's like I've read it 30 times. Why is it that this little thing that Christ said has never stuck into my memory? And it's usually because it doesn't fit what I think Christ is. And it just shatters you every time. And you have to reconsider that. No, Christ is bigger than what you think, and he's bigger than you'll always think. He's bigger than everything. And I think that as we do that more of Christ will appear to us from Old Testament stories, and even the light of Christ will start to shine through the world stories in the capacity that each story has to manifest that light. And I'm not saying that all stories are good in their specifics. I mean, obviously not. There are many evil things in stories, just as there are in people. But one is always surprised to encounter a seed of truth in the strangest place, though sometimes hidden deep down and surrounded by weeds it might be. And behind all the veils, behind all the coverings, we sometimes are surprised to encounter this divine spark. And so that's my encouragement for everyone today. Thank you."}
