{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":0.16,"end":59.24,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am here with JF Martel. JF Martel is a thinker. He's a filmmaker, just a cultural theorist. He's written a book called Reclaiming Art in the Age of Artifice and also hosts a podcast called Weird Studies. The strange thing about JF is that several years ago, someone pointed me to him and said that we were like doppelgangers, that we really look like each other. Even my wife, when she saw a picture of him, thought, wow, this guy really looks like you. And what's interesting is that a lot of his ideas start from similar positions as mine. Talks about the world as story, about how reality is built out of story, and he comes to conclusions that are slightly different from me. So I think this is going to be a very interesting discussion. This is Jonathan Pageau. Welcome to the symbolic world."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":68.75,"end":70.43,"speaker":"Jf Martel","text":"And my wife said the same thing."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":71.31,"end":72.27,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":73.55,"end":75.67,"speaker":"Jf Martel","text":"Yeah, yeah. Like brothers, more like."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":75.67,"end":78.91,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And we're also both French Canadian, which is just strange."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":78.99,"end":96.22,"speaker":"Jf Martel","text":"So we should be doing this in French. Yeah, it's a little awkward, but we'll get the hang of it. We're both used to it. The thing is that, yeah, I guess it goes to show that we come from a society that was, until very recently, very homogenous, that we could look so similar and not have the same last name."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":96.46,"end":99.94,"speaker":"Jonathan Pageau","text":"Exactly. You probably have some bloodlines crossing at some point in the past."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":99.94,"end":104.7,"speaker":"Jf Martel","text":"Oh, for sure. In fact, I think you're only like a few hundred. You're in the Eastern Townships."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":104.7,"end":105.06,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":105.06,"end":105.58,"speaker":"Jf Martel","text":"Is that where you."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":105.58,"end":107.58,"speaker":"Jonathan Pageau","text":"Yeah, well, I grew up in the Eastern township, so."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":107.66,"end":111.5,"speaker":"Jf Martel","text":"Oh. So I'm in Ottawa, so we're pretty close. Anyways. Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":112.46,"end":129.9,"speaker":"Jonathan Pageau","text":"So you wrote a book called Reclaiming Art in the Age of Artifice, and I've heard you talk on several podcasts about certain approach to reality, about reality being made of stories. So maybe you can lay out the basics of your idea, and then we can start to explore the kind of. The similarities and differences with the things I'm talking about."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":130.46,"end":273.54,"speaker":"Jf Martel","text":"Sure, sure. So Reclaiming the Age of Artifice is a book I wrote a few years ago now. And the goal of the book was to. I had been working in the media industry for some time at that point, and I'd become frustrated with the types of questions that my fellow artists and I were getting from the people who were basically the gatekeepers of the industry, the types of things that we were asked to do. This is not new. Every artist knows this. Who's working in a big industry is that you start off with this vision, this idea of what you'd like to do. And then, of course, it's almost like you're holding a. A candle, and the industry's a maze. And the goal is to somehow make it across to the other end with these howling winds through the tunnels with the candle still lit at the other end. So I thought, well, and this is, I think, is something that a lot of artists have felt. So I was just thinking about that. And instead of going the usual route, which is to say, well, that's just the egocentric artist wanting to control, you know, not answering to the demands of culture, but trying to get their own personal opinion across or their own personal vision, but really the market knows what kind of art should be made, and one should just kind of bow to that. Instead of going that route, I decided to go the other route. And I drew on the artists that I love. People like Oscar Wilde, people like Albert Camus, Flannery o'. Connor. You know, I remember the. The artist that. That I was into at the time. Stanley Kubrick, you know, and just going to see, well, what did they say about the process? And I found that often what they said resonated with what my artist friends and I were feeling, and they had just been the people who'd been able to make it across the maze with the candle still lit. And so then I thought, well, what is it that we're doing as artists? So I became interested in the question of art. And to be honest, this is a question that's preoccupied me for a long time, since I was a teenager. I think that it's probably one of the archetypal dialogues you'll hear in a high school or sijep. Right? It's the what is art? Conversation. Oh, that's art."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":273.54,"end":274.22,"speaker":"Jonathan Pageau","text":"That's not art."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":274.22,"end":352.13,"speaker":"Jf Martel","text":"That sort of thing. Well, I decided to take that question seriously as a thought exercise, at first, as a thought experiment, and then finally ended up. Because I was writing for a magazine at the time called Reality Sandwich, I ended up getting an opportunity to write a book about that. And so I did. And so the book basically argues that art is a means by which the human being is able to capture touch, express the real with a capital R. So what is real? What is really real? And that art is innately spiritual and that we have simply forgotten that. And there's something basically fundamentally subversive about art in the sense that it shows us things outside of the usual frames of reference that we. We know the men. So it will take, for example, you know, the example I use in the book on a few occasions is you'll have someone take a vase with sunflowers in it. And transform it into a weird menagerie of alien monsters."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":352.29,"end":352.69,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":352.69,"end":384.62,"speaker":"Jf Martel","text":"To transform them into something where the sunflower, which seems so known, so familiar to us. Suddenly becomes strange again. Restored to its original strangeness. Because the theory is that we tend to project our concepts on things. And then we reduce those things to those concepts. And art is a way of getting through that interface, that kind of overlay of conceptual apprehension. To get back to something like the original reality of creation."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":384.62,"end":385.02,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":386.22,"end":440.28,"speaker":"Jf Martel","text":"And I'm not saying that there's a kind of gnosis in art. But I'm saying that at least it shows us our unknowing. So it's like an antinosis. It removes the idea that we can know things with certainty. It restores us to what in the book I call radical mystery. That's what art does. And that's how you can kind of distinguish something like Guernica or the Sistine Chapel or an icon. From something like a car commercial or that horrible milk commercial. I'm sure you remember in Canada where they took Beethoven's 9th and turned it into. It was just the word milk being repeated over and over again when we were kids. So, like that sort of thing, that type of propagandistic type of art that tells you how to feel and think, which in the book I call artifice. It was an exercise in rehabilitating and weaponizing an adolescent feeling."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":440.44,"end":554.21,"speaker":"Jonathan Pageau","text":"Yes. And so one of the things that I've heard you say is really this return to the phenomenological. Which is something that I've been helping, trying to get people to get back to, which is that the reality. We have access to the reality of these things that present themselves to us in terms of, you know, the hot, cold, inside, outside. These categories of experience, they're actually the first categories, right? They're the categories the world is made out of. The other categories, like the scientific categories, are real, but they're secondary, let's say, to these first kind of impressions. These. This world of phenomena that we deal with. And so maybe because you talk about the vase. I remember listening to you talk about the vase in this interview. And you mentioned how by framing it, let's say, by putting it into an image and then having you. Having it called to your attention. So asking people to attend to it, then you're making. Forcing the person to ask themselves, what. What is this? Like, why is the vase there? Like in. I think you Remember, in. In this podcast I listened to, you're talking about a movie where the person focuses on the vase for too long, like, lingers on the vase with the camera. And so you forced to ask yourself, like, why? And therefore ask yourself, well, what is a vase? Like, what is that? What. What. What categories are kind of coming to us in terms of vase, vessel, Right, exactly. So it's like, it's something that holds something else. It's something that is. And therefore it becomes analogous to other vessels. Right. You can think of a mother, you can think of a house, of anything, that ocean, something. Yeah. So there are all these different things that kind of flood in, these analogies that flood in, which can kind of help you understand why a vase is important and also why it has. Why we even have a category of vase."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":554.72,"end":562.4,"speaker":"Jf Martel","text":"It basically, the image turns the vase. I say vase. I had the same. Let's just say vase just because it's."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":562.4,"end":563.84,"speaker":"Jonathan Pageau","text":"Nicer, it's French, it's vase."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":564.24,"end":565.2,"speaker":"Jf Martel","text":"It turns the vase."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":565.44,"end":566.32,"speaker":"Jonathan Pageau","text":"I'll say vase."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":566.56,"end":701.64,"speaker":"Jf Martel","text":"Let's just post. Let's read. Okay. So the vase is transmuted in almost an alchemical way into a symbol. So in the book, I talk a lot about signs and symbols and that we usually live in a city of signs, a town with neon signs everywhere telling us what things are. Whether we're in the forest or on a mountain doesn't matter. We live in sign city. Everything has its attributed meaning. Everything has a label attached to it. But then sometimes in life, for a moment, usually there's a kind of satori moment or a moment of clarity where, oh, my God, the strangeness of things comes back, comes to you. And that comes through what I. In the book. In art, it occurs through framing. You frame out something which normally would just be part of the decor of ordinary life. But once framed, it starts to emit what Thomas Aquinas called radiance claritas. And that radiance does two things, formally speaking, just by virtue of being framed. It calls you back to the original mystery of all things. It reminds you that we don't really know what anything is. We're kind of living in this mystery. Secondly, the specificity of the object in the frame, in this case, the vase calls you to interpret, to ask about this object, this thing that you're looking at that you don't know anymore. And that's what occasions the process of symbolic thinking, of thinking in terms of analogy. And so you start to think about associations. And some associations have become classic. For example, the vessel, the mother the ocean. Right. The night, the things that contain the things that those associations have become quite standard. But my gambit is that modern art at its best allows for new associations, and so that there's never a symbol dictionary that's complete. Right. This is always in the process of being discovered."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":703.16,"end":746.51,"speaker":"Jonathan Pageau","text":"Okay. So this is really, for me, it's very fascinating to hear you speak, because what I hear when I listen to you is I hear kind of two things going on. And for me, at least, the way that I've tried to present it has really been two things. And so this notion of the mystery, or this kind of entering into the mystery, if you think of an ancient temple or a church, you have the space of mystery, which is the altar, let's say. And that's where the magical event happened, the event that binds us together as a community, the event that connects us to something higher. And so it is beyond description, although you can describe it, you know that it's also containing something which is leading beyond it. Right, so higher up."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":746.51,"end":748.35,"speaker":"Jf Martel","text":"Okay, that sense. Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":748.35,"end":880.45,"speaker":"Jonathan Pageau","text":"And so usually those. The analogies that go with that are kind of this moment of clarity that you talk about, or the moment of light, this idea of a beam of light or a vision or so there are all these unveiling, you know, all these types of imagery. And then there's another space, right, which is the space of the margin. And that's usually where the strange happens. And so that's where, like, for example, in medieval manuscripts, you had monsters, right? You would have the marginalia where you have all these mixed creatures. You have surprising. You have inversions, you have, you know, rabbits, fighting men and all this strange stuff that happened in the margins. And you see it also in the shape of the church. We have the same. You have the gargoyles on the outside of the church. And so the gargoyles are this. This surprising hybrid. Strange, right? The weird. That's where the weird kind of occurs. And so, to me, there's an interesting thing because you kind of join those together. And I know that there's a way in which that's not completely off, because the guardian, like the monster guardian, like Cerberus or some other creature is usually represented. It's like if you're going into the holy place, so if you're going into the mystery, you'll encounter a monster because he's protecting the holy place. And so you see the cherub on the veil of the temple, you know, the sphinx, these kind of bull, winged bull creature that you see in Mesopotamian temples, they're guarding the mystery. But then when you go beyond, when you have to kind of past them, they're like a veil. And then beyond that there's the illumination, you would say. And then you. Yes, you. Then you can grasp, let's say, the vase in its. In a way that is beyond all its particulars. So it's like you grasp, you get this thing. It's like you this, this. And you said gnosis. I'm totally fine with that term. Like you get this insight which will then be. It's beyond words and it's beyond the particular, and you get it. But what's fascinating to me is that it seems like for you those two things are kind of the same."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":880.85,"end":882.29,"speaker":"Jf Martel","text":"Yeah, yeah. Strangeness."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":883.17,"end":884.05,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":884.13,"end":907.26,"speaker":"Jf Martel","text":"No, that's really interesting that you bring that up, actually. There's a Protestant theologian, Rudolf Otto, I don't know if you're familiar with his work, but he came up with a concept in his work which he calls mysterious. The. Calls it in Latin, mysterium fascinans et tremendum, the fascinating and terrible mystery."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":907.9,"end":908.3,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":911.34,"end":1027.57,"speaker":"Jf Martel","text":"This is in a work that explores, that tries to capture the nature of the sacred. And what Otto argues is that the sacred is always a two pronged thing. The sacred reveals itself as fascinating in the. In the positive sense, not in the sense of casting a magic spell, but in the spend. The sense of that Aquinas means by illuminating, it draws you in. It is a night type of gnosis. It confirms something that you could only dream or hope was true and shows it to you in a way that's beyond words. At the same time, strangely, mysteriously, it is also terrible because the sacrifice it asks of you is terrible. It's like Abram and Isaac material, right? And so it's both. And I tend to be. This is super interesting that you brought. You kind of put your finger right on it there. I think when it comes to the two of us and the way we approach these things, I think you're right, I tend to be more Manichean or which means more dualistic about this thing, because I am uncertain as to whether the real capital R, the ultimate, is something that would be. That is something that would bring one joy or absolute horror. I don't know. I don't know that I believe that it's good. That's why I'm a practicing Catholic. But I don't know it. I don't feel it. I feel like there's a chance that the illumination, if it were complete, would be like what the Germans experienced at the end of Raiders of the Lost Ark."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1027.73,"end":1133.18,"speaker":"Jonathan Pageau","text":"Right, yeah, well, for sure, there's that threat in scripture and that threat in the idea of God or this idea of the revelation of Vishnu. Right. Where he removes his mask and then this thing that is seen by Nagarjuna is like this. I think that's his name is like this insane thing. And you get the sense of that in scripture as well, where God. When someone asks to see God's face, God says, you can't. Can you see my face? It's going to destroy you. And it seems like, at least in Christianity, that all of that gets resolved or resolved. It's resolved in a sense that it's brought together in the cross, which is that moment where death and glory are joined together in that moment where the horror and the highest thing are kind of joined together in one image. And so I think I agree with you in that sense that there is something. And there's also this idea of the relationship between the divine darkness and the divine light. And you see that I talk about that quite a bit because I have a carve. Icons. And so I actually make opaque images. People always talk about icons as windows to heaven. And I'm like, well, I make carvings. And so it's more. It has more to do with this. In the Old Testament, there are certain places where when God's glory comes, it's like a darkness. It's like this darkness which comes in. And sometimes it's both. Like in the transfiguration of Christ, it says they were overshadowed by light. So it's like a cloud of light. And so it's both a dark and light, like something which shadows you, which stops you from seeing the light, but also you see the light. So it's like, that's. I see what you're talking about in terms of the duality of the. Of the revelation, let's say."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1133.42,"end":1151.67,"speaker":"Jf Martel","text":"Right, right. Well, I'm glad. Yeah, I'm just. And you say that Christianity resolves it. I think that you're right. I think that Christianity resolves it, but I guess I'm just not quite sure that. That Christianity is right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1152.63,"end":1155.03,"speaker":"Jonathan Pageau","text":"Christianity is right in the. In what sense do you mean?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1155.59,"end":1175.03,"speaker":"Jf Martel","text":"I just. I. I'm just much more ambiguous with. Well, like, again, I'll say I'm. I am a Christian, but I'm a Christian. I mean, Dostoyevsky said that. He says my hosannas were forged in the immense furnace of doubt. So I guess I'm still in the immense furnace of doubt."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1175.34,"end":1175.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1175.82,"end":1303.48,"speaker":"Jf Martel","text":"And so. But What I love about. And also I wouldn't want it any other way in the sense that I think that it is important that we. That the spirit of exploration that characterizes the human is given, is vindicated and allowed to go the whole way. Some of my favorite Christian writers, most of them became Christians after they. At the end of their careers, are the decadent writers of late 19th century. People like J.K. visman. Yeah, right. And also like Aubrey Beardsley. And people who realized at the height really of that moment where the modern kicks into full gear. Right. The end of the 19th century, these guys realized that in order to affirm meaning again, we would have to affirm the most awful meaning. We would have to affirm sin and darkness and evil. In order for the axis of good and evil to even exist. We have to go down there. And I think that they. I don't know how conscious of it they were, but when you look at the work, you look at Huysman's series of novels from Aribour to the late works, where he was basically a. I think not an abbot, but. Yeah. Oh yeah, like a lay monk. Yeah. There's a movement there that's very important. And I think that the way for a modern to re. Enter, to rediscover what there is to discover in those old religious traditions, I think that that path, the left hand path, as they call it in magic, is a super risky but sometimes maybe necessary one. And so I'm kind of. That's why I'm. I'll emphasize the unseeable face of God and point out that that face is unseeable because it's monstrous. And I emphasize that side. That doesn't mean I disagree with you in the least. I agree with you 100%."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1304.2,"end":1325.83,"speaker":"Jonathan Pageau","text":"Yeah, well, it's like I always try to remind people that we do eat the blood and body of Christ. That's the highest sacrament. It's like. It is. You can say that it doesn't refer to cannibalism at all, but that would be actually missing the point of how Christ unites the extremes in his person and in. And in his sacraments ultimately."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1325.99,"end":1326.39,"speaker":"Jf Martel","text":"Right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1327.11,"end":1449.3,"speaker":"Jonathan Pageau","text":"But the thing that I'm worried about mostly is that there is this image of. Especially in exploring the darker aspects, like there is this image of losing yourself, you know, because that's the imagery of the demonic or these hybrid creatures that appear, you see, in these images of hell, of like early Renaissance or late medieval images of hell, these kind of monstrous hybrids. And all of this exploration, interestingly enough, before they were Actually almost more positive these monsters because they were just in the margins of the document. Like they were not just Latin help in the sense of the. This just in terms of negative. They were just ontologically on the edge. And so they just created a border for the peripheral. Yeah, this peripheral kind of weirdness that appeared on the edge. And so it's the highest version of that I think is. I don't know if you've seen heard me talk about St Christopher, which is something that I've been trying to talk about quite a bit. So St Christopher is a giant in some traditions, but he's also a dog headed man in other traditions. And so he is this kind of monstrous dog headed creature who in the legend he works, he's looking for the strongest king and he ends up like actually working for Satan. And then finally he's looking to work for the strongest king but he ends up submitting to the baby by crossing this child across the river. And then there are versions of it where he's a giant other that he's like the giant dog headed monster. So the idea is that the monstrous are the hybrid. Its best possibility is a bridge because it's on the edge. And so it can actually carry the logos or the light or the divine revelation further out into the world. But it also guards you. It also is like a guard against improper defamation or desacralization. Something like that. Right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1449.54,"end":1461.22,"speaker":"Jf Martel","text":"Well, it's kind of like reminds me of what McLuhan was saying about artists. Marshall McLuhan, the Canadian media theorist. Right. Whom you've discussed on your show. And I really enjoyed the interview you did with what was the name of the scholar?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1461.46,"end":1462.38,"speaker":"Jonathan Pageau","text":"Christian Roy."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1462.38,"end":1463.5,"speaker":"Jf Martel","text":"Yeah, Christian Roy."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1463.5,"end":1471.46,"speaker":"Jonathan Pageau","text":"Right, yeah. Christian would be someone you would really like to talk to by the way, because he's very interested in similar subject. In the same subject as you."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1471.46,"end":1521.46,"speaker":"Jf Martel","text":"Yeah, fantastic. The McLuhan described the artist as a probe or as an. Was it, I can't remember the term he used like something long distance, early warning system or something. That's what he described, art. Right. And so the probe goes out into the chaos, into the margins, into the areas that we don't know and incurs a risk by doing that. There is a risk. I ultimately think that if you're going to turn a sign, and again for your listeners who aren't familiar, a sign is just basically the way we conceptualize a particular object in the world. Like this lamp I'm looking at here on the screen. It's all very clear to me. I see it and I See the label screen?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1521.46,"end":1521.74,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1521.74,"end":1605.74,"speaker":"Jf Martel","text":"I don't need to think about it. I can just go about my day and use it. But in order for, to take a sign, let's say, let's go back to the vase of sunflowers and transform it into a symbol. The process by which that happens, I've discovered, is that the sign needs to move through a zone of indeterminacy. The sign can't go from sign to symbol like a light switch. It has to first become monstrous. It has to go into a place where you don't recognize it anymore. And I think any artist will recognize that moment where they look at their work and they don't know what they're looking at anymore. Like none of it makes sense. Like everything looks off. And that's the. In a way, that's kind of a sign that you're moving towards the something new. Right. There needs to be a place where you don't. A moment where you don't know anymore what you're looking at. Yeah. And I think that that process of sending things that are familiar into the depths where they become unfamiliar is dangerous. And I don't think it's a coincidence that mental illness is prevalent, is related to artists. Related to artists because there's that risk. And so kind of you have to become a kind of dog headed monster a little bit and that's okay. But there is a risk and the risk is real. And I don't want to try to say like that the risk is. Yeah, I don't wouldn't want to try to imply that the risk isn't real."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1605.74,"end":1624.01,"speaker":"Jonathan Pageau","text":"Because it is like a way to say it that might surprise you is the idea of baptizing something because that's what baptism is. Right. You don't see the symbolism as much in Catholic baptism, but let's say in orthodox baptism, baptism is a descent into the waters. Right?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1624.25,"end":1624.61,"speaker":"Jf Martel","text":"Right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1624.61,"end":1680.74,"speaker":"Jonathan Pageau","text":"You go down into the waters and there are these, you know, there are these little river gods that are there. You see in the icon of Christ, you see these little kind of ancient Roman river gods that are kind of down there. And so when you. And there's prayers, like at the beginning of baptism where you chase out the dragons from the waters before the person goes down. And so the idea is that when you go down, when you bring something down to reform it, like you said, there's a danger in that moment, that moment of unformedness. We usually tend to focus just on the coming out and this kind of, this coming back into light and then having this Insight or having this higher insight about the thing. But you're right. Even myself, I don't tend to talk about the unformed part. If I carve an icon, then that piece of stone is quite pristine right before I start. And in between the piece of stone and the final thing, there's a lot of messiness that happens in that moment."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1680.74,"end":1744.75,"speaker":"Jf Martel","text":"Right, Right. And there are the process asks of you something that. I've been talking with an Australian artist named Andrew Antonio. He's a very talented surrealist kind of painter and he. Yeah, he was talking to me yesterday about the confrontations, the paths you find that. You know that if you follow that path too far, it might lead to something that you're not ready for. Right. There's a whole interior world. And I think there's something else that art tells us, whether it's liturgical art or wonderful secular art. I actually don't think there's a difference. I think art. I don't think there's any such thing as profane art. My personal theory is that art is inherently sacred if it's real art. But then you have to get into the unpleasant game of defining that. But whatever. But he was. Where was I going? I totally lost my train of thought."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1744.99,"end":1749.15,"speaker":"Jonathan Pageau","text":"Your Australian friend who talked about the danger of going in a certain direction."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1749.31,"end":1818.61,"speaker":"Jf Martel","text":"The danger. Right. That there are. That artist calls us to develop and explore our interiority, which is probably the biggest problem we have today, is that there's a full on assault going on on interiority in our culture. We are being called to think of ourselves as purely external creatures, like completely oriented to what's outside. There's very little in our culture, especially now with the advent of ubiquitous digital culture, there's very little opportunity for people to go in. And art requires you, if you're going to do it properly, to go in. And going in is. There's a reason we don't want to do it. It's not pleasant. It can lead to all kinds of strange and unpleasant discoveries. But the theory is, or the gamble is that it's worse not to do it than to do it. As bad as it is to go inside, it would be worse not to. Because then of course, all your horrors will manifest externally."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1818.85,"end":1886.57,"speaker":"Jonathan Pageau","text":"Yeah, well, it's fascinating because I found my own kind of solution to that, which you probably won't agree with me. But for me, the solution that I came to in terms of art, first of all, in terms of the problem of art and artifice, is the discovery of more traditional art, or liturgical art, for example. Actually breaks down that barrier. Right. In terms of the difference between, let's say, an object of consumption, the way that we think of it, you know, like how now we have objects of consumption, and then we also have our things that are there to give you a message. Then we also have the high art, let's say, that is supposed to be more exploratory. In liturgical art, they kind of joins together because the object you make is going to be used. It doesn't just. It's not just looked at. Right. It's not just like an object of contemplation, but it's going to be used in prayer, it's going to be used in liturgy. And so it kind of binds the different aspects of art together in objects."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1887.45,"end":1900.41,"speaker":"Jf Martel","text":"Yes. And I think that's fine. I think that's an important point, and I think that's good. I just think that we've lost our way of discussing that part of the liturgical art that isn't artifice."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1900.73,"end":1901.05,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1901.13,"end":1923.13,"speaker":"Jf Martel","text":"The Claritas part, the art part, is what we've lost the words or signs to determine. But that's what I'm trying to recover. I perfectly agree with you that a work of art can be also a work of artifice in the sense that it can have an instructive or functional role to play in a particular context. Nevertheless, there's a difference between a good icon and a bad icon."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1923.13,"end":1923.93,"speaker":"Jonathan Pageau","text":"Oh, yeah, for sure."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1924.17,"end":1926.09,"speaker":"Jf Martel","text":"And how do we talk about that?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1926.37,"end":1926.53,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1926.53,"end":1947.25,"speaker":"Jf Martel","text":"And you evolve. I mean, most people look at Orthodox icons and they just see the same thing. Right. But I'm sure that as an icon, I'm certain that as an icon artist yourself, as someone who is a carver in the Orthodox tradition, you're very much aware of the subtle differences that makes, I don't know, like an Andrey Rublev different from someone else's icon."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1950.37,"end":1984.84,"speaker":"Jonathan Pageau","text":"Definitely. No, there's definitely. There's definitely something that makes. There's definitely a. A difference between a very bad icon and a good icon. The strangeness is that it seems. That seems that in terms of, like, in terms of miracles, it doesn't matter. And so, no, like. So some of the really worst icons become, like, these centers of pilgrimage. People, like, have these. And then it's like it becomes the center of a whole community. And you think, wow, that's wonderful. And then. But you're something in your mind telling yourself, still a bad icon."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1985,"end":1986.12,"speaker":"Jf Martel","text":"Yeah, exactly."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1986.76,"end":1994.76,"speaker":"Jonathan Pageau","text":"Even if, like, I recognize this is amazing, and all these people loving each other and kind of surrounding this thing, it's great. But still, It's a bad icon."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":1994.84,"end":1999.88,"speaker":"Jf Martel","text":"Yeah, that's a great point though, because it goes to show that. Yeah, yeah, that's."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2000.04,"end":2058.76,"speaker":"Jonathan Pageau","text":"Nonetheless. And there are ways, like, there are reasons why we recognize certain artists as being like. Rublev, for example, is a great example. He was the joining. He kind of joined everything together because he was really recognized as a holy person early on. And he actually is canonized now. He's a saint. Like, you can get an icon of Rublev of him, like not just his icon, but of his portrait, but he also was recognized as someone to copy. And so. But his work is very different from what came before. So actually there's quite a lot of innovation in his work, but he was rapidly recognized as something that was setting a new path that those that aren't so good need to follow. It's like here is something that's really kind of showing itself brightly and then telling all these other artists that are mediocre to say, okay, just look at Rublev, like, follow Rublev. These are like church council saying that, like Moscow council saying, look at Rublev, copy Rublev. Because a lot of you guys are just off the rails in terms of icons."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2058.76,"end":2075.44,"speaker":"Jf Martel","text":"Well, that gives the lie to the popular idea that icon art has never changed because it does innovate in ways, but it innovates through, I guess you call it through a kind of grace. It's not about individual self expression. It's not like Rublev is like, I'm."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2075.44,"end":2076.72,"speaker":"Jonathan Pageau","text":"Going to do things my way."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2077.2,"end":2157.57,"speaker":"Jf Martel","text":"It's more like he encountered a problem and he found he received a solution. Right? Yeah. That's how art evolves. And I think that's more common in secular art than we think is what my thing. Because, and I totally think I completely understand why you found. Because I know you started in contemporary art and then you discovered traditional art and went into that world. And I can see why one would do that because there, the. These ideas that we're talking about aren't that foreign there. That's kind of like, yeah, art doesn't come from individual human beings, it comes from beyond. In the secular culture, we have no language to discuss this. Nevertheless, we have things like Guernica, you know, Picasso's Guernica or Moby Dick, you know, or Hamlet, I don't know, like, or an Emily Dickinson poem. It's like eight lines. These things, they too reveal things to us. And so we have to be able to figure out what it is that's going on in secular art that it's so unsecular. It just can't be secular. It has to call us back to the mystery and to the sacred."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2157.73,"end":2281.62,"speaker":"Jonathan Pageau","text":"And I think you're right. And there are artists that are doing that now. I think one of the difficulties of the modern time is, first of all, it was this race towards genius and this race towards the personal. And so, you know, this idea of. Especially you see it in Abstract Expressionism the most, where they have all these artists that have this, like, one characteristic style, and then you recognize their paintings, and then they. It's like. It's as if their whole person gets embodied in this style. And then it becomes a marketing ploy. It becomes an easy way to market them as well, sell their paintings for millions of dollars. But you see that already in the early 20th century with a lot of the early modernists. But there are some things that I think even in liturgical art that they discovered or that they brought forth, it can be recuperated. And so I know some icon painters that are using Rothko in terms of Rothko's ideas of push and pull and this notion of how space and color interact with each other, but now more subtly to the service of something which they think is more communal and is more kind of bringing people together. And I think the same thing happens with Cubism and with the early kind of formal developments that happen in Modernism. My own take on it was that, especially arriving in the early 2000s or late 90s, I felt like there was just nothing else happening. People were regurgitating Marcel Duchamp in one way or another, and the painters were all regurgitating the early modernists in one way or the other. And so I thought, so how did this happen? Like, what happened? Because there was this race at the beginning of the 20th century towards this radical innovation and this surprise of the new. And then it seems like it actually kind of petered out even before World War II. And then after World War II, then it's just like. Because everything Warhol did was already in data. Like, that's fine."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2282.42,"end":2283.06,"speaker":"Jf Martel","text":"No, I agree."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2284.66,"end":2307.42,"speaker":"Jonathan Pageau","text":"I don't know. How do you. Especially because you're not necessarily visual artist. But in terms of visual art, to me, it seemed like. Even in terms of visual innovation, it was like this quick burning thing that they lit and it went. Then it was over, and now people were being traditionalists about breaking tradition. It was like this strange way of thinking."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2308.14,"end":2400.96,"speaker":"Jf Martel","text":"I think that. I mean, that's a huge question that we could discuss for hours. But I think that one quick answer that I'd like to give, like the Venture theory, I guess, is that I tend to think that changes in art happen in poetry first. So. And. Or at least that's where they become more noticeable. In this case, I would think that if you look at Paris in the mid 19th century, in London a little later, and Germany, of course, you'll find the. I'll go back to the whole idea of decadence, right, of these decadent literature, decadent poetry. What is the archetypal figure of decadent poetry? It is the anemic last in line aristocrat, the last of his house, who is so bored with life, with modernity, that all that's left for him is sensual pleasure. And so, like Huysman's character is the ultimate. He locks himself up in a palace of strange curiosities, bizarre, grotesque plants, and like turtles inlaid with gold and all kinds of queer. And he just luxuriates in this pleasure of the senses until finally he can just die because there's nothing left of the world. There's nothing left except surfaces. Acedia, Right. There's the way. The monks, the monks who suffered from this condition in the Middle Ages, they were told that they suffered from them."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2400.96,"end":2404.64,"speaker":"Jonathan Pageau","text":"Called acedia, the disease of our age. Pretty much, yes."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2404.88,"end":2499.85,"speaker":"Jf Martel","text":"And then what you see in afterwards, and this, you know, what you see is like data, is the kind of codification of that decadent feeling affect that was new when Baudelaire and Lismann and Poe were talking about it. All of a sudden it's codified, it's instrumentalized, and it happens to serve a commodity culture very well. A culture that's completely. In fact, you know, the whole Dada dream of a world of obliterating the line between art and life. We've accomplished that. We live in the utopia of the Dadas and the Situationists, in a way. We live in a world where there's no more boundary between art and life, between. Yeah. So I think that acedia, which those decadent poets pick. Poets explored first, then just became a generalized social phenomenon. And you see it play out in all these crazy, theatrical, weird theatrical events like the Nazi rallies or like that ridiculous shit we saw in Washington a few weeks ago. This type of, like, pretending to care about, pretending to be part of history, like fabricating events to trying to get us to feel something again. I think that we're just apathetic as a culture and we need to wake up. And that's my take on that."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2500.57,"end":2609.81,"speaker":"Jonathan Pageau","text":"Your final word is that we need to wake up. I agree. I totally agree. I tend to see. And that maybe brings me to. Also to. One of the aspects that I've been trying to develop, which is art as participation. One of the things that I've been trying to point people towards is the difference between the modern notion of art as a kind of aesthetic experience or an exterior aesthetic experience. You know, going to the opera, going to the concert, looking at a movie, watching a movie. All of this is different from the participative art that ancient cultures had or, you know, that the idea of a dance or, you know, or singing folk songs together or sitting around a fire and celebrating our stories. Right. You know, even the Iliad was sung, right. People didn't read it. They would have bards that would come and would sing it to them because it was their story, and they would kind of have this participation. And I think that, like you said, one of the difficulties of something like the fascist tendency is in noticing the vacuousness of, let's say, pleasure, this kind of exterior pleasure, this surface pleasure, and the entertainment culture that we embody is this desire to participate. And they're looking for places to enter into the story. And the political sphere is an easy and scary place to enter into the story, where you take a side, you have a bad guy, you have an enemy. You know, you can even make them really, really evil, like in terms of the queue type people. And then you know where you are and who you're fighting and what you're doing. And so it makes you feel alive in a way that I can sympathize with, but also is extremely dangerous because it's very limited."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2610.53,"end":2616.17,"speaker":"Jf Martel","text":"It's limited and it's fundamentally. It gets everything exactly half right and exactly half wrong."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2616.17,"end":2617.33,"speaker":"Jonathan Pageau","text":"Exactly right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2617.57,"end":2625.23,"speaker":"Jf Martel","text":"So being half right is not a good thing in life. It's like the worst. It's better to be fully wrong than being half right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2625.23,"end":2626.11,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2626.43,"end":2655.49,"speaker":"Jf Martel","text":"So is there corruption at the top on both sides of the aisle, politically? Of course there is. And so. But there's. That's where subtlety becomes very important, you know, and looking at yourself becomes very important. And not also the holier than thou feeling that the fascist sentiment encourages, that we are the pure and they are the impure. And all of a sudden all of the stuff that we can't acknowledge about ourselves gets projected onto the other. Not a good thing, not a good path."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2656.13,"end":2726.82,"speaker":"Jonathan Pageau","text":"Yeah, but that's why, like, for example, when I talk about the church building, let's say, and I tried to get people to kind of experience it, because it's not. I talk about it, but it's Also experiencing it is that the church building, let's say the way it's built, like when you enter into it, it has three parts. It has the altar, it has the nave, and then as the narthex, those are the main parts. And the narthex is that place of relationship with the outside where the monsters appear, you know, the gargoyles and all of this stuff. And so there's a hierarchy of being, but it's not a simple in out identity, it's not a simple us, them, because it's actually a hierarchy which moves out into the outside and into the indifferentiated possibilities which lay outside of my identity. And so it's a healthier way to encounter identity. And some people will, will object because there is to a certain extent a recognition of the monstrosity, of the strange. Like when I encounter something that I don't recognize, like a stranger, there is something monstrous of that. But if I know that that monstrosity is also, is also part of how it, like I recognize it, right?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2726.82,"end":2727.54,"speaker":"Jf Martel","text":"It's structural."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2727.62,"end":2735.1,"speaker":"Jonathan Pageau","text":"It's just structural. It's there. And so I see the stranger and I recognize. Oh, that's weird. And then it's like, okay, well now move on. Like it's. I don't have."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2735.1,"end":2735.82,"speaker":"Jf Martel","text":"I can get over it."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2735.82,"end":2750.21,"speaker":"Jonathan Pageau","text":"I don't have to necessarily like throw a lance at it. Right. It's just part of how the world lays itself out. And the idea of having like a saint, like St. Christopher or certain other saint, Moses, the Ethiopian, certain Moses with the horns too."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2750.53,"end":2751.97,"speaker":"Jf Martel","text":"The Old Testament Moses."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2752.53,"end":2781.84,"speaker":"Jonathan Pageau","text":"Yeah, Moses who came down with horns there. Yeah, exactly. That's a fascinating story. But so to me it's more like trying to get people to go back into a proper story. Like not the weird nationalistic story, but a story which has this space for the strange, but it also looks towards the altar, right. That it's not completely fascinated with the snake either. Because in my opinion that can be very dangerous because those monsters can also eat you. Like they really."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2782,"end":2852.33,"speaker":"Jf Martel","text":"Yeah, absolutely. That's the great hope, is that you're right about all this. It's like my hope is that it's our great hope. I agree with you. And I think that speaking to the importance of participation, which I think is really important, I think I saw you talk about this in a talk sometime how traditional art is participatory. So it invites. I think that's key. I think that good secular, I don't like to use that word secular, but let's say non traditional art. I even think that that's wrong. I think there's a tradition even in secular art. But anyways, like, yeah, in all art, there's a participatory call, there's a call to participate. I wouldn't want somebody to read me Moby Dick because it would take a week, but I love to be able to sit down and read it. I don't think the technology of the novel, although it's not an oral technology, still participates in of that. Yeah, there's something about that. So. And something's going on in that book. Of all books, I think that it's the closest I've read to kind of not profane, but secular scripture, in a weird way."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2852.97,"end":2900.42,"speaker":"Jonathan Pageau","text":"But there is. There is even in terms of, like, the idea of the monstrous, like the idea that the monstrous were in the ornaments in medieval manuscripts. Like, there was a relationship between ornamentation and the monstrous. There's also something inevitable about the secular. Like there's something about how Gauguin used to say he was a decorator. And I actually think that's a really interesting idea. Like he said, there's a role for ornamentation and this kind of. I wouldn't call it vain beauty, but a kind of a recognition of the sensual aspect of reality. But it's also a decorative. It's also decorative. Like it's something you do after. At the end of the day, right? It's like the rest."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2900.42,"end":2904.14,"speaker":"Jf Martel","text":"You need the house. You need the house before you can decorate it. So the house has to stay."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2904.46,"end":2907.02,"speaker":"Jonathan Pageau","text":"Exactly. You need the house. That's a good way to say it."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2907.02,"end":2908.14,"speaker":"Jf Martel","text":"Can'T be built on sand."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2908.14,"end":2909.84,"speaker":"Jonathan Pageau","text":"Right? So."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2909.84,"end":2933.2,"speaker":"Jf Martel","text":"But about the participation thing that there's a difference between. There are different types of participation. In sociology, they have a term, communitas, right? Which means, you know, when you go into a place and you feel like you're together with everybody, everybody's on the same page, on the same wavelength. There's this feeling of community that develops that suddenly, spontaneously appears."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2933.6,"end":2934.24,"speaker":"Jonathan Pageau","text":"It can go."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2934.24,"end":2987.73,"speaker":"Jf Martel","text":"It can be. There are different types. And the type of communitas that I've experienced in. In religion, in my own religious practice, which is Catholic, but it's obviously available in Orthodoxy, but also in, I would argue, in Buddhism and Hinduism, is that it gives you community. It's a community of aloneness, as opposed to a dionysiac fury maenad, like wild community of the pack or the herd. The Greeks talked about the maenads, which. The women who follow Dionysus and who would go into this nocturnal frenzy and, like, rampage through the woods and tear men to pieces if they found them, or animals, like just. Yeah, right. So that's communitas, too. That's a type of community. And the Greeks were willing to recognize that that existed. But of course, there was always the. How do we try to contain this."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2987.81,"end":2988.93,"speaker":"Jonathan Pageau","text":"Bit of a danger there?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2988.93,"end":2989.41,"speaker":"Jf Martel","text":"Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2989.73,"end":2991.65,"speaker":"Jonathan Pageau","text":"So the."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":2992.86,"end":3078.05,"speaker":"Jf Martel","text":"But the type of communidas I've felt in religion is very different. It's not so much that I'm with everybody here. We're all one tribe. It's more like we're together to the extent that at this moment we realize that we're all kind of alone facing this thing. And the call is being made to each individual personally. And I try to argue in my book that art is similar to that, that Herman Melville didn't write Moby Dick, despite what he thought, didn't write Moby Dick for a mass of people. I think he sold like a couple of thousand copies in his lifetime and died very poor. He wrote it for one person. And I think that the proper way to approach a work of art is to assume, because your guess is as good as anybody else, assume that that person was. You approach the book as though it was written for you. It was with that attitude when I read the Bible that I was finally able to understand what my religion had been trying to tell me all along. It's not about judging other people. It's about you and you're alone. And in the moment of communitas, in a proper. I would argue in a proper art context, communitas brings us back to our aloneness. And it's our aloneness that we share, not this kind of tribal, nationalistic togetherness that absolves us of responsibilities, individuals. Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3078.13,"end":3099.89,"speaker":"Jonathan Pageau","text":"Well, I would say that the Christian idea of love, it does in fact try to balance out the two extremes, like the idea of solipsicism or this kind of just single radical loneliness. And the fusion, this tribal fusion that you talk about in the."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3100.84,"end":3103.8,"speaker":"Jf Martel","text":"Yeah, I think I sort of get at it. Yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3104.28,"end":3160.2,"speaker":"Jonathan Pageau","text":"So in the Trinity, that seems to be what is expressed at the highest level. It's like a radical, radical union with radical separation. Right. So it's like there's no confusion between the persons, but they are completely one. And that seems to be what we're called to do as Christians. And the way that it reveals itself to us or the way that supposed to be lived is actually through self sacrifice. Like the way that I'm not alone is the way that I love others. So it's. No, it's not so much the what I get from others that makes me not alone. It's what I give and how I'm willing to kind of open and give myself to those around me. That is what connects me to them. And so it's a weird. It's like an inversion of the passionate party, like of the, you know, of this, of the rave, where everybody is all fused in the beat, but they're all there to kind of get as much pleasure as they can in that moment, you know?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3160.2,"end":3165.32,"speaker":"Jf Martel","text":"Right, right. No, that's. That's a very good point and I fully agree with that. Yeah, yeah."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3166.2,"end":3192.05,"speaker":"Jonathan Pageau","text":"Look, I think we've been going for quite a while. This has been a very interesting discussion. I'm happy that I finally talked to my. To my doppelganger. And it's funny because I didn't know that you were a Catholic. Like, I didn't even know that you were. Were a practicing Catholic. I just saw your talk about weird stuff. And I guess it makes sense then that you would be on the Makers and Mystic podcast, because I guess it's mostly a kind of like a Christian podcast, but."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3192.21,"end":3208.92,"speaker":"Jf Martel","text":"Yes, but Weird Studies is. I co host Weird Studies with Phil Ford, who is a musicologist at Indiana University, Bloomington, and he's a Buddhist. So we. We like to explore the in betweens of things. Right."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3208.92,"end":3209.92,"speaker":"Jonathan Pageau","text":"The strangeness of things."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3209.92,"end":3215.32,"speaker":"Jf Martel","text":"The strangeness of things. That's what gets me off. It's weirdness. What can I say?"}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3216.2,"end":3221.88,"speaker":"Jonathan Pageau","text":"So tell people where they can find your stuff. Like, do you have a website? Do you have a. Yeah, I have."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3221.88,"end":3252.65,"speaker":"Jf Martel","text":"A website that I haven't updated in forever called Reclaiming Art. The address is reclaimingartdark.com reclaimingart.com and weird studies. Weirdstudies.com is probably the best way to find me these days. That's our podcast that I co host with Phil Ford. And aside from that. Yeah, if you just. I've written a few things. You could probably track down some articles and essays if you're interested. And of course, my book Reclaiming Art in the Age of Artifice is available at all virtual bookstores."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3252.65,"end":3253.81,"speaker":"Jonathan Pageau","text":"All virtual bookstores."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3253.81,"end":3256.41,"speaker":"Jf Martel","text":"It's literally available in no single physical bookstore."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3256.41,"end":3256.97,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3257.21,"end":3258.41,"speaker":"Jf Martel","text":"Unless you pick them up outside."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3258.73,"end":3280.72,"speaker":"Jonathan Pageau","text":"And we're going to. And we're both actually going to be part of the Mystic Makers and Mystics event that they're doing in March, so people could stay tuned to that. There'll probably be some social media posting about it. And Jeff and I will both be speaking at that event and with question periods and stuff. Too bad that we're not in the same place. It would have been nice to meet you in person and to shake your hand."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3280.8,"end":3286.56,"speaker":"Jf Martel","text":"Well, we're almost neighbors, so once this all ends, this ridiculousness, then we'll be able to meet."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3286.72,"end":3289.84,"speaker":"Jonathan Pageau","text":"That would be great. That would be great. So thanks for your time. I appreciate it."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3290.43,"end":3291.15,"speaker":"Jf Martel","text":"Thank you so much."}
{"episode_id":"SW - #146 - 2021-03-07 - JF Martel - The Weird and the Sacred","start":3291.87,"end":3356.85,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
