{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":0.24,"end":59.61,"speaker":"Jonathan Pageau","text":"All right, everybody. And so I got Covid on the way back from Jerusalem, so I'm feeling a little bit under the weather. But since then, the video with Muhammad hijab has come out. And for me, that video was just another day in the week with Jordan. He asked me in the last minute to come and to participate. And now I'm seeing that it's creating huge amount of reaction. And I've received quite a number of emails from several people from all kinds of people, people that are angry with the way I reacted, people that are happy with the way I reacted, Christians that it felt like I didn't defend the Trinity enough, and Muslims who are apologizing for Muhammad hijab and saying that he is not a representative of any kind of Islam that they think is. Is intelligent. And so I thought maybe I'd give a few thoughts about the event and how. Why I was reacting the way I was."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":60.49,"end":60.73,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":61.45,"end":63.29,"speaker":"Jonathan Pageau","text":"Yeah, so let's. Let's do this."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":75.13,"end":78.57,"speaker":"Announcer","text":"This is Jonathan Pedro. Welcome to the symbolic."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":88.83,"end":131.66,"speaker":"Jonathan Pageau","text":"So the first thing to understand is this was not an event that I planned to do. Jordan invited me the day before. He said, why don't you come talk to this guy Muhammad Hijab? I didn't really know who he was, and so I went online, and all I found were videos of him in the street with masked men, you know, saying how they're gonna fight off whoever comes to get them. Videos of him in the street, you know, saying that if these Jews come out with their dogs again, we're gonna kill their dogs. Those are the videos that I saw of him. And so I was like, who is this guy and why are we meeting with him? There were a lot of people warning us. We went to dinner the day before, and there were a lot of people warning us, saying we should meet with him. And so, you know, whatever. You know, I'll do. I'll do whatever."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":131.66,"end":132.22,"speaker":"Jonathan Pageau","text":"I'm not."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":132.7,"end":133.54,"speaker":"Jonathan Pageau","text":"I'm not afraid."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":133.54,"end":134.78,"speaker":"Jonathan Pageau","text":"I mean, it was fine."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":134.78,"end":136.06,"speaker":"Jonathan Pageau","text":"We'll just go meet with this guy."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":136.06,"end":136.62,"speaker":"Jonathan Pageau","text":"That's fine."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":136.62,"end":172.75,"speaker":"Jonathan Pageau","text":"I've had stranger things in my life. So we went to meet him, and I realized very quickly in the discussion that all this person really cared about was converting us to Islam. He really did not want to have a discussion. He did not want to listen to what we were saying. He just wanted to convert us to Islam. He just wanted to convince us. And my understanding was that the purpose of the discussion was to talk about the place of Jesus in Islam and how there could be some discussion about that and see how there's overlap. You know, I think Jordan was hoping to find some common ground, but obviously that was not what was happening."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":172.75,"end":175.47,"speaker":"Jonathan Pageau","text":"All this person was doing was trying."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":175.47,"end":185.95,"speaker":"Jonathan Pageau","text":"To convince us of becoming Muslim. But that's not the only thing that was going on. There was another thing going on was that he really wasn't trying to convert us to Islam."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":186.51,"end":191.67,"speaker":"Jonathan Pageau","text":"He was trying to convince his buddies in the room that he was trying."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":191.67,"end":225.76,"speaker":"Jonathan Pageau","text":"To convert us to Islam. That's what was making the whole thing even stranger. Because when he started talking about what Christians believed, I had to laugh. I was just smiling, sitting there watching him, because no Christian would recognize themselves in what he was describing Christianity to be. No Christian would recognize themselves in what he was describing the Trinity to be or the Incarnation or anything that he was describing about Christianity. He was presenting to us the wildest caricature of what Christians believe. And."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":225.83,"end":230.03,"speaker":"Jonathan Pageau","text":"And then he was trying to mock it or refute it. And so that's when I realized that."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":230.03,"end":232.63,"speaker":"Jonathan Pageau","text":"He really wasn't even talking to us."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":232.87,"end":238.59,"speaker":"Jonathan Pageau","text":"He was talking to his fellow Muslims, trying to gain clout and trying to."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":238.59,"end":245.59,"speaker":"Jonathan Pageau","text":"Make himself more important by proving to them and showing to them that here he was, he was the tough guy."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":245.59,"end":247.71,"speaker":"Jonathan Pageau","text":"Muslim, and he was going to, you."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":247.71,"end":249.47,"speaker":"Jonathan Pageau","text":"Know, tell us about what Islam is."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":249.47,"end":251.51,"speaker":"Jonathan Pageau","text":"And it was going to convert us to Islam."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":251.59,"end":262.69,"speaker":"Jonathan Pageau","text":"So how do you react to something like that? You know, how can you sit there for two hours and look someone in the eye and realize, realize this person isn't engaging with me at all. This person isn't listening to me or."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":262.69,"end":264.45,"speaker":"Jonathan Pageau","text":"To Jordan or to anybody."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":264.45,"end":268.01,"speaker":"Jonathan Pageau","text":"He's not even actually trying to communicate."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":268.01,"end":279.89,"speaker":"Jonathan Pageau","text":"Anything in a way that he's hoping that will connect with me. He's just trying to open the valve and just shoot out his prefab arguments."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":279.89,"end":283.69,"speaker":"Jonathan Pageau","text":"And his prefab arguments in our faces."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":283.69,"end":285.49,"speaker":"Jonathan Pageau","text":"Until the conversation was over."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":285.49,"end":303.28,"speaker":"Jonathan Pageau","text":"And so, to be honest, I was just sitting there going, what are we doing here? Like, what is happening? And so I didn't say much because what was I going to say? I was I going to start arguing with this guy about the Trinity? I mean, let's be honest, after the discussion, when we were having lunch, I."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":303.28,"end":305.8,"speaker":"Jonathan Pageau","text":"Provoked him a little bit. I said, you know, Muhammad, the version."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":305.8,"end":307.48,"speaker":"Jonathan Pageau","text":"Of the Trinity that you proposed to."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":307.48,"end":308.96,"speaker":"Jonathan Pageau","text":"Us was quite a caricature."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":309.04,"end":319.8,"speaker":"Jonathan Pageau","text":"And he said, of course it wasn't a caricature. I took it straight out from the Apollo's Creed. And I was like, really? Okay, you know, it's like, I guess we're getting our theology from Rocky II."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":319.8,"end":321.36,"speaker":"Jonathan Pageau","text":"Now, but But I mean, I get it."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":321.36,"end":323.32,"speaker":"Jonathan Pageau","text":"Look, I'm not even criticizing him."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":323.56,"end":325.48,"speaker":"Jonathan Pageau","text":"I don't know that much about Islam."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":325.48,"end":327.12,"speaker":"Jonathan Pageau","text":"And so, you know, I probably would."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":327.12,"end":331.2,"speaker":"Jonathan Pageau","text":"Be making those mistakes as well if I was trying to kind of preach."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":331.2,"end":333.36,"speaker":"Jonathan Pageau","text":"To Muslims and trying to convert Muslims."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":333.36,"end":337.28,"speaker":"Jonathan Pageau","text":"But as you notice, I don't do that because I don't feel like I."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":337.28,"end":338.96,"speaker":"Jonathan Pageau","text":"Know enough about Islam."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":338.96,"end":344.04,"speaker":"Jonathan Pageau","text":"All I try to do is try to present the things that I've understood and the things that I have intuitions."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":344.04,"end":346.12,"speaker":"Jonathan Pageau","text":"About, and that's what I'm interested in doing."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":346.6,"end":348.04,"speaker":"Jonathan Pageau","text":"But so if you want to understand."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":348.28,"end":349.92,"speaker":"Jonathan Pageau","text":"Why I was reacting the way I."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":349.92,"end":351.96,"speaker":"Jonathan Pageau","text":"Was, that is what was going on."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":351.96,"end":355.96,"speaker":"Jonathan Pageau","text":"Now, if you want to talk about the Trinity, I am not the greatest expert on the Trinity."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":355.96,"end":365.4,"speaker":"Jonathan Pageau","text":"I've actually said that many times. But I understand enough about the Trinity to think that it is not the ridiculous caricature that was presented to us."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":365.64,"end":367.52,"speaker":"Jonathan Pageau","text":"So maybe we can just talk a."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":367.52,"end":373.85,"speaker":"Jonathan Pageau","text":"Little bit about why the Trinity is so important for Christians and why the Incarnation is so important for Christians and."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":373.85,"end":377.77,"speaker":"Jonathan Pageau","text":"Maybe can help some people understand. I don't know. I mean, it seems like the things."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":377.77,"end":378.85,"speaker":"Jonathan Pageau","text":"I'm going to say maybe are going."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":378.85,"end":380.97,"speaker":"Jonathan Pageau","text":"To be completely obvious to Christians and."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":380.97,"end":388.61,"speaker":"Jonathan Pageau","text":"I won't be even talking to anybody because I'm pretty sure that the Muslims that are on Muhammad Hijab's side won't be watching this video anyway."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":388.61,"end":389.41,"speaker":"Jonathan Pageau","text":"So let's do it."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":389.41,"end":393.33,"speaker":"Jonathan Pageau","text":"We'll see what happens. And so the question about the Trinity."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":393.97,"end":395.57,"speaker":"Jonathan Pageau","text":"The question about the Trinity has a."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":395.57,"end":431.96,"speaker":"Jonathan Pageau","text":"Lot to do with the problem of duality and the problem of how is it that God can have a relationship with us. In Christian terms, what is mostly worried about or what we care about is the question of whether something is created or uncreated. And so we have this sense in which God is uncreated. He is not made, and his existence is not dependent on anything. And then we have creation which is made and whose existence is dependent on the infinite is dependent on. On God, who is the source of all things and of all being. And so these are the two categories."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":431.96,"end":433.16,"speaker":"Jonathan Pageau","text":"That we deal with now."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":433.16,"end":1079.69,"speaker":"Jonathan Pageau","text":"So when we ask ourselves what is God, or what aspects that we see in Scripture, in revelation that is God, what we're asking ourselves is what is created and what is uncreated, what is not created? And the conclusion to which the church fathers came to is that the word by which God created the world, the one that is presented in Genesis 1 and that is presented also in the first book of John, is not a creation. It is God himself. It is God's word. It is not something that God made. It is not a creation. It is God's word. And that God's Spirit, which we see in Genesis 1, that the Spirit that hovers above the waters, the Spirit of God, is God's spirit. It is not created. It is not something that God has made. It is an attribute. It is something which is related directly to God. Now, of course, the way to formulate it, I can understand why some people find it difficult because some of the terms are obviously technical, because we're trying to talk about something which is very, very difficult. But nonetheless, the problem that you have with the problem of monotheism or the problem with the God is that if you're not careful with, you're going to end up having. And so imagine that you say when God speaks his speech, his word is created. It is no longer God. As soon as God speaks, it is no longer God. As soon as God extends himself into the world, then it is no longer God. And so what you have is you have this divide that is so radical between God and the world that there is no possible relationship between God and the world. And that is not just a problem in terms of terms of, like, let's say, sentimentality, in terms of thinking, like, okay, so God creates us and we have no relationship with Him. It's actually a more technical problem, which is that, where is the world then? Where does the world exist? Did God create something completely outside of him? So now there's God and there's this thing creation, which has a completely separate existence from him. Well, no, I think that even Muslims would believe that the world is dependent on God. But in what way is the world dependent on God? How is this dependence possible? And the manner in which that the Christians have seen in the revelation of Scripture and in the revelation that they've gotten from God, is that the Trinity is the manner in which God appears to us as love, and that this love is that which fills the world. And so the orthodox, for example, go even further than just the Trinity. We say that the God's energies, that is that the actions of God in the world are God. They are not created. And so underlying actually all of creation are God's energies, which are God himself, which are not a diminished version of God. They're not like a lower form of angel or a lower form of being, but they are God himself. And so this, what it does is that it means that Christianity is ultimately an extremely mystical form, form of religion. It means that Christianity is a religion in which the very existence of the world is shimmering with the presence of God. Everything that exists has a spark hidden behind it or inside it, which is God himself. And it doesn't mean that things are Gods. Nobody believes that. It doesn't mean that objects in the world are God, but that underlying the cause of all things is this divine spark, the action of God behind it. And the Trinity has that same aspect. It means that when God pours himself out into the world, it is God that is pouring himself out. It is not some lower form of God. It is not like in the Gnostic systems where the world is created by a lower form of God. What that does is it creates this strict, strict, strict hierarchy where beings, the lower they are, the further they are from God, the less they have, you know, the less ontological existence that they have and the more they are evil. And so often in these, in a lot of systems where they're not able to create a bridge between God and the world, like what is the bridge between God and the world? For a lot of the systems that can't find that bridge, they have the problem of understanding the world as fallen or the world is evil in itself because it's not connected to God. How is it connected to God? And so one of the aspects that the Trinity does is that when God speaks, it is not a lower, lesser aspect. It is not something which is away from Him. It is God himself that speaks and his Spirit. That is that movement out from God and back into God, right? This movement out and back into God is God himself. And so sometimes it said something like that God speaks and his speech is God. And even the space between his speech and himself is God, right? His Spirit, which binds his speech to himself is God. And so Christians believe that there is only one God, God the Father, but that his Word is fully, fully, fully God. But it's not also. Can I say this? So we say it's a specific hypothesis because we also see that multiplicity. How does the multiplicity exist? One of the same problems is that one of the problems of seeing God as a full monad and seeing, for example, his characteristics as lesser than him, is you have the same problem. You always have the same problem of creating a world which is in some ways evil or lesser or, you know, that isn't in any ways connected to God. And so by having three hypostases or three, it's hard to find a word because as soon as you use a word, we say three persons. But of course, these words are analogies. They're not if you. If you use a person the way that you understand it now, and you've tried to limit it to that, you have to use it as a kind of springboard to understand. To understand the more of God. But the notion that there are three persons, you could say something like mediates the space of God. I don't know how else to say it mediates the space of God. That is, God gives his divinity to the Son, gives his divinity to His Word in His Spirit. And so the Word is different from the Father. It's not the Father, but it is fully. The Father has fully given all of his divinity into the Word. And so what it does is it mediates the difference between God and creation. Ultimately, it makes it possible for multiplicity to exist. Because it is not an easy question to understand how is it that multiplicity exists? If we understand a kind of absolute unity and absolute multiplicity in God, then the problem goes away. And it's not a multiplicity of contradiction. It's a multiplicity in love. It's perfect. Love is the best way to understand the nature of God as Christians understand it. What it does is it gives reason and it gives vision for why the world exists and how it exists. Now, the best thing you can get, I think, if you don't have a sense of this in your theology, is that all we exist for is to worship. That's all we exist for. And to be honest, I've seen Muslims say that it's like you exist to worship. That's your job. Get on your knees and worship. And it's interesting. And you can see how in Christianity, at least the Christianity that I care about, we are meant to worship God. Of course we are meant to worship God, but that in that worship, God calls us to participate in him, that our ultimate goal, our ultimate resting place, is to be united fully and completely with God and to even become deified to the extent that that's possible. And that is actually the reason for creation. And so God, in His absolute unity and absolute multiplicity, has this outpouring of love out of which creation is made. And then this call back into Himself, which is this vision of how all things can be full, full, full of God and be transparent and glorious in the finality. And so, I mean, that is why the Trinity is. Is so important in Christianity. And it's not a. It's not a detail. It's not something that we should. I know some Christians sometimes are ashamed of it and kind of shy away from it, but it is extremely important to Understand the problem of believing in multiplicity and what it means to have only one God and multiplicity without something which mediates that multiplicity. It's very, you know, like I said, you're going to have some issues in justifying all that. But the thing that was interesting for sure in that discussion and the reason why, to be honest, in the end, I wasn't really angry. I was just kind of surprised as I found myself in a situation that was similar to the situation that I grew up in, which is that I grew up in certain circumstances, not everybody. I've said often that it wasn't like that in my family, but I'd say in the churches I grew up in. And some people that I still care about very much today have this attitude of looking for every opportunity to evangelize you. To look for every opportunity to give you the message in a way that is at some point even, I think, destroys the relationship or ignores the true relationship that can exist between two humans. You know, I remember when I was young, even hearing someone when I brought up the fact that God says to love our neighbor, that the answer was yes, to love your neighbor is to evangelize them. That is how you love your neighbor. And so it's something that I've known quite well, that I known quite well my whole life and that I grew up with. And so, you know, I just felt like I was sitting in that moment again. And to be honest, there's no way that I was going to engage in the kind of debate in a situation where the person in front of you is not listening to you in any way and really doesn't. Doesn't want to know what you think, just wants you to listen to their preaching. And so that's that. And so I hope this was helpful to maybe help people understand a little bit, you know, why it is that I reacted the way that I did and sorry for my Covid voice here. Hopefully I'll be better next week and. And we'll have less scratchy videos. So thanks everybody and I'll talk to you very soon."}
{"episode_id":"SW - #259 - 2022-10-24 - Responding To The Mohammed Hijab Video","start":1079.93,"end":1114.72,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes."}
