{"episode_id":"SW - #022 - 2018-11-19 - The Symbolism of Christmas - The Ass and the Ox","start":0.4,"end":65.65,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to episode 22 of the Symbolic World podcast. On this episode, I'm going to play for you a video that I put up last year on the symbolism of the ass and the ox in the Christian tradition and how something which might seem on first hand as being rather unimportant and a detail can in fact show us a very deep pattern and can also show us the manner in which extra biblical content in the Christian tradition, how it functions and how it serves to help us see things which are already there in the tradition, but might be a bit obscured by our own incapacity to see them. And so this is a short episode. The video is only about 12 minutes, but I think you'll enjoy it anyway, so enjoy. Jonathan Peugeot, welcome to the Symbolic World."}
{"episode_id":"SW - #022 - 2018-11-19 - The Symbolism of Christmas - The Ass and the Ox","start":75.81,"end":746.14,"speaker":"Jonathan Pageau","text":"Well, Christmas is coming fast and I wanted to use this time to explain how tradition works and how it can help us understand symbolism. What I want to do is look at the traditional icon of the nativity of Christ, focus on a few elements there, especially the elements which are not present in Scripture. I want to look at the ass and the ox, as well as the idea of the cave in which Christ was born. The details of the birth of Christ in the Gospels are actually pretty sparse. And so many of the details of how we perceive the Christian story actually come from tradition. For example, the Bible doesn't say that there were three magi, it just says that they were magi. And even though many modern Protestants have been hostile to a non biblical tradition, these traditions persist nonetheless, and we'll look at why they do and maybe how that works. One of the traditions that has persisted since the beginning of Christianity has been the notion that there is an ass and an ox present when Christ was born. At first, this might seem like a nice sentimental addition to the story, let's say, of how cute it is, or maybe just a boring admonition that since it says that Christ was laying in a manger, that is an animal food trough, well then there must have been animals. By the way, the Bible doesn't say that Christ was born in a state stable, it just says that he was laying in a manger. But we'll get to that. The addition of the ash and the ox is actually the most persistent element in the visual representation of the birth of Christ. After the actual Christ child laying in a manger, there are very early images where all that is shown is Christ with the animals to signify his birth. So why is this? Well, there's a prophecy in the book of Isaiah, which says the ox knows his owner and the ass his master's crib. But Israel has not known me, and my people have not understood. So, of course, we're so used to, you know, using the word crib to mean a baby's bed that we don't realize that a crib is a manger. A crib is a feeding trough for animals. And even though the detail of the ass and the ox isn't there in Scripture, what it does is that it will add some connections, connections in the pattern which will help us understand what this moment means, what the Incarnation means. Early Christians were soon to point out that the ox and the ass were two different types of animals. The ox was a pure animal according to Old Testament purity laws, and the ass was an impure animal. And so having them come together at the manger signifies the ultimate unity of those opposites, a place where the separated things can come together. Continuing the analogy for writers, early Christian writers as early as Origen, the ox represented the Israelites and the ass represented the foreigners. And bringing them together was the image of how Christ and the church had united the inside and the outside, the Israelites and the foreigners. Like I discussed in my video on purity laws, there is a law in the Old Testament which prescribes yoking an ass and an ox together, that is bringing together the pure and the impure. And in a very powerful way, Christ becomes the place where that is nonetheless possible. And the fact that this happens around a manger is very important because the place where that happens for Christians is also in the food of communion. Look at the manger in the traditional icon. What does it look like? It's a pretty fancy manger, isn't it? The reason why it looks like this is that it's also supposed to represent a tomb, a sarcophagus, actually. And so already showing that the incarnation of Christ is an entry into death. The swaddling clothes are also the linen wrappings that were going to cover the body of Christ. So, for example, here is a traditional icon of the finding of the empty tomb where Christ was laid. And you can see the sarcophagus, and you can see the empty wrappings, and you can see visually the relationship that would be found between the way the manger is represented and the cloth and the way the tomb is represented in the cloth. So in the icon, the beginning of life is connected to death. The place of Christ's birth is represented as a cave. This is a very old tradition, one that is attested to in the 1st century in Justin Martyr. Like I said at the beginning, the Gospel does not tell us where Christ was born. But when you imagine it, when you represent it, there has to be a place, right? And by having that detail of the cave, it's not just a random detail which adds some idiosyncratic tidbit to the story. Rather, the cave helps us to understand what the Incarnation is. It adds a detail to help us see something which is already there, implicitly in the notion of the manger, the lowest place imaginable, you could say. And so the cave with the mother of God, Mary, lying next to Christ emphasizes this entry into earth, the life of God entering into the lowest place, into the opening of the earth, connecting the highest with the lowest. It's similar to how God, in creating man, blew spirit into the nostrils of Adam as he was made of earth. I mean, of course, the Incarnation is at a whole different level than the first creation of man, but the pattern is there nonetheless. This is also the link to communion. Communion is very many, many things. Of all the elements of the Bible, communion is probably one of those things that are inexhaustible in their implications. But one of the implications of communion is the joining of pure and impure. For although it was common for people to eat bread and to eat meat, to eat flesh, it certainly was prescribed to drink blood. And in the case of human blood, even the coming in contact with human blood made one immediately impure. Drinking in blood was unacceptable because the blood was supposed to go down into the ground, poured into the ground. But Christ has united the ground with the sky, united earth with heavens. Now, there's another verse to which Christians refer to when explaining why there was an ass and an ox at the manger with Christ. And it's a prophecy in Habakkuk which says, between two beasts you are made manifest. Now, this verse in Habakkuk is completely lost to us. If you try to find it in your Bible, you will not find it. For it's Based on the 70 version, the Septuagint tradition of the Bible, which for most of us today, we don't have access to, but you see in a way that doesn't matter. What we need to see is the pattern. The notion that Christ would appear between two beasts makes absolute sense. It makes sense symbolically as the union of divisions, the union of the division which is flesh. Think, for example, of the seemingly crazy ritual that Abraham does with God where he separates these carcasses in two, right? And then God passes through the middle of these separated carcasses but think mostly, for example, at the image of the Ark of the Covenant, the box on which was made the manifestation of the glory of God. Well, that box had two beasts, two cherubs. We represent them as pretty little angels today. But if you look at what a cherub was in the Old Testament, it was actually a hybrid beast, a mix of a lion and a bird and an oxen and a man. And God manifested himself in the center of those two borders, of those two extremes. Now look again at the manger in the icon. Is it a manger? Is it a sarcophagus? Is it the Ark of the Covenant with the two beasts between which God showed himself? One must remember that in the Ark of the Covenant was placed the manna, the bread of heaven, which was given to Israel in the desert. So the Ark is also a container for food. So you see, the traditions that are added, the ass and the ox, the cave and other details are not arbitrary. They're there to focus on, to give us one more hint of the implications of this moment when God united himself to man. And all of the imagery of the Nativity is to show us that this point, this child in this manger, is a union of the very lowest with the very highest, that it is, in fact, the center of the cosmic mystery laying there, a child, life, death, union of pure and impure, the star and the cave, the wise, three kings and the lowest of shepherds. Right? All these traditions woven together to show us as much as it's possible for us to see what the center of all things looks like, what that logos is. So I wish you all a wonderful Christmas later this month, as hopefully you're able to remember, you know, in the darkest moment of the year, when the sun is at its lowest of that hidden flame in the cave, the logos rising out of darkness to fill the whole world."}
{"episode_id":"SW - #022 - 2018-11-19 - The Symbolism of Christmas - The Ass and the Ox","start":748.22,"end":804.14,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos, strangely, you can go there and you can support it at any amount that you want a month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
