{"episode_id":"SW - #175 - 2021-09-19 - The Symbolic Structure of the Beatitudes","start":12.56,"end":1087.62,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So one of the things that I've mentioned many times is that if we understand Christ as being as the top of the hierarchy, we get a good glimpse of what he is doing, but we don't get all of it. We need to understand Christ as filling up the entire structure, symbolic structure, you could say, filling up the hierarchy of reality. And so I wanted to look at the Beatitudes, specifically the Beatitudes in the book of Matthew, and show you structurally what is going on. Of course, I'm not going to go into all the details of the attitudes, and I'm actually not going to look at it in terms of an ethical question or a moral question, but we're going to look at them structurally and see how they kind of manifest the symbolic world that we've been talking about for all this time. So just like a good movie, the Beatitudes that's presented in Matthew, you really get the beginning of the Beatitudes. The beginning of this, of the text, is what will set up a little microcosm which will help you understand everything else that is going on in the text. And so in the first statement, we will see, let's say, there will be a layout of the structure, and then the rest of the text will flow from that layout. And so it starts, of course, in Matthew 5, and I'm reading from the King James Version, but in this case, it doesn't really matter which version you're reading from, because we're looking. We're not looking at subtle theological detail, let's say. And so talking about Christ, it says in Matthew 5, and seeing the multitudes, he went up into a mountain, and when he was set, his disciples came unto him. So basically, if you understand the Beatitudes, it's all right there for the first thing that we see is he sees the multitudes, okay? And so you have this mass, let's say, mass of people, this group of people that are not really a group. They're the multitudes. They're the mixed multitudes. They're kind of frenetic multiplicity. That's what he's seeing. And so he sees it. That's the problem, let's say. I've always talked about how reality always manifests itself as problem and answer. And so this is what he sees. He sees this multitude. And so he goes up into a mountain. Then it says, when he was set. I think it means that when he sits down. So he sits down on the. Imagine it in your mind. You know, the Imagine like a really nice mountain. And then Christ sits down at the top of the mountain, and all of a sudden he's at the top of reality. And he and his disciples come unto him, and so they gather around him. And so now we have already have the difference between the multitude and though the disciples that gather around him as he is now at the top of the mountain, standing at the top of reality. And it's from this point, from the top of reality, like the law coming down from heaven, that he opens his mouth. And now he speaks. And so what Christ is going to say is going to manifest this mystery, the mystery of how Christ being at the top of the mountain, but also going down, all the way down to the bottom of the mountain. Or you can understand it that he. His teaching goes all the way down to the bottom of the mountain, like Pentecost, which goes all the way to the edge of the earth. You know, like him descending into death at the crucifixion, you. You get a sense in which he goes down and gets the fish at the bottom of the water. You know, the light shines in the darkness. And so in. In here you'll see that there's an aspect of the darkness that doesn't know him, but there is an aspect of the darkness which recognizes Him. There's an aspect of the darkness, of the little fish that are shining in the water, which. Which will recognize the light coming from above. Okay? And so this is what he's going to say. He's going to say, what is it at the bottom? All this multitude is there at the bottom, and I am the divine Logos at the top of the mountain. And so as I speak, I'm going to tell you how, what is it at the bottom which can receive or. Which will recognize or which will receive the light and will recognize the light. And so this is what the Beatitudes are about. And they can help you understand how reality is connected together. Okay? And so you'll see how in the. The text, he moves from the top to the bottom and how he shows the connection between the top and the bottom, okay? And so he says, blessed are the poor in spirit for their. For the. For theirs is the kingdom of heaven. Now, right now you can see what he's doing. He's saying, those that are poor in spirit, those that are low down on the hierarchy of materiality, you know, but are poor in the Spirit. That's a good way of understanding it. There are obviously other interpretation, but in this, this case is to say that you're poor, but you're in. You're in the spirit. You're down there at the bottom of, let's say, this kind of material reality. But you're. But you have. You're in. You're in the spirit. Being down there, then the kingdom of heaven is yours because that's where you are. You're at the bottom of the mountain. And so you're not. You receive the kingdom of heaven and you manifest the kingdom of heaven. And so you could say it that. If we go back to the first verse, he's saying something like, those that are poor in spirit, out of the multitudes, they're the ones who will be those disciples that come unto me. Those will be the ones that will be gathered together and become a kingdom. Which. Which is united by the light, by the Logos, which is coming from above. And so then he continues, and he keeps showing things that are down there, below of the hierarchy. And he connects them. He shows how they can be connected to the top. And so he says, blessed are they that mourn, for they shall be comforted. And you have to understand the comforting coming from above. Once again, the comforting is akin to the. The blessing is akin to this kingdom of heaven which is. Which is coming down to those who are weeping below. And you can understand it that they're mourning out of compassion. They're mourning out of love of others. And so that's what mourning is. It's the idea that if you mourn and if you are sad for others, then you will receive the kingdom of heaven. You'll be comforted. That is how we are gathered together once again. That's how we become a kingdom. You. If we mourn for one another. And so again, blessed are the meek. The meek is the same thing. Blessed are those that have the capacity to act, but don't act against others that have, let's say, the power, because they're at the bottom. They have this power, but they don't use it against their neighbor. Then they are the ones who will become a kingdom. They're the ones who will join together into a unity. And so again, now you have this, the image of being hungry. So being poor, being sad, being hungry, all these things that are negative in the sense that they usually represent someone that is below the hierarchy. But he's saying, those that are hunger, that are hungry and thirsty, but that are hungry and thirsty after righteousness, well, they shall be filled. They will receive from above. Righteousness will come down from above for them. Blessed are those that are merciful, for they shall obtain mercy again, mercy, mourning, all of these things, you know, meekness, and they're all related. You can understand how being merciful to your neighbor and being meek in the sense of not acting against him. These are the ways in which, you know, if we forgive each other, these are the ways in which we will cohere. If we don't forgive each other, if we hold things against the those around us, then we will become the multitudes that he talked that we see at the beginning. We will just be a bunch of points that aren't connected together in love. And so we will not be able to cohere as a world. And so it continues. Blessed are the pure in heart, for they shall see God. So this is a very powerful image. This is really like a cosmic image. You can understand the heart as this point which is in the mountain or below the mountain, you know, imagine now the image of the birth of Christ, where he is this small child which is in the manger. He's in the heart of the mountain. And so those that are pure in their heart, those that are that so think you have to understand. He's showing things that you can imagine are normally seen as negative in the sense not pure in heart, but in the sense of. He's saying, basically, if you don't have. If your heart is not attached to things, if your heart is not attached to the things that are down below there, then it will be available to receive the light from above. And so don't be attached to the things that are next to you. You will receive the light from above and of course, related to all those other things. If we all do that, then, and we all do the other things that he's saying, then we will also cohere. We'll become a body rather than a multitude. Blessed are the peacemakers, for they shall be called children of God. Obviously, now all of these just are. Hopefully I don't even have to explain them to you, that all of this makes sense, right? If you make peace, you'll become a child of God. But see how he's always showing this hot above and below. He's always saying, if you are in a certain way at the bottom of the of reality, it will actually make you receive from above the light, the word, and will help you cohere and become a body. And this is of course, blessed are they that are persecuted for the sake of righteousness, for theirs is the kingdom of God. And so this one is tougher, is harder to understand. But you have to understand it in relationship to the image of the pure heart. Let's say that is, if you look up and you see righteousness coming from below, you see the light coming from below. Right? Right. And you, you're attached to truth, you're attached to the good, you're attached to all these things. And then there are those that around you that aren't those people will not be happy with you because they, they will notice the difference between you and them and the way that they're acting in the world. And so therefore they will tend to hate you. And of course, when it says this, it's related to this image in the Gospel of John where it talks about how the light comes into the world, but the world does not know. And the world, there's an, There's a negative world, let's say the fallen world, this world that is all out for themselves, that is, that is breaking apart, that is, that is tyranny and chaos. Like these two excesses, that world will not accept those that receive righteousness, that receive righteousness from above and are able to act in accordance with that righteousness. So those that participate in the kingdom of heaven will find enemies in those that want those extremes, that want either the kind of extreme of tyranny or this extreme of chaos. And those people will persecute you. And that, that will happen especially, especially in this moment before the body was. Was if, before the body was strong, let's say in the Church. But it's still per. Even in the Church, it continues like the church always has this aspect of the world which it can't, sadly can't completely get rid of, but hopefully it is kind of exercising in time. And so again the same, you know, blessed are you when men hate you, when they persecute you and they say evil things against you falsely for my sake. And this is of course, again, this is not just that men hate you and persecute you. Of course, this is not what it's saying. It's that they hatred, persecute persecution, persecute you for the sake of your attachment to heaven, of your attachment to the Divine Logos, of your attachment to truth, of your attachment to Light. And when men hate you because of that, then you should rejoice, right? You should rejoice and be exceedingly glad because your reward is in heaven. Your reward comes from above. It doesn't come from receiving the glory of that which is at the level where you are. It comes from above. And, but, but ultimately that reward which comes from above will also look like a communion of love, will look like the disciples that come unto him that Christ mentioned at the beginning of the text. And so it was just. I just wanted you to be able to see how the. All the Beatitudes are about showing how Christ fills the hierarchy from all the way to the top and all the way to the bottom, and shows us how it is in the aspect of ourselves, in ourselves, how we can. Being below God, right? Being below him, how we can be the way that we can become the type of potential that is able to become a body, right? So the type of potential that is not the kind of angry chaos or the, the. The bitter waters that are the, you know, that are incapable of, of participating in life, but that the bitter waters, this is how you could say the miracle in the desert, where the bitter waters become the sweet waters by the cross. It's like Christ is telling us, this is how you become the sweet waters. This is how you become the productive waters, those that can be used to bring life into the world and those that can be used. So how can you be a body that is coherent and functions together? Now it's really important to understand that we also have to understand that this teaching of the Beatitudes is not the totality of Christ's teaching. And so we have to be careful because there is a way in which we also then fractally will play the role that Christ is playing towards us. And this is, you can understand the rest of some of the things that Christ is saying as saying, okay, so this is how it works, right? For the. Here's how the top relates to the bottom. This is how heaven is an image of that which gives, which gives blessing, which gives coherence, which gives, you know, the possibility of the body to come together, which separates you from the evil and from the. The chaotic waters of the world. And now you have to play that role as well into the world. So it's showing you the positive aspect of hierarchy and how hierarchy works properly. So that's why right after the Beatitudes, Christ says things like, you are the salt of the earth. You are the light of the world. A city set on a hill cannot be hid. So now he's putting you at the top. He's saying, you are the light of the world. You are also like me. If you do these things, if you become this image of that which is below and coheres together under God and becomes a body, then you will fractally become little Christs and you will become the light of the world. And you will have, and you will Create this light. You will also participate in this light which goes down into the darkness and coheres darkness into bodies. And so that's why all the images after that are about, you are the light now. So you, you know, it talks about you light a candle, you don't, if you light a candle, you don't hide it, but you put it up on a candlestick and then it give light unto the house. So this image of light at the top of the candle, which now lights up this space, lights up the house, is the same image of Christ sitting at the top of the mountain, seeing the multitudes and speaking, so that his disciples come unto him and cohere around him as a body. And so, I mean, I could keep going and show you the, the, the show you the, the different aspects, but I just wanted you to show, help you see first of all how the Beatitudes are, this showing of how Christ fills up the hierarchy. Then also how the part which comes right after is there to fractally manifest how if you become this, if you lower yourself in relationship to Christ, if you break down your attachments to all the chaotic things and you rather look up, then you will be the type of person which will cohere into a body, and then in that body, you will fractally act the way that Christ is acting unto us. And so the hierarchy will repeat itself at all the different levels of reality. And that is basically, that's how the world exists. That's how the world holds together. And so, of course, there would be much more to say about the Beatitudes than that. But I was hoping that this kind of little meditation on Beatitudes can help you continue to read the Gospels and read the Scripture and see how it is completely coherent with the narrative right from the beginning of Genesis. And all the narratives that kind of show this, this embody the symbolic structure. Christ is also doing that in a way, in a very surprising way, in a way that heals the world, that saves the world, that shows us how the world can cohere and come together in love. And so, so I hope this was useful to you. Thank you for your attention. I know a lot of you are waiting for my video on Mark of the Beast. I would just tell you to be patient on that because I, I. There are still a few things that I, I need to understand and I need to get right before I talk about this, because it is tricky. It is because it's dealing with contemporary phenomena, it's dealing with kind of political situations. And I definitely don't want to misspeak and say something irresponsible and so, so, so be patient. It'll be worth your wait. So thank you for your attention everybody and I will talk to you very soon."}
{"episode_id":"SW - #175 - 2021-09-19 - The Symbolic Structure of the Beatitudes","start":1088.73,"end":1153.58,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
