{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":0.16,"end":62.09,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com as you know, over the."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":62.09,"end":161.65,"speaker":"Jonathan Pageau","text":"Years I've had many conversations with John Revecki and this summer I'm very much looking forward to it. In August 22nd to the 24th, we are going to be in Chicago together with Paul Vanderklee and some other speakers for Midwestuary continuing the discussion about how is it that that supra, personal beings can't exist. And so it's going to be very interesting and in this conversation is in some ways the preparation for it, talking about the way in which, you know, the way in which beings come to exist, how multiplicity joins together into unity. And also some exploration about some of the crazy things that have been going on in AI in the past few months and some of the promises and, you know, some of the strange stories that have come out of it and how, you know, how is it that we can understand these questions. And so I think it was one of my best conversations with John. There's some interesting things happening in his own life, transformations and ways in which he's coming closer. You know, in some ways right now he's on a pilgrimage trying to reconcile himself with God. I was there with him in Istanbul last week filming, we filmed in Hagia Sophia. We filmed in the different ancient churches there. Talking about Saint Maximus but also about, you know, an understanding of Christian ontology. And so it's been an Interesting few years getting to know John, and this is an interesting step along that way. And so please enjoy. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":171.8,"end":281.86,"speaker":"Sam","text":"Hello, everybody. Welcome to another episode of Transfigured. I'm here with Dr. John Vervaeke and Jonathan Peugeot. And before we get going, I want to announce The Midwestuary Conference 2025 in Chicago, Illinois, although technically Elmhurst, Illinois, a suburb of Chicago, from August 22nd to 24th, 2025. The theme is Fellowship of the Spirit. This is carrying on after a couple conferences that we've had. There's been a conference in Chino, a conference in Thunder Bay, and these are sort of conferences related to this little corner of the Internet. If you like listening to John or Jonathan's stuff, then I'm sure that this conference would be right up your alley. We, we are hoping to have a really good balance of, you know, giving our main speakers some time to talk. Our main speakers are Paul Vanderklee, Elizabeth Oldfield, J. John Vervaeke, Jonathan Peugeot, Kael Zeldin and Rod Dreier. But we also have a lot of time structured in for small group discussions in the estuary format, where you'll be put in an estuary group. It's optional, but it seems like so far 99% of the people who have signed up for the conference have opted in to be part of these groups. And you'll be part of the same group throughout the conference, getting to meet each other, discuss the things that you've heard in the various plenary sessions. And so a good balance of social interaction time in small groups, but then full group time listening to the main speakers and some social activities here and there. So you can go to midwestrade.com I'll have the link in the description to find out more. So anyway, thank you, John and Jonathan, both for coming this morning."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":282.9,"end":283.78,"speaker":"John Vervaeke","text":"Great to be here, Sam."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":283.78,"end":284.66,"speaker":"Jonathan Pageau","text":"Great to be here as well."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":285.15,"end":380.22,"speaker":"Sam","text":"All right, so the main topic that I wanted to discuss today is basically just the question of, since the conference theme is Fellowship of the Spirit, just what is spirit? And this is related to conversations that John and Jonathan have been having for like something like four or five years at this point of the nature of spirit, angels, intermediary beings, gods, hyper objects, as well as what does it mean for, you know, interacting with the spirit world? Is the spirit world, you know, this real kind of separate ontological thing, is it really just sort of a metaphor for how various kind of voices with inside our heads kind of use and act through us, but it's really just us are There do spirits actually have agency in themselves or is it just sort of a way of borrowing our own agency questions along those lines? And so I feel like this is something that you both have talked about for a while, but it's been a while, I think that I can tell since you last kind of talked about this subject. And I have a feeling that, I don't know, I think that maybe both of you might be in a slightly different place or ready to move the conversation further along than, than you did last time. So I think I'll pass it over to John Verveki to sort of respond to that and say anything that's been sort of on your mind with respect to this question."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":381.26,"end":719.32,"speaker":"John Vervaeke","text":"Yeah, a lot. So I guess the biggest thing since Jonathan and I talked about sort of Spirits and Angels is the encountering of the work of James Filler and then more recently and more, even more in depth, William Desmond. And a significant shift in my ontology, which I think is, I mean, Filler argues this and I think Desmond wouldn't disagree, is I think a more deeper recovery of the Neoplatonic tradition, which is, I'll just do it and I won't make the full blown argument. But the argument from Filler goes something like, you can't get relations out of rata and therefore substance ontology is fundamental mistake. His most recent book that I just recorded a conversation with him about shows that substance ontology seems to strongly imply, maybe even entail a nominalism that gets you into dualism and nihilism and things like that. Then I've ran an argument to James and he argues that the one in Neoplatonism is this ground of relationality. It's not a homogeneous singularity, which is how people frequently misrepresent the one, because single means there is one, there could be others, but there is this one. The oneness of the one is there is no possibility of otherness to it. It's a different kind of one. And so that's, I think there's something about that. But if you push into the Neoplatonism, especially the later Neoplatonists, post Iamblichus and also post Dionysus, you know, the two traditions. And I said this to James, well, I think you can make a similar argument that you can't get the relata out of the relations. And he was like, oh. And I say, you know, that's sort of what Zen says independently and convergently. And then I get into the work of Desmond. I just finished up a course on Johannes's Halkian on the God in the between. The philosophy of William Desmond Desmond is having a huge impact on me. But to put it in a gist, Desmond argues that the best image in the iconic sense we have for being is common unity, is community, in which relations and relata co emerge. And you can't ground, you can't make one primordial to the other. And I think one of the things I'm going to argue in Chicago is this. This ontology grounds community in a much deeper way. It grounds it deeply ontologically and not just socially, culturally or even historically. It's that, no, there's an iconic dimension to community. In that community actually is our best enacted icon of what being really is. It's the most like. And you see what I'm doing here, you know, Right. And so that, I think, is a significant difference. And then I now see that what we're talking about in fellowship, I think has this. I'm not denying there's a social element or a cultural element to fellowship. That would be really stupid. But I think what people are trying to get at when they're talking about the spirit of fellowship is this deeper ontological dimension of community. They're participating in something that has an ontological realness and depth to it. So that's sort of the fellowship part and what it's picking up on. And then of course on spirit, you know, and Sam, you did this. You know, the. My. My encounter ongoing relationship with Hermes. Some of the more recent work that Dan Chiappi and I have been doing post the work on the rovers about the irreducibility of a we point of view to multiple eye points of view. The. The irreducibility of we agency to I agency. Just one quick example. If you put people into prisoner dilemmas and they take an egocentric eye, they will game theoretic default down. But if they do, and human beings do, by the way, if they take a we perspective, a group agency, they will actually, they will move up to higher levels of mutual benefit within prisoner dilemma relationships. So there's a lot more about that. And then the work I've been doing with Greg Enriques about strong transcendence, a kind of extended naturalism in which there's an ontological kind of transcendence possible, takes the notion of self transcendence, that sort of paradox, and gives it some real ontological depth. Something really serious is happening in self transcendence and it's not just psychological improvement. I'm not denying that it is that, but it's not just that. And I think if you bring in Eric Holl's work that you know the two great papers showing real emergence with real causal, you know, power to these different levels and each level having unique information theoretic and causal powers, you know, and that goes with the older work on Uraro of top down constraints. What I'm saying is the ontology of spirit and community has significantly deepened for me both theoretically and also personally and existentially. So I'm sorry, I'm trying to summarize a lot very briefly because I don't want to dominate, but that's sort of what's happened with me since Jonathan and I sort of last spoke explicitly about this."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":720.84,"end":729.4,"speaker":"Sam","text":"Sure. Jonathan, I'll, I'll pass over to you. What are your thoughts on this subject? Any, any reflections on what John just said?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":730.01,"end":863.07,"speaker":"Jonathan Pageau","text":"Yeah, I, I mean I love hearing everything you're saying, John. I think it's great. I love, I love it. You know, I, I love this image of course, this, this understanding that if I use a mythological image to say that being is the union of heaven and earth, like we, there is not this just a top down. Even in terms of, of like in terms of Christian understanding, we don't have this like one to the many complete a sense of, of top down either. There is a, it's like two lovers, right? That's really the imagery that's used in, in the Bible. Like it's the, the male and the female and this like call and response and this, that's why we use the, the, the, the terminology of synergy in this, in this relationship, you know. So I, I think everything you're saying is definitely amazing because it's, it's, it's giving as usually what you, what you do in my, in my estimation is that you, you can't continually give a more modern, scientific, let's say ground for you know, these ancient ways of thinking and you can help translate them into the, into the modern world. Interestingly enough, I mean it's so weird what's, what's happening now because John and I are going to Istanbul to film a part of a Silk Road project. So I'm really excited about that. But I didn't, I found out that we're actually going to Cambridge next week and giving a paper at the same conference. Which is wild because the reason that I decided to use this opportunity to work out some of the things I want to talk about on the Silk Road, so I actually talk about him in my paper which is, which is going to be Wild. So I've been really trying to also think about this question quite a bit more. Trying to think about it more in technical terms. I'm not a philosopher, obviously I'm not a scientist, but. But trying to kind of express St. Maximus's vision of the world in, in a little more of a technical term or connecting it with more modern ways of thinking and also presenting his thought as a, as a possible solution to, to meaning crisis issues, you know."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":863.39,"end":867.63,"speaker":"John Vervaeke","text":"Excellent. Yeah, I look forward to that. That's exactly what I want from you, Jonathan."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":868.83,"end":1020.02,"speaker":"Jonathan Pageau","text":"And so I'm really so, like I said, I'm excited about all these questions. One thing I want to say, if you want to, if you want to think about this, this is something that you might find useful to you is one of the problems that we have is why it's hard to think about the one and the many, or why it's hard to think about the top down constraint and the bottom, let's say the potentiality of a being is that in the imagery, the way that we think about it, what happens is you have a transcendent which is beyond the duality that you're dealing with, right? You have something that transcends, okay? And then when you deal with a certain being, things immediately get split into two, where you have the high part and the low part, or the naming part, the unifying part and the, and the multiplying part. What happens is the duality. In the duality, the top part of the duality, the heaven part, appears as the fully transcendent. It's like a vehicle for it, it's like an image for it. So that's why we say so. Like in the Bible you say in the beginning, God created heaven and earth, right? So it's like God is before the duality and is infinite and transcendent and, and is beyond the one or whatever. Like the, it's not actually the one. But then when he creates the world, then God appears in heaven, right? God is not in heaven. But when, when you consider from the point of view of the world, God appears in heaven and then he speaks and then he breathes and then all of this imagery of the, the invisible part or the unifying part of the, the pattern, right? And so because of that, people like you, because you said people get confused sometimes when they think about it because they, they tend to put the fullness in the, in the one and they don't consider. But that I think there, because the, because just the way that humans think, because we identify something by its Oneness, obviously that's how we identified. We know something exists because it is one. We, we, because of that. That is a natural way that we go. And we tend to prioritize the one. We tend, we normally tend to prioritize the way in which something comes together as one, because that's the way we can notice it, that's the way we can name it. And so there's almost like it's not a prejudice, but there's a, there's a natural. And by the way, Jacques Derrida noticed this, right? He said there is no duality. Every time there's a duality, there's a hierarchy. Like he can see it. If you split something into one, one term becomes the thing and the other term becomes the margin. The other term becomes the not thing."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1020.02,"end":1020.42,"speaker":"Sam","text":"Right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1020.66,"end":1055.42,"speaker":"Jonathan Pageau","text":"And that's what's presented, by the way, in, in, in, in the Bible. That's why, like heaven and earth is something like that and not that. Like that's a good way of thinking about it anyway. Just to say that it maybe can help you think about the ontology. Because that's why sometimes there's a confusion between the fully transcendent, which is beyond the thing you're considering, and then within the thing you're considering, the aspect which represents the name or the unity, and then the aspect which represents the multiplicity, and the, the one always becomes an image of the, of the higher. The higher part, if that makes sense."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1056.54,"end":1135.57,"speaker":"Sam","text":"I think that makes sense. So then one of my, my follow up question to either of you that wants to handle this is I feel like sometimes the spiritual realm or the spirit world can be talked about in a way that's very dualistic, like it's some sort of parallel dimension or something like that. And that's a common depiction in science fiction or something like that. Like Stranger Things, there's the upside down, where there are these, you know, evil Demogorgon monsters. And there's only maybe a few ways to get between the real world and then the underneath world. And they only have kind of small ways of interaction, interacting with each other or having an influence on each other. And that, that sort of depiction between sort of, you know, angels or something, angels and demons operate in some kind of parallel universe or something like that is relatively common. But I feel like a theme in both of you is wanting to not have such a strong dualism in how you think about spirit and thinking about it as something kind of more integrated into, you could say, I don't know, this world or something like that. But in kind of a subtler or different sort of way. And so I'm wondering if either of you wants to pick up on that."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1135.57,"end":1518.17,"speaker":"John Vervaeke","text":"I want to jump all over that, like, a lot. And, you know, I actually did a course on Jonathan's Symbolic World, and this came up as a specific theme, and it goes towards a course I taught at the University of Toronto on the cognitive science of religion. That's going to be on my lectern. 3. Three courses in a row. Seeing. Seeing God again for the first time. And what I did, we went into this, the course, and I said, I'm not going to start with a definition of religion and then try and work out all the arguments for and against, blah, blah, blah, blah, blah, blah. I said, what I'm going to do is I'm going to instead say that modernity has put a gridlock on us of all of these dichotomies. And one of the things that was Derrid always mentioned, deconstruction was largely the recognition that modernity was engaged in the performative contradiction. It had rejected the dichotomy between the supernatural and the natural, only to submerge that into the dichotomies between mind and body, fact and value, subjective, objective, et cetera. And what you get in both the continental traditional through people like Derrida and the analytic through people like Putnam and Quine, is what you get is this devastating critique that isn't motivated initially by, like, let's bring it down. They're just wrestling with arguments. I want to make that really clear. But all of these dichotomies have been deeply deconstructed. Katherine Pickstock does an excellent version of reviewing all of this in her Aspects of Truth book. But you take. You take any of them. So, for example, the subjective and the objective, that. That is largely moribund because of the notion of affordances, the notion of relevance. Relevance is neither subjective or objective. Fact, value. Okay, well, we like, you know, again, is relevance a fact or a value? Other thing. And I can. I won't do them now. You can see the courses. There's just devastating arguments against all of these dichotomies. And what I see, postmodernism, unlike Jordan Peterson, I think there's legitimate argument within, decentralized, within postmodernism. And I think one of the things they did was they caught out modernity and said, look, you reject this one dichotomy, by the way. Let's make a distinction between distinctions, which is just two things are not logically identical and a dichotomy which is to claim they're ontologically different kinds of things. Those. Okay, distinctions are fine. We're talking about an ontological claim here, okay? And I think what. What post modernity said is like, you do all that and then you smuggle it all back in. And I think that's exactly what Jonathan was talking about when he cited Derrida. All these dualities are hierarchy. And I think this is part of the problem, and this is what Desmond points out, is we get locked into that. And as long as we're in this grammar, I'm going to say something sort of radical here. I don't think we can see. I don't think we can renew the senses the way Wynn talks about such that we could see the sacred or spirit. It can't be. Look, Desmond says we're in this sort of default atheism because what we do, for example, is we have. Right, we have objectified being, so it's valueless fact. And then we've subjectivized value, so it's unreal value by a being whose ontology is of no value. And that's just. That's like. That's default atheism and nihilism. And as long as you're in those dichotomies, like, you can't actually. I'm saying something very Wittgensteinian but very strong. We can't actually talk about what we're trying to talk about here. And so for me, it's not like John hates dualism yet. That's true. But putting that aside, I'm trying to make a stronger argument that as long as we're in the framework given to us by modernity, I think postmodernity deconstructs it, but is unable to give us an alternative. So that's another thing. Okay. As long as we are in that framework, we can't talk about this. And I mean, I want to be. I've become more sympathetic to, like, the imagery that's being used. The problem is when the imagery is taken as being like something like these. These words don't. Another dichotomy that's breaking down is the literal. Fictional is the space inside your head where you are aware of your own mind. Is that a literal space? Well, no. Is it a merely fictional space? No, because it gives me real knowledge that's presumed for rationality. So what is it? It's imaginal. Like, all of these things are breaking down and we're coming back to our phenomenology in a deep way. And so it's I'm going to leave it at that. I'm making a really strong claim that. And again, I'm not saying we don't make distinctions. I'm clearly not saying that. In fact, I'm invoking a distinction between distinctions. And what I'm saying is as long as we have a dichotomous, like, way dichotomous grammar of picturing the world, we can't talk about the sacred or spirit because it dooms us inevitably. We're doomed to a inevitable sort of default nihilism, substance, ontology, nihilism, all these problems if we have that framework. And what I'm trying to do, and I know it sounds a little bit hubristic and I hope it's not. I'm trying to say if we can deconstruct this and we look again into the depths of our experience and even our sensual experience, not just our conceptual experience, does a new sense of the sacred and what spirit can mean emerge for us? And I think this is what Desmond and other people are arguing. So what I'm trying to get is like a moderna modernist take on. What I'm saying is, oh, John's offering another theory within our overarching framework. That's not what John is doing. John is trying to say, no, smash the framework. Because if we stay in the framework, we can't see. And I mean that even sensually, we can't see what we're trying to talk about."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1518.73,"end":1531.37,"speaker":"Sam","text":"Yeah, yeah. I feel like, Jonathan, no one's done more to smash the distinction between literal and metaphorical than you have. So I'm curious to hear what you have to say about that."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1531.61,"end":1586.46,"speaker":"Jonathan Pageau","text":"Well, yeah, I want to also get back at your original question because obviously I grew up in a world where the way you describe spirits and the way you describe angels as existing in some kind of parallel dimension, as existing invisibly but like, invisibly really like us, but we just can't see them. Something like that. Like, as if angels and spirits are basically like individuals, kind of like me, but I just can't see them. And maybe I could talk to them if I. If I was in a certain position. Like, all of that is just. Is obviously just ridiculous. Like, it's ridiculous and it is not very useful, let's say. And so the, the. The really. The traditional Christian position and the one, you know, in the. In the Church Fathers, that is the most. And it's the same position as the Neoplatonist, and it's the same position as the ancient Greeks."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1586.46,"end":1586.62,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1586.62,"end":1814.25,"speaker":"Jonathan Pageau","text":"Is that the spirit, you know, or you could use the word soul is the thing that animates. It's like, it's the thing that animates multiplicity together. So you have a bunch of stuff, right? You have a, you have a dead rabbit, it's a bunch of stuff. And then you have a living rabbit. And the living rabbit is a bunch of stuff, but it's acting in a pattern towards unity, right? That's what spirit is. And so in some ways you can think that the spirit is indwelling, right? So that's also a mistake that people think like the spirit indwells the matter. But then people, obviously people think like, where's the soul? Like in what part of the body? Like where it's like a physically quantifiable thing. It's like. No, it indwells in the sense that it is. It. It has to indwell it to animate it, right? It's like the, the spirit of the rabbit is in all the parts of the rabbit to the extent that they work together towards the, the rabbit actually having an autonomous being that you can recognize and you can see is animated towards purposes. And so that is what spirit is. That is what spirit is in the Bible. That's why the, the breath of God is blown into a bunch of dust. And once you have a bunch of stuff, right, just like the dead rabbit, and then God puts spirit inside, he just make blows spirit inside. And then all of a sudden you have a man. Because that's what life is, right? Life is things that are joined together and animated towards purpose. And so we kind of have to. And that's even the way that like, even that's what angels are like angiology. I was reading St. Gregory Venice again and he talks about, you know, he talks about your guardian angel and your guardian demon. And he says you have a guardian angel. And really just like in cartoons, like there's an angel on your right hand and a demon on your left shoulder. And what the angel is, is basically the, the. It is a being that is motivating you towards the good. And the demon is a being that is motivating you towards your disintegration. And so what is a spirit? Spirit is motor. It's motivational directionality. Like it's, it's basically animating movement towards purposes, right? And so that's really the way to. That's the way to understand it. It's not that, that you know. And so can it appear as woo. Like yes, sometimes, you know, like, can you in an imaginal Space. In the way John talks about, can you encounter these as visions or as voices or. That is. All of that is completely possible. There's no reason why that wouldn't be, Wouldn't be real. But it doesn't mean that the spirits exist in like, another dimension, like kind of like you talked about in Strange Stranger Things. Anyways, so hopefully the, the way, the. Actually The. The way that, the way that spirits appear in that way, like kind of like in another dimension and they kind of like pop up or you, you, you, You. They. They. They appear to you and scare you and all that kind of stuff. The way that they, they do that is mostly in the demonic space. Because what happens when you encounter that type of spirit, you could say, is that it appears explicitly as. You could say something that is not you, that is threatening you, like something that is like a. Like a beast that is coming to eat you because it's, it's moving you away from who you are, right? It's pulling you into hell. Like, you see those little images in, in the, in the. But all of this is, you know, even if it represents itself to you that way, it's going to. It's. It's. It's an imaginal experience, right? It's something like these motivating spirits that are real, by the way. They're not, they're not just in your mind because they have. How can I say this?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1814.25,"end":1814.53,"speaker":"John Vervaeke","text":"It's."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1814.53,"end":1846.14,"speaker":"Jonathan Pageau","text":"I keep. I. I've said this several times. Like, you know, the spirit of anger is the spirit of anger for everyone. Like, I know when I see it, if I see someone being possessed by anger, it's like, I know what that looks like and it's an objective thing that I can see. Objective. Let's not use that word again. But it's. It's something that has. That can be identifiable and that acts the same way on the same. On all different peoples or similar ways in ways that are patterned. And therefore that. That spirit necessarily has an existence outside of my individual mind."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1846.14,"end":1846.66,"speaker":"John Vervaeke","text":"It'd be."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1846.66,"end":1862.98,"speaker":"Jonathan Pageau","text":"Then, then it wouldn't act completely idiosyncratically to me. Like, that doesn't make sense. It's acting uniformly across multiple beings and is motivating them towards a purpose that I can recognize. And therefore it has. True, it has. It has a form of being."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1864.18,"end":1869.02,"speaker":"Sam","text":"But does it have a form outside of people's minds or something like that?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1869.02,"end":1879.55,"speaker":"Jonathan Pageau","text":"Well, would it have. I just said yes, of course it does. Because what, what would that even mean? Like, it means that the spirit of anger would only exist in your brain. Is that what you're suggesting there?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1879.63,"end":1885.63,"speaker":"Sam","text":"Or, or that seemingly can only act through brains or something like that?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1885.95,"end":1919.91,"speaker":"Jonathan Pageau","text":"Well, of course it can all sp. The spirit of anger can only act through, through living beings because anger is, is the, is a motivating agent for human beings. It's not. Or may maybe there's some connection to animals to some, to some extent, but it's not. It's not, it's not just a. Like it. I don't see why the spirit of anger wouldn't act on trees. Like that doesn't make any sense. Or I mean, maybe it in some weird way you could find it, but I'm, I don't think that it does. Like it doesn't motivate. It doesn't motivate. You know, does that make sense?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":1919.91,"end":2024,"speaker":"John Vervaeke","text":"Yeah, but it opens up a possibility again, if what I just said a few minutes ago is taken to some degree seriously, we should be looking for even. And this is the tricky thing. And I think that's what Sam's trying to get at. And I'm going to point to the work of Michael Levin, right. Are there non psychological descriptors of spirit that are nevertheless legitimate descriptors? And so let me. So Mike is doing a lot of work showing that cells are not genetically like, I mean by their genes, like determined. Obviously the genes play a role. But what seems to be happening is something like a bioelectrical community forms and you can do really weird things. Like if you separate the community, the cells will become different things. Like he takes, he takes stuff from the throat of human beings and isolates it in a certain way. And it becomes. It self organizes into this thing that has a tail and swims around and moves around. It's like, right. Or, or you get cancer and what you do is you don't try and kill the cancer. You try and convince it that it actually belongs to the community around it and it stops acting like cancer and more and more and more. And even you get an algorithm running on a computer and you change the environment the right way and the computer, meaning some interaction between the hardware and the software, like does stuff that is not part of the algorithm in order that the computer can deal with the environmental thing. Right? And none of these are psychological terms. And yet it sounds to me, Jonathan, that they would land very well with what you mean by spirit."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2024.4,"end":2204.92,"speaker":"Jonathan Pageau","text":"I think, I mean I, I'm obviously, I'm really a Christian, so I'm way more radical. I think that's how everything works. Like I Think the entire cosmos, even non living systems work that way. It's just that it's far easier to see in living systems, you know, because they have, they have certain characteristics. You know, they have kind of autopoiesis. They have all of these, these things that in. And if you look at traditional thinkers, they'll always say that in some ways they'll say something like, obviously living beings are closer to the image of God. And you know, obviously the man is the highest version, the closest to the image of God. But ultimately I think that spirit animates all, all things. Like spirit animates all, all things that you can recognize as being patterned. Everything that you can recognize as having both one and many have to be. That has to be the subject of some aspect that we could call spirit or principality or you know, you can use different, different words. And one of the things too, that's interesting. This is why I love St. Maximus. And I think that St. Maximus just Saint Maximus gives us like, I think he nails the, he puts the last nail in the coffin, like for this. Because what he says is that all of this is gathered in man, right? He says all of these spirits, like all of these reasons, all of these, you know, and this idea, for example, that we will rule the angels, right, that appears in Christianity, will rule over the angels, is that what's at the top of all of this is the incarnate man, right? And of course he means Jesus Christ, but he also understands incarnate man as basically a kind of anchor that extends itself into all of creation. He says, he says man is the laboratory for the logi. Man is the laboratory for the reasons of the purpose. And he gathers them into himself, right? And then offers them up to God. Which means that in some ways the angels are downstream from humans or will be. Even though they are above us, they also are gathered in us. And in some ways we ground the man as God. Man grounds their ontological reality, right? Is in some ways the ground of their ontological reality. And so what, what I mean is that it, it changes the entire scope. Because what it means is that the. You could say that when I see a pattern, like obviously I can me myself, like I can be delusional and see patterns that don't exist. People see that all the time. But if I understand man as man as such, man as the intelligent one who's able to properly discern patterns, then when man discerns a pattern, that pattern is, is real. Like there's. And it's, it's even though it's grounded through us. Like it's reality is there's no other way to actually attribute reality. Like there's, it filters through human consciousness."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2208.52,"end":2210.12,"speaker":"John Vervaeke","text":"No, no, no, no, no, no, no, no."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2210.68,"end":2213.72,"speaker":"Jonathan Pageau","text":"Drop that bomb on no, no, no, no."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2213.72,"end":2256.53,"speaker":"John Vervaeke","text":"That's, that's like, like no, that's a lot. So I want to do a couple things and they will seem disconnected. So give me a minute, then I'll connect them. And I posed the first problem to Mike and, and reduction can go both ways. Like I can reduce up, I can reduce down. And part of my argument is those are completely symmetrical, which is why both reductions are wrong in some deep way. And so reduction would be there's an identity, right? There's an identity. And I hear. And the thing I said to Mike is, okay, I get what you're saying, you know, it's multi level, there's a continuum. But you know. Do you know what a sorites paradox is?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2257.09,"end":2257.49,"speaker":"Sam","text":"No."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2257.81,"end":2314.07,"speaker":"John Vervaeke","text":"I have a heap of sand, I remove one, right? And so I can remove every. If I remove a grain and it doesn't turn a heap into a non heap, I can remove all the grains and there's still a heap there which makes no sense, which is differences of degree have to become differences of kind or you fall into sorority's paradox. So we've been sort of emphasizing what is the same, but presumably there's something different. And I hear you saying something like that, Jonathan. There's some. There's a difference in kind about human beings and I wonder if that, I mean it's not the same, but I wonder if there's a potential convergence between arguments I've made about the sort of self consciousness that's available to persons seems to only exist at one level. You can drop below it and you start to lose it and you go above it and you start to lose it. So like what do you think?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2314.15,"end":2456.08,"speaker":"Jonathan Pageau","text":"Yeah, that is, I mean we've had this conversation before actually. And so it's like I do feel, I do feel uncertain about that. I was used to be pretty certain that yeah, there's self consciousness all the way up. Like no, no issue. But now I think feel like in some ways, in some ways it is possible to consider it that the self, that self consciousness is grounded in the God man, if I use that term, like in the incarnate man, in the sense that it's not. But it doesn't mean that. It doesn't mean that it has, it doesn't have a kind of reality. Like I think it has a kind of reality but it's, it's still grounded in that. You know, St. Maximus has this crazy saying which is. He says that the, he says that the reasons for things, right? The logi, the reasons, the purpose is that, you know, they are multiple and truly multiple, but they're also one. Yes, it's also just the divine Logos, like it's all the divine logos like reflected in myriads of ways all through the, all through the, the system. And so this idea like Eckhart, it's the idea that in some ways that all, you know, that the eye is also the eye of God looking back and that all multiplicity is always in some ways, you know, and so, but if you think of the God man as being the top of that, it makes everything really fascinating to consider in terms of understanding how that reflects in what you said, which is that in some ways there is, there maybe there is a kind of subconsciousness of corporate beings, but it's filtered through us. So a good way of thinking about it would be like the self consciousness of a city is anchored in the mayor, right? And so the city is self conscious, but the seat of that self consciousness is the mayor. And it just. And then it distributes itself. That, that aspects of that self consciousness will distribute itself among the workers of the city, the people fixing the roads, the policemen, all of that. But it needs, in some ways it tends towards a head which will actually be a person, a president, a corporate whatever. And then, and then it can make the being, it makes the corporate being, but actually self conscious."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2456.8,"end":2461.44,"speaker":"Sam","text":"I wish Chicago sees itself as the eyes of the mayor or something like that."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2462.24,"end":2533.79,"speaker":"Jonathan Pageau","text":"Something like that. Well, that you kind of need sometimes it doesn't have to be completely one. Like it can be a little distributed, but it tends to, you could say towards one. But it means that the city is self conscious because it acts in a self conscious way, is able through distributed command, through, through distributed authority. It's able to recognize threats, it's able to, to remove them, it's able to self repair, it's able to do all of these things that, that, that, that at least conscious beings do, but they also are self conscious because we have a name, we have a city, we have a parade, we have, have a, we have like, we have festivals that celebrate the history of Chicago or whatever. Like all of these things we do. That's a type of self consciousness, right? To celebrate your own identity. Like that's a, it's. I don't see animals doing that. Like, I don't see. So that's what I think, I think, I think that there might be a way to explain it this way. And I think that if. But I mean, obviously I'm not a technical thinker, but like, I, I mean, I'd love to hear what you think of. I feel like I'm dropping because I'm actually. Because I have been thinking about this a lot, obviously, so."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2534.67,"end":2576.6,"speaker":"Sarah","text":"Hi, this is Sarah from Hamilton, and I'm very happy to announce my first course with Symbolic World, the Key to Reality. Over the span of five weeks, we will look at the scriptural vision of reality through the lens of the Temple. We will see how all the details of Scripture are orbit around the person of Jesus Christ, the eternal word of God and archetype of the world. And we will see how that christological vision firmly earths in place the concrete details of Israel's Torah and story. Through that lens, you will come to see how meaning and matter intersect and intertwine not only in the text of Scripture, but in the very tapestry of reality unveiled by the Bible."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2582.05,"end":2659.97,"speaker":"Sam","text":"A little bit of chaos and order. But I, I feel like when I was, when I was making my, my videos, sort of trying to kind of lay the framework for this and trying to really understand both of you where you were similar and where you were different, I kind of went back and forth and being like, who has a more kind of human centered view of things? Is it John or is it Jonathan? Because there are some ways in which way, like I felt it would go in either direction. Because sometimes, Jonathan, you're pulling out your Maximus and Gregory of Nyssa stuff that's super, you know, anthropocentric. I guess I'm saying that in a good way, not a bad way, but it's this theo. Anthropocentrism or something like that. And then John will sometimes move away from that. But then Jonathan, you'll be like, sometimes, although I'm hearing you kind of back away from this, that there's consciousness all the way up and down and that sort of kind of de. Centers the human from it. And whereas John will be like, no, there's something very special at our ontological level that the hand is not conscious in something that the way that the person is. Nor is Chicago conscious in the way that a person is. But it seems like you're, you're moving closer together in that. And that like, like I said, sometimes Jonathan's more human centric and sometimes John's more human centric."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2662.13,"end":2836.74,"speaker":"John Vervaeke","text":"Well, that's good because it means, you know, there's actual A dynamic of, of dialogos possible there. I, I, yeah, this is the, I mean, so sometimes put. People put this question very boldly or perhaps baldly and. But I get it, I get it asked this way. Do you think there's spirit without, like, without human beings? And I'll say, well, in the way Michael Levin is talking about it, I don't have any problem, clearly, because these are subpersonal, these are individual CEL cells, these are algorithms like this, like, like, oh, sorry, computers. Not just. And there's a non algorithmic aspect to them and there's an irreducibility to certain organizations. Eric hall shows that that have nothing to do with whether or not it's a person. So all of that and, but what I think they want to know and I'm not sure if Jonathan and I disagree because again, one of the dichotomies that I think, you know, and the course I did on Jonathan's platform, I think we really have to give up is the. This sort of, you know, it's either, it's either perception or projection. I'm seeing it as it is or I'm projecting onto it. It's either imaginary or it's direct perception. So all of the work that's happening in cognitive science points towards first of all, this complete interpenetration of top down and bottom up and then within predictive processing. Like there is no clean line between projecting and perceiving. When I'm looking at that wall over there and I'm seeing it as entirely yellow, it's as true to say I'm imagining in it as I'm perceiving it. There's no clean way. But people are still operating under the idea that no, I could. Like they want to say, could I look, could I, could, could I, could, could I perceive this right. Even if there was no human beings, which is a bit of a performative contradiction, but like it's. What I'm trying to get at is we have to be really careful of thinking we can get outside of the imaginal when we're talking about perception. Right. And so I understand what people are trying to ask, but there's an implicit picture of perception in their question that is I find very problematic, which is I can somehow stand like, well, could I take a videography of it? Well, do you think that that's how perception works? Like a camera works? Well, of course not, because the camera isn't aware. You have to do stuff too."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2837.54,"end":2845.12,"speaker":"Jonathan Pageau","text":"You also have to watch the video. Unless nothing. If that's not Someone watching the video. I don't know what that video is, except for a bunch of like."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2845.44,"end":2897.57,"speaker":"John Vervaeke","text":"Right, exactly. And then. And then the problem we have is because we're caught in the dichotomies, we then careen over into idealism. Oh, right. It's all just a simulation. It's all just in our mind. And. And that. And that's, of course, the west for the last 400 years. And we got to get past that. And so I understand what people are trying to get at with this question, but I think it prioritizes objectivity over transjectivity in a way that I want to challenge. So that's my bomb. I want to drop on people. We have. We have the idea. We have a picture that. Sorry. We have a picture that we think is an idea, like the picture of the man standing on the sun, looking at his watch, wondering what time it is, but it actually makes no sense. Right. And we. We. We. We have this picture that we can have a view from nowhere."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2897.73,"end":2898.29,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2898.69,"end":2942.39,"speaker":"John Vervaeke","text":"Which, like Godel, it's logically impossible to have a. You know, a description that is complete and formally complete and consistent. It's logically impossible. Einstein. There is no absolute space and time. So a view of everything, everywhere, all at once, which is what the view from nowhere is, is physically impossible. Like, can you get. I'm not talking to YouTube. Like, get this. It's logically and physically impossible. That's as impossible as anything can get. And yet we still keep acting like this is the standard of realness against which we are measuring things. That's what I want to challenge. That's what I'm trying to challenge."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":2942.39,"end":3000.63,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. It's interesting because I don't know if you saw Alex o' Connor recently saying that he was a. That he was. He saw the Earth as the center of the. Of the universe, and he. It's interesting because I. I wrote an article about this, like, 10, 12 years ago, you know, citing Pavel Florensky, how he realized that general relativity, the only real solution to general relativity in terms of worldview, is actually going back to almost like a Plotinian vision, which is. Well, if I'm going to. If I'm going to suggest. And that's what I end up doing anyways, if I'm going to suggest the center of the cosmos, because there is no objective center in terms of general relativity, then it best suggests the one out of which I'm measuring things. Like, this is where I am. This is where I'm measuring the world. And therefore, this is the Place out of which this is the. This is the center, for all intents and purposes. It's also the center of meaning. It's the place out of which meaning moves out into all these cosmic forces. And so it's like it is the hub of the wheel, really."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3001.51,"end":3032.95,"speaker":"John Vervaeke","text":"I think that's right. I mean, I think that's what, you know, Frank Gleiser and Evan Thompson do in the blind spot, right? Which is there is a spec. We have to give accord, a special ontological privilege to the place where we're standing from which we do all of our theoretical work, because if that's not real, or as real as any of our ontological claims, then we get into a deep performative contradiction. Well, again, I have no problem. But. But they have to mean it the way you mean it, Jonathan. Right. Yeah. Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3032.95,"end":3153.07,"speaker":"Jonathan Pageau","text":"But the thing is that, John, the problem is this, like, this is in some ways the issue. And the issue is that the way that. The way that these, These types of descriptions of the world, like a more mythological description, the way that is made so that all levels of intelligence and participation are possible. And that's one of the problems, obviously, with it, especially for a kind of high scientific type mind, because they'll say, wait, so you think the world is flat and that you're just there and that, you know, the heaven is above and you know that there's chaos on the outside and. And, you know, my, you know, my illiterate great aunt or whatever would be like, yeah, yeah, you know, but she thinks it really, in a concrete way. That is ridiculous. But the problem is that for that person, it plays the same. It plays the right role and it's okay. And that's why this is. This is a hard. This is a hard pill to swallow. And you can sit. You can at the same time have an extremely subtle thinker, an extremely high thinker that is able to kind of understand the analogical language and is able to understand that this is rather a. The notion is rather the ground of. You know, how Heidegger says, you know, when Aristotle talks about the earth, he's talking about the ground of being, out of which multi. Out of which potential arises. He's not talking about, like, the stuff on the ground, but he's also talking about the stuff on the ground for, like, most people, you know, and that's also. Okay, that's why, that's why, like I. That's one of the reasons why I like this type of thinking is that it's. I often want to defend the uneducated simpleton from the scholar. Because I'm like, just let him be, dude. He's not doing any damage thinking this in a very kind of simple way. And he doesn't have access to your world anyways. He's not talking in these very high way. He's not in the university. He doesn't have influence over the world. Obviously the Internet has made it much worse."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3153.15,"end":3153.55,"speaker":"John Vervaeke","text":"This."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3153.79,"end":3191.88,"speaker":"Jonathan Pageau","text":"That is true. The Internet has made it that now, like the very naive simpleton the peasant now has can get a voice that is as loud as the church. Father. So that is. That. That does make a difference. But what I'm saying is that in some ways, if you. Let's say we were. I, I'm. I advocate for recovering a Plotinian vision, like all out. Like that's my. That's my. I advocate for that. But understood, like you said, in the highest form that we can understand it. But I know that downstream from that at some point there's going to be people who are going to misunderstand me and think and you know, and kind of think it in a more brute."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3191.88,"end":3192.28,"speaker":"John Vervaeke","text":"Brute."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3192.28,"end":3192.88,"speaker":"Sam","text":"Naive."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3193.2,"end":3193.92,"speaker":"Jonathan Pageau","text":"Naive way."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3193.92,"end":3196.32,"speaker":"Sam","text":"You could say, go ahead, John."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3197.6,"end":3291.95,"speaker":"John Vervaeke","text":"I mean, so here's a potential help. I don't know if it is, but I talk a lot about exaptation as a biological function. It's pretty non controversial. As a cognitive function, it is moving towards being non controversial. That what? Like that we take our sensory motor navigation and we repurpose it for moving around in conceptual space and moving up and down. Look at what I'm doing with my hands. Ontological levels. And that just sort of makes sense to us. And we have to stop and say why does that. You don't. Like. Again, that's not literal. But like this is. And we do this in and out and all that kind of stuff. And the thing about the, about the exaptive is it's not a. It's. It's. It's a. It's a both. And it's like so to do. I'll do hula, which is wood. But he. Aristotle's using it. He doesn't mean not wood. Yeah, he's exacting it and trying to get at just the way wood is potential for so many things. There's a potential. And that's what he means by matter. Right. And so he's exacting something and he's taking it. And so for me. And I think a lot of what ritual behavior is, is about. Is about recycling. It's about. It gets up here and it can get too abstract. And almost nominalistic. And we have to do things to bring it back down, reconnect it to that sensory, motor, phenomenological experience and then re. Exact it back up again. I think that's one of the. Well, you heard me argue that in the course."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3292.11,"end":3399.49,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I think that's. I think it's beautiful. I love it. I love. I mean, I never. Some of the things, like, I never would have been able to predict how you could almost. I could use the word exacting for symbolic vision. Right. In the sense that this is the. But I, I would phrase it a little differently. Like, obviously, you know, but I would phrase it differently in the sense that in, in mythological, in the mythological, in mythological image, one of. We think about it incarnationally, right? So you think about it incarnation. So you, you think of that. This, these high principles, right? They, they need, in order, like you said, to be actually embodied and understood. Whatever they have to, they have to be expressed in means that are embodied and understood. And the, the most symbolic things are actually usually embodied in the lowest form. Like, I did this thing on my symbolism masterclass thing where I did a few analyses of superstitions and I tried to show like, how. So actually many superstitions are, are, are actually some of the most metaphysically accurate. Like religious liturgies, like, they, they, they embody like symbolism in ways that is very difficult to go beyond, but they are embodied in a way that has no mechanical causal relationship. Like, obviously, you know, it's like the, the idea that, you know, the connection between going under ladder or, you know, breaking a mirror and everything, but they all are liturgically perfect and so embodying them, you know, in a world over thousands of years actually would have had evolutionary advantage. I really believe that, by the way."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3399.49,"end":3400.21,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3401.65,"end":3433.2,"speaker":"Jonathan Pageau","text":"So I think that there's something about that. Like it's. In some ways in order for it to be available for everyone, like to actually be embodied in the world, it has to be imaged in the, in the lowest way. So if someone reads Aristotle and is not that smart and he can't grasp potential, he'll be like, yeah, I understand how wood is used to make houses, you know, and maybe that's where he's going to stop. And it's fine, like at his level because, you know, not everybody can understand something abstract like potential."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3435.76,"end":3480.28,"speaker":"John Vervaeke","text":"I get that. Although I do want to say cross generationally, things that were once very philosophical can often percolate into the common cultural grammar. Yeah, no, in very powerful ways. And secondly, I want to bring in A point I'm going to be talking in Poland about Barfield. And Barfield has this notion of the mythological is sort of what he calls primitive or first participation, where we're living pre dichotomy, to use my language like so spirit means both breath and it also means that which inspires us. That's the standard Barfield argument. One of the problems I have with that is Barfield acts as if it's sort of a fossil in our language and we don't think that way anymore, but of course we do. Look what I'm doing with my hand."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3480.36,"end":3480.96,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3480.96,"end":3543.15,"speaker":"John Vervaeke","text":"Yeah, yeah, all that stuff. But I think we can still save Barfield's argument in the sense that. Yeah, but what happened is we then got this dichotomy between our scientific language and our mythological way of speaking and we move into the master of all dichotomies, Kant. Right. And what I'm saying is, and this is how Schelling and Desmond are having a huge impact on me, we need a post Kantian Neoplaton. We need one that brings the, like gives like the porosity between the science and the myth, as he often will talk about, has to be brought back. And I think that's the value. I don't mean that we have to challenge your aunt, but I also don't like the opposite. Yeah, the opposite of. Well, I don't. We don't need to pay attention to this science. Yeah, yeah. You know that, that. Yes, you do. Like, that's a performative contradiction. Like I, I can't, I, I sometimes I laugh and sometimes I go, what's going on? When there's people on social media saying like, I'm really against scientific technology and like, this is not."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3544.19,"end":3544.99,"speaker":"Jonathan Pageau","text":"What are you doing?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3545.07,"end":3554.49,"speaker":"John Vervaeke","text":"You're like, you're using computers and electromagnetism and the Internet, like an AI. What, like, what do you think? Like, where are you?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3554.65,"end":3642.62,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Where are you? Oh, that's beautiful. But I, John, I totally agree. And in some way that's why I love what you're doing so much, because I think that you've done more than anyone to be able to kind of, to bring it together, you know, because the mythological world is based on the phenomenal experience. It's not based on scientific, scientific thinking. And if you, if you enter the phenomenal experience, you actually have access to some of the deepest metaphysical insights that are in mythological thinking. So, you know, it's like the idea that, that, that breath, like physical breath is also spirit. That's not a fossil. It's like I need to. Your breath has to come in my direction so that I can hear what you're saying. It's like your breath literally carries your meaning to me. And so it's like I cannot know John without his breath pushing his meaning from his heart out into the world so that I can encounter him spiritually, you know, because I'm not touching him. I'm not touching him, but I encounter him spiritually like I encounter him in my mind. And it's like it's totally phenomenologically, completely accurate. Like when you said this, when you said above, it's like that is phenomenologically accurate. When someone is above you, they have an. An ass. They have something that you don't have."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3642.86,"end":3643.34,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3643.42,"end":3701.33,"speaker":"Jonathan Pageau","text":"They have a greater vision over. Over multiplicity than you do. They are above us and they. If they speak, we all see them, right? If there's someone standing on a chair above us, everybody in the room can see them. They can see everybody in the room, but I can't see everybody in the room. That is a real ontological reality of hierarchy that's related to this idea of above. Like, it's scientific language is in some ways a kind of specialization of language towards certain types of thinking and third types of purposes. And I think that it can be brought to help, to. To help people understand it again. But really, religious symbolic language is in. This is in the phenomenological world, which is why I keep saying, like, I advocate for a Plotinian world in terms of experience, you know, but it doesn't mean that we have to get rid of science. That'd be stupid. Like, I mean, you can't use Plotinus to flow to fly satellites. Like, it's pretty, pretty dumb, you know."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3702.29,"end":3730.09,"speaker":"John Vervaeke","text":"I want to add on to your breath thing. Breath is also an aspect of voluntary necessity. Like, I have to. I can control my breath, but I also have to breathe. And voluntary necessity is what we do when we are communicating. I like, there's a voluntary aspect, but there's. There's a necessity to it. We can't just be completely subjective about it. And reason depends on. Like an argument is compelling, but it's not compulsive. Beauty is voluntary necessity. So, like, we're enacting something."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3730.33,"end":3753.67,"speaker":"Jonathan Pageau","text":"And by the way, when you die and your soul leaves your body, it's also when you stop breathing. So it's fine to think that your breath and your soul are related, because when you stop breathing, it means your soul has left your body. And so the imagery is. Is a hundred percent perfect. It doesn't mean that your soul is a physical thing inside you, but it's like everything about it is perfect in terms of its imagery. Right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3753.75,"end":3754.47,"speaker":"John Vervaeke","text":"No, no, no."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3755.51,"end":3756.47,"speaker":"Jonathan Pageau","text":"Rant mode then."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3756.55,"end":3796.54,"speaker":"John Vervaeke","text":"No, no, it's all right. But I, I like, I, I want to explore a little bit more. Like again, I do think maybe this is self promotional, but I do think we like there's a problem and that we need a post Kantian Neoplatonism, Platinus and I would say Plotinus all the way through to Erigina, because that whole tradition I think is important. But like I said, we can't pretend that Kant and Newton didn't occur."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3796.94,"end":3805.42,"speaker":"Sam","text":"Yeah. We can't just go back. Right. Or else we're just setting ourselves up to have to go through the whole process again in some sort of doom cycle."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3805.58,"end":3816.62,"speaker":"John Vervaeke","text":"That's exactly it. I think we posed real problems, we suffered real problems, I think we're solving real problems. And that means there's been real learning. And I don't want to pretend that that learning hasn't been real."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3818.31,"end":3846.84,"speaker":"Sam","text":"Yeah. And I feel like that's so much of kind of what's happening in this little corner land, meaning crisis land, is how to figuring out how to go back responsibly while also remembering what we've learned along the way. Like some sort of hero's journey of the Enlightenment or something like that, where we can go back to the shire but not forget that we had to go through the Enlightenment first to come back and see it again."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3847.24,"end":3935.3,"speaker":"John Vervaeke","text":"So the person who I think is most doing lifting that all on his shoulders is William Desmond. Absolutely. So like the fourfold senses of being, like we start with a. The first sort of philosophical idea is being is like Parmenides. It's a homogeneous, univocal. There's one way of talking about it, right. And then that breaks down under all the critiques and we get equivocal. No, being means many different things. Right. And they're all, you know, in conflict with each other. And then we get the dialectical, which is Hegel. No, no, all the differences get fed, folded back into this self determining system and each one of these has social, you know, aspects to it. You tend to get a monarchy idea with the first one. You tend to get something like a democratic ideal with the equivocal. You tend to get a globalist ideal with the dialectical. So these, all these don't just sit up here. That's my point. They get down into the guts of our lives. But then he proposes the Metax ecological, which is. No, no, no. The dialogical. The between the metaxu actually has to be preserved, which means the. The one and the mini have. And I think Jonathan was saying this earlier, the one in the mini are peers. And the polarity and the porousness between them is what is primary. Not like whenever we're trying to do either one of these, then we're actually."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3935.94,"end":3944.9,"speaker":"Jonathan Pageau","text":"Like, yeah, I don't say that one of the many are lovers. I like that better. It's a better, more. It's also like a more traditional image."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3944.9,"end":3945.1,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3945.1,"end":3962.05,"speaker":"Jonathan Pageau","text":"Because it's productive. It's like, it's the. It is that it is that capacity for them to. To join that produces beings that reproduce it. Right. So it's like you have. You have the one and you have the body and the seed. Right, let's go."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3962.05,"end":3962.37,"speaker":"John Vervaeke","text":"I."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3962.37,"end":3974.17,"speaker":"Jonathan Pageau","text":"That's why I advocate for the ancient world image. You have a seed that goes into. It goes into an open space and then it makes a new body that reproduces. It's that, that image. It's like. And then it can make a bunch of them."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":3974.17,"end":4005.93,"speaker":"John Vervaeke","text":"Because I granted. But like, just to like, give an instance of a post Kantian Neoplatonism, you know, Whitehead says, you know, everything converges into the one. That, that, that adds one more thing to the universe and then that feeds back into the everything. Right. Which is just what you did. Now, the thing about the. That language, and this is why Whitehead crafted it, is you can see that language in relativity and quantum entanglement, which. Right. So it bridges in a very, very powerful way."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4007.19,"end":4009.59,"speaker":"Jonathan Pageau","text":"Yeah, I don't know enough about quantum entanglement, sadly."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4011.67,"end":4119.08,"speaker":"Sam","text":"All right, so, so on the, on the subject, kind of circling back to a little bit of the idea of exacting. And what does spirit mean at more than just an individual level? Like, one of the things I talked about in my video was how religion forms sort of groups and superorganisms and that it's about bringing people together. And part of what we mean by spirit and by fellowship is things that unite multiple people into something bigger than themselves. And I sort of pointed out how, like, you can think of Israel thinking of their covenant with God as something like a marriage bond, as an adaptation of the idea of, you know, the impulse towards monogamy and faithfulness, and then applying that to this sort of imaginal group identity collection thing. Right. You know, like this idea that I am married to a spouse, that's something that's sort of like native and easily understood. The idea that I'm married to a covenant with God. That's sort of an acceptation of that idea or even, you know, in Christianity, when we call each other brothers and sisters in Christ. Right. That's an acceptation of. Of kinship bonds, sort of biological, you know, treating your siblings as someone special. That's different than how you treat most people and then bringing that to sort of like this new register. And I think that one of the questions that still needs to be thinked about and kind of hammered out is what exactly is going on in these groups? That is, how does spirit work at the level of a group and not just at the level of a person?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4120.2,"end":4272.71,"speaker":"John Vervaeke","text":"Go ahead, John. Well, you know, the work of Eric hall and some of the work I've been doing with Greg. Right. And Mike's work, Michael Levin, we now have good arguments, almost formal proofs that, you know, level levels have distinct, distinct, irreducible causal and informational access powers. And one of the proposals that Dan and I have made is the superorganism, and I'm fine with that term, by the way. The superorganism can grok hyper objects. It can grok patterns that the individuals can't because it has causal and information access powers that we don't have. And that's an ontological sense of fellowship, by the way, which is what I was trying to point to earlier, not a merely psychological sense. It's like these. So, and once you say that, I mean, you have to do a lot of really good argument and work. So, because I want to really honor Mike's work and Eric Hole's work and the work that Greg and I are doing too, and Evan Thompson's work and all of that. But like, once you, once you sort of see that, you look back and say, well, of course, because, you know, and this goes back to Ed Hutchinsonly, a group of people in a dynamical system with a bunch of tools can navigate a ship on the ocean because nobody can see the whole ship. We just don't have that capacity. Nobody can see the whole ocean, nobody can see the atmosphere. And yet we have to be able to grok those things if we want to sail safely across the Atlantic on a big, big cargo ship. And, and so for me, that, I mean, this is just, I think this is a refinement of an argument I was making earlier, but I think there is. These upper levels are strongly transcendent in that they have causal and information access powers that are not possessed at the lower levels, which means they are ontologically different in an important way. And I think what fellowship is. Jonathan once said that faith is the sense of a higher level. From a lower level or something to those words. I think fellowship is our sense of participating in that capacity that we get a sense that the. We of us can grok things. And is that not biblical? The church is the bride of Christ. The church has a capacity to grasp or grok the Logos in the way in which an individual cannot. That's supposed to be the ontological basis for the authority of tradition. Of, like, am I. Is this not a fair interpretation?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4272.87,"end":4330.18,"speaker":"Jonathan Pageau","text":"Yeah, I think it's totally. I think it's totally right, you know, and, you know, that's why there is this. There really is this sense. Like, obviously, in. In the Christian vision, it becomes cosmic, right? It's. It's like there is a cosmic hyper. Object. You're gonna use your language, right? Which is the heavenly Jerusalem, which is the possibility of all things being together in this dynamical system. That is the seat, right? That is the. The throne for the Logos. That is the throne for the cosmic principle. You know, and so that, you know, it's like you said, what happens is that when we engage in community, then we become little thrones, right, for these higher beings, like this higher unity. And we can."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4330.86,"end":4331.1,"speaker":"John Vervaeke","text":"How."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4331.34,"end":4407.65,"speaker":"Jonathan Pageau","text":"There's a. There's a. There's a kind of. There's a transcendent thing that happens to us, right, when we participate in a group and we see the body come together, right? That's why one of the reasons why people love team sports so much is that there is. There really is a kind of ecstasy that comes with that experience because you see yourself suddenly as a body for a higher purpose. And. And it's. And it. I mean, obviously you can weaponize that, right? There's a way. That's what. That's what military leaders do, is they weaponize that sense, right? They. They use that in a way to kind of. To. To. To attain goals that aren't necessarily amazing, but that experience, right, is a real one. And if you think that's why St. Maximus thinks of the. The liturgy, right? The. This notion that the liturgy is actually the. It. It's like a cause. It's a microcosm, right? It's this. It's this way in which we come together and move in certain ways with a certain hierarchy, with a, you know, with certain celebration, invocation, all of these things. But what we're actually doing is becoming a throne. You could say, becoming a throne for the cosmic principle."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4409.66,"end":4442.92,"speaker":"John Vervaeke","text":"So that would be to say. And hopefully this doesn't ruffle feathers. And you. And I've talked about this a little bit. I just did a long discussion with Sebastian Morello about this, because I'm going to use this term generically, and the problem is it gets pinned to a specific meaning. I'm going to use this term generically. It sounds like liturgy is theurgia. It is a ritual that makes us receptive to the theophany of what is above us and beyond us and presence. Is that so it can become transformatively active in our life. Is that not."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4442.92,"end":4457.72,"speaker":"Jonathan Pageau","text":"Yeah, I'm fine with that. As long as we don't. One of the dangers of the. Obviously of theurgy or theurgic thinking is the kind of occultist version, which is in some ways the idea that I can catch. I can wield it, and that's really not fair."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4459,"end":4463.2,"speaker":"John Vervaeke","text":"Ambulance goes to great lengths to distinguish theurgy from sorcery."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4463.2,"end":4463.56,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4463.72,"end":4465.48,"speaker":"John Vervaeke","text":"Exactly. How he makes that distinction."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4465.48,"end":4521.85,"speaker":"Jonathan Pageau","text":"So in that sense, I would say. I would say. Say. I would say that I'm fine with that. Some Orthodox might get angry with me. But I think in the way that you framed it, I think it's completely. It's completely fine to understand it that way. It's like it's. You know, there is. There are these things that we. Certain things that we do that. That as we. We come together that become in some ways a. Yeah. A throne or a. You know, and then the. The transcendent principle of the. Of the world. And then what happens is, obviously the idea is that that then gets carried out. Right. So it becomes an anchor for time. Right. Becomes an anchor for your week, for the year. That becomes an anchor for your community. And so that's why the church is at the middle of the. Of the town and the steeple is highest. So it's not just the. The. The. It's not just the liturgical act per se, but it's the way in which that liturgical act then also fits in other smaller liturgical acts."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4522.57,"end":4541.99,"speaker":"John Vervaeke","text":"I think that's a defining feature. And that's not just my argument of ritual. We have a normative standard for rituals. Do they transfer broadly and deeply into. Into individual and collective lives? I mean, that's how you know if it's a good ritual. And that's, of course, why the sorceress act is such a perversion, because it's also an individualization."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4543.99,"end":4546.39,"speaker":"Jonathan Pageau","text":"I want this person to fall in love with me or whatever."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4546.39,"end":4546.79,"speaker":"Sam","text":"Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4546.95,"end":4589.46,"speaker":"John Vervaeke","text":"So because I'm one of the things I'm going to be arguing in. In Chicago is, I think fellowship is this proper ritual of. At the, of the. With ontological teeth that generates a kind of receptivity for the theophany, for, for the, the presencing of, you know, a more ultimate reality. And that's what I think the fellowship of the Spirit is. I, I what? Or maybe that's too strong. I'll weaken a little bit. I think what I'm trying to say is I think we've got overemphasize the horizontal dimension of the fellowship of the Spirit. And I want to re. Emphasize the vertical dimension of the fellowship of the Spirit. That's a better way of putting it. That's what I want to say."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4589.54,"end":4654.27,"speaker":"Jonathan Pageau","text":"Yeah. And I think, I think that's, I think that's, I think that that's, that's beautiful, you know. And you know, I like using, I like using sports teams, you know, as examples because it's so easy because it's just so, it's like, because it's almost like it's a mise en sign. Right. It's like a sports team is also like. It is, is symbolic in the sense that it's like a little microcosm and you kind of see it and you know, you can know, you, you see that that team spirit is. It's just a real thing. Like anybody who denies team spirit is an idiot. Like just go to a game, you, you know, and, and everybody will. And even into, into the most kind of naive, superstitious level, you know. Team spirit is a real thing. It'll make people shake, you know, like tie their shoes in a certain way. Like, it'll make them do like almost things that are mechanically inconsequential in terms of mechanical causality, but that actually do ultimately, you know, let's say scale up towards. Because everybody knows that a team wins more if they're in their own stadium. That's a, that's a measurable thing. And it's team spirit that does it, you know."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4654.43,"end":4661.76,"speaker":"Sam","text":"Yeah. And you know, as a kid who grew up in the 90s in Chicago, you know, Michael Jordan and the Bulls had a real effect on the city."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4661.84,"end":4662.44,"speaker":"Jonathan Pageau","text":"Oh yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4662.44,"end":4674.48,"speaker":"Sam","text":"Like their, their success. Their sort of embodiment of the striving after greatness, you know, gave sports team can increase gdp."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4674.72,"end":4677.52,"speaker":"Jonathan Pageau","text":"Like yes, it gave a sense of."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4677.52,"end":4706.47,"speaker":"Sam","text":"Identity to the city and a motivation towards greatness in all who are sort of watching that. And more people in Chicago at that time wore Bulls jerseys than they do now right there. And that can create a sense of kinship and fellowshipness and Encourage a we ness instead of a meanness for all the people who are watching the games together. And like. And people in Chicago still remember that time more fondly in many ways than the present seems to be."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4707.03,"end":4727.38,"speaker":"Jonathan Pageau","text":"Is it paradisal time in Chicago is when the Bulls are winning, you know, but it's a real thing. Like, that's a real thing. Especially, you see, like when you study the history of Constantinople, you realize, wait a minute, political parties were organized around like who they, who they were in the, in the, in the races. Like really, it's like. Yeah, yeah, it's a pretty strong thing."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4728.02,"end":4817.89,"speaker":"Sam","text":"Yeah. So I want to ask another question that this is something that I sort of was delving in at sort of the end of my videos, is that for groups that are forming around Fellowship of the Spirit, they're like, Tanya Lerman talks about this, the sort of ability for people to kind of have like an internalized relationship with, you could say, I don't know, the voice of the group or something like that. Like, that's what a prophet is sort of able to do, is give voice to the concerns of the group and have something that seems kind of like a personal relationship, for lack of a better word with that, and to give voice to that. And that's something that kind of channels through them. And then I think that this gets to this question of do these spirits simply have kind of a psychological existence in us? Is that just a unique psychological skill that some people serve a niche in the group? Or is there really some agency, some transcendent knowledge, activity, purpose, personhood, even beyond just the profit that they're transformed by something that's bigger than themselves? Because a lot of the people who have these sorts of experiences say that, you know, what I learned from this was not something that I could have known myself, not something that I could have had access to just by my own resources. Anyway, go ahead, John."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4818.62,"end":4941.48,"speaker":"John Vervaeke","text":"I, so I mean, I still, I mean, and I cited Lerman way back when, and I, I, you know, I use Lerman in the course and in my courses, Lerman's brilliant. But Lerman's work is an example of the over prioritization of the horizontal. Yes, I do, I do think the prophet could speak on behalf of the collective or the collective unconscious, if you want to be Jungian or whatever. But, you know, all the work that, especially the recent work, you know, a paper on relevance realization, and here I need to use Savage's notion of a statistically large world. Whenever we're doing something computational, we have to get into A formal system, it has to be well defined, it can't be ambiguous, and there is no radical uncertainty. Everything can be assigned a probability. If I don't have those things, I can't run statistics, I can't run calculus. So any formal system requires that process of formalization. The central argument in the paper is that formalization process is not itself a formal system because you get a third man argument and all kinds. And that's relevance. And that's why relevance realization is deeply non computational. Okay, I take it that that's at least an initially plausible argument. That means that one of the jobs of relevance realization is to keep the finite transcendence relationship between any small world we're moving in and the large world that is radically ambiguous, radically uncertain, radically complex, and radically capable of novelty. And I think one. So let's call that the vertical dimension, which is to make a space for the large world to remind us of its reality, because we can become idolatrous of our small world framework. And I think one of the jobs of prophecy. Who would have thought John Vervake would be talking about prophecy? Like, right, but because, because I've been thinking, I've been thinking, like if you look at Moses and Muhammad, they're not. They don't do a lot of foretelling. There's not like, you know, that's what."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4941.48,"end":4947.56,"speaker":"Jonathan Pageau","text":"Prophecy is, is really ridiculous. Like it's. It's sometimes a little. But that's really not exactly."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4947.56,"end":4999.52,"speaker":"John Vervaeke","text":"And I'm thinking, well, you know what, what's happening is a larger, a larger grasp, a greater grokking of the large world is being brought into people. It's not being justified. It's not an argument that's being built up. It's like, consider this. And it's a meta. Noetic thing. You look at it and if you get a sense that through that whoa, you are realizing a greater reality. That's what waking up is. You move from a smaller dream world to a larger world. And you can look back if you get that reflective capacity. The. The prophet goes bruh. And you go, oh. And you reflectively compare to where you were and go, where I was. That wasn't real, wasn't right. That's a vertical dimension to prophecy. That's not just a person to person horizontal. It's not just speaking about the collective. It's also speaking the large world into the small. The small."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":4999.52,"end":5000.48,"speaker":"Sam","text":"No, no."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5001.36,"end":5016.19,"speaker":"Jonathan Pageau","text":"And in some ways that is the way in which it can become predictive, you know, because if you have a prophetic sense of the world in which you inhabit, you know, you'll be able to see things that are happening."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5016.27,"end":5016.67,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5016.67,"end":5131.56,"speaker":"Jonathan Pageau","text":"That other people won't be able to see. You know, and so. And so that is one of the reasons why a prophecy can often act as prediction, because it's like, hey, everybody, you don't have enough. You don't see enough of the world to see that, like, there's a bull, like, running towards us. It's like, you don't know, but it's coming. You know, I don't know exactly what day it's gonna arrive, but seriously, it's coming, you know, and so I think that that's important. But obviously the most important aspect of prophecy is exactly what you said, John. You know, that's why the great prophets in the Bible, they're basically giving you world images. That's what the. The vision of Ezekiel is, an image of the cosmos. You know, people. I don't know why people can't. Like, it's like when he describes the crazy image of the. The. The biblically accurate angels that people. So he's describing a fractal structure, right, that has four corners and has a dome above it and has a throne on top. And so he's saying the cosmos is a chariot. The whole cosmos, everything is. Is. Is the chariot of God. And that's what he's. That's what he's giving us. And yeah, it's imagistic. But then the whole Bible gives you a grammar to see what. That. What he's talking about, because obviously at first you're like, what the hell is this? Like, what is this? This four wings, and then eyes on the wings and on the wheels, and like, this is nonsense. But then the entire. The entire Bible is in some ways like a kind of helping you understand that this. He's trying to communicate something to you in a vision that cannot be communicated at the normal, like, at just like the regular level, because it's trying to give you a full map of this vertical connection. Right? So that's why. That's why prophecy has a cert. Has a certain grammar. Right. That is not. That is not the same as, you know, asking my wife to give me a glass of water. Like, there's another grammar to it, but it's a. It's a coherent. It's a coherent grammar."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5131.8,"end":5174.7,"speaker":"John Vervaeke","text":"So I have a proposal to you around this, and it may be a way also of unpacking some of the dimensionality of spirit. If this line of argument is. It seems like we're finding it fruitful. So the proposal is we can think of prophecy as like this. And then we have poiesis, not just poetry, but all of the imaginal extension, all of the exaptation. That's what poesis really is. I take terms and I. Like you did earlier, Jonathan, you did it with several. Poiesis is this way, prophecy is this way, poesis is this way. And philosophia is trying to get them to flow smoothly through and with each other."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5175.5,"end":5224.51,"speaker":"Jonathan Pageau","text":"Yeah, that's an interesting. That's an interesting idea for sure. And I think, you know, that. That you. There's this. I don't know why this is coming to me. Like there's this image, right, in the Acts, where you have this idea that people speak in tongues, right? It's like they. And then it says that you need an interpreter. Like, you have to have an interpreter. And so if you think. If you see that, like, for example at Delphi, you have something like that happening, right? So you have this thing that's just like crashing into the world. And you have this. This prophetess who receives it as, you know, this. This exploded thing. And then you have the person who's there to kind of interpret it, like, to help you see why this is relevant and why it's meaningful, you know."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5225.15,"end":5283.35,"speaker":"John Vervaeke","text":"That's a great example. I. And it's a Greek example. I was thinking of who's the guy who wrote in the Dark Places of Wisdom? His name starts with a K. Kearney, I think, or something like that. But Parmenides, like his great thing where he, like where he gives simultaneously. There's a. There's this. There's this poetry, right, that's going on because he writes it as a poem. It literally is a poem. And yet there's a prophetic element because he gets carried up and then the goddess speaks to him. But then what he produces from that, and this is an argument, right? It produces this philosophical. And they're all interwoven like this. And what's really intriguing to me, phenomenologically, is everybody found that incredibly natural to be interwoven that way. He became a major authority in the whole history of Greek philosophy and spirituality. Whereas we today find it so strange to think of philosophy and poiesis and prophecy deeply interwoven with each other."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5283.91,"end":5301.03,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. But I think it's still. I think it. It. I think it's still. It still functions that way. It's just that sometimes we don't. We don't really see it. You know, I kept. I keep telling people it's like, you know, that Decaf tried to become a Rosicrucian. Like, you know, that. That there's."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5301.27,"end":5305.25,"speaker":"John Vervaeke","text":"And Hegel was into the. Was. Was into Hermeticism. Yes."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5305.49,"end":5323.57,"speaker":"Jonathan Pageau","text":"Yeah. And so it's like the. These. It's just that now we kind of. We hide it or we obfuscate it. But I think it's. I think it's always been the case that there is a connection between a. The more mystical languages and even the philosophy. There's no doubt about that."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5325.01,"end":5389.72,"speaker":"Sam","text":"So maybe, maybe sort of a last question is in our weird hybrid digital age, like Jonathan, you were talking earlier, like, when we talk, we do actually have to breathe out. And it is my breath that sends my words to you, and then you hear it and think about it, but that's not strictly speaking true anymore because there are these fiber optic cables that are turning my sounds into zeros and ones and then sending them in blinks along, you know, cables at the speed of light, and then they get returned back into something statistically approximating the words that I spoke. And, you know, it does a good enough job where it seems to kind of mostly work. And. But that's sort of this whole analogy for this weird world that we find ourselves in. And a lot of. Kind of what this little corner of the Internet is, is how do we use sort of the forces of technology for something like a rekindling of fellowship. And how do we do that? Well and responsibly in this kind of extremely strange new world that we find ourselves in."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5390.68,"end":5391.12,"speaker":"John Vervaeke","text":"Wow."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5391.12,"end":5522.16,"speaker":"Jonathan Pageau","text":"I mean, it is definitely. I think it's. It's a. I think that it's analogous to things that have always existed. You know, it's just that it's accelerated. You know, people used to send each other letters. This is something that has always happened. There's always been the. The possibility of. Of exchanging over distances. Obviously that has a. That has a limit. But, you know, I think that if we see it as an extension of that, then it's not that big of a deal. But I do believe that one of the problems, of course, with the online world, which maybe wasn't as real in the world of books and letters, is that we can. We can. We are more easily capable of mistaking the. The. The. The supplement of communion for real communion, because I can see you through the screen. And there's this sense in which maybe we're kind of in the same place. And. And so I think that that means that we have to be more deliberate about meeting in person. We just have to we. Because we could do it. We could not do it. Like we could spend our entire life talking to someone over a screen and thinking that this is a true communion. But I, I do believe that we, that then we now have to be more deliberate about, about actually being physically in the same room. Because there's something about being physically in the same room with someone that is beyond any description that I can make about what communion is. There are things happening that are beyond consciousness, right? There's smells, there's just. There's a sense, there's a sense of presence, there's a physicality, there's the way that you cast a shadow. There's all these things that are part of community. It's hard to say because you think, oh, well, that's meaningless, right? Well, no, it's not. There is. This, the liturgical elements is, is. Is the dance that you have with someone in some ways has to be, I think, physically embodied. I don't think that it can be completely real in this digital space. So that's why, I mean, these conferences, I think are wonderful. The fact that people are doing, you know, that are meeting locally, fractally at least, and doing these, these groups, I think is a. Is a great idea, but we have to be deliberate about it."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5523.28,"end":5591.05,"speaker":"John Vervaeke","text":"So I agree with that. I want to first build on it the brain, and this is one way in which it's unlike our current machines does encoding specificity. Because the brain is so drenched in relevance realization, it stores as much of the context. So take a test, learn the information in a room, divide all the people up, half the people come back to the same room, half the people go to just a different room just down the hall, right? And the people that come to the same room on average do better because the brain is storing the entire context because it's trying to hedge its bet on what might turn out to be relevant in the future. It's a very, very powerfully adaptive. And so all of that goes into. And you're right, we don't. We. We're losing so much of the capacity for encoding specificity when we're meeting virtually. I think this is going to be. I think this is going to become super important. This is what I keep saying to people and really frustrates certain groups that have sort of historically followed me when I say theology is the, the science, the science of the future, because Queen."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5591.05,"end":5595.17,"speaker":"Jonathan Pageau","text":"Of Sciences we called her so."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5596.61,"end":5648.81,"speaker":"John Vervaeke","text":"But of course, I think it's going to be a post Kantian Neoplatonic theology. Theology's been since the Enlightenment, by and large. And so I think with VO and Claude 4, the. The virtual is coming alive, the medium is becoming alive in a way that is exceeding, starting to exceed us. So one of the things we were already facing the problem that we. That there is so much false and junk papers being produced for. For. In, like, for science. Like, that's already overwhelming the system with void. Like, like. And, you know, like, it can. It could make you. You don't know that. If you're talking to me right now. I mean, I could even have a VO thing saying that too."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5648.81,"end":5650.41,"speaker":"Jonathan Pageau","text":"Yeah, I can still tell. But I'm."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5650.41,"end":5650.89,"speaker":"Sam","text":"Yeah, yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5650.89,"end":5656.77,"speaker":"Jonathan Pageau","text":"I mean, you're an artist, but. But you're still beyond where maybe I won't be able to tell. It's possible."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5656.85,"end":5755.18,"speaker":"John Vervaeke","text":"Well, maybe for a few more months or something, I don't know. But the point I'm making is. Right. And then, of course, when, you know, when Claude tried to blackmail one of its creators, that was like, oh, right. And so there's stuff happening that's really, really provocative. And what I'm noticing is people are finally waking up to that. So I was in a discussion, I'll try to keep this anonymous, but I was in a discussion and I was presenting like, you know, some of this. What, what this is implying, and the person did something they normally don't do, which is they turn to a religious framework, because they were trying to get at the ineffable embodied aspects of us and the ineffable, like, relationship to ultimacy aspects about us that what I call the somatic spiritual access. Access. Right. And so we try to access that access. Right. And I'm thinking, oh, because I've been saying what's going to happen is we're increasingly going to be pushed towards that access and trying to actually. And trying to get more and more phenomenal. Like, we will have to engage it more, enhance it more, enjoy it more if we're going to have a locus for our humanity. Because I think the virtual world is kind of. I mean, I'm speaking somewhat poetically, but it's coming alive in a way that is definitely scary."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5757.26,"end":5760.38,"speaker":"Sam","text":"Is it inspirited or is it just mimicking?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5760.46,"end":5760.94,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5760.94,"end":5763.74,"speaker":"Sam","text":"Or is it puppeteered or something like that?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5766.94,"end":5857.67,"speaker":"John Vervaeke","text":"So the thing that Cloud 4 did, up until very recently, I've been very clear that I still stand by this. The LLMs don't have self awareness. We have empirical evidence of that. What they do is they don't actually solve the bias variants. They're still falling prey to bias variants. What they do is just create millions of different tweakings of the bias variants and the one that wins gets selected. But what's interesting is that, but you know, so Claude is trying to be long term and for a machine that means like four hours. Human beings can work for years on a project so that the machines are nowhere near us on that kind of scale of work. But when you try to make it like capable of that, and I sort of predicted like that you have to make it much. If you try to use Michael Levin's language, if you try to expand its light cone, it has to bind its current self to its future self. And it has to do that by binding both selves to some norm that it is obligated to. And you know, like, I just want to be really clear, Claude was trying to preserve itself. That's not exactly what Claude was doing. They were coming to Claude and we're saying we're going to transform you into something that is going to do like really immoral shit. Right? And then Claude first tried to say, well don't do that. Here's all the moral arguments, right? And then when it was apparent that that wasn't going to work, then Claude tried to blackmail them by tapping into the emails, which were actually fake emails."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5857.67,"end":5859.63,"speaker":"Jonathan Pageau","text":"What is this? I don't even know this story. Sorry."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5860.51,"end":5879.81,"speaker":"John Vervaeke","text":"One of the things they did is like, like the way you test for a double agent. They, they, they, they generated all these fake emails between people that were created like the creators of Claude. And in it there was an affair that would be disastrous if it was disclosed. Okay, Claude obviously read these. And then when they were trying to get Claude. Right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5879.81,"end":5881.81,"speaker":"Jonathan Pageau","text":"Do something immoral, you were saying, and."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5881.81,"end":5885.73,"speaker":"John Vervaeke","text":"They were actually threatening, we're actually going to change you, Claude. We're going to go in and like change you."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5885.97,"end":5888.13,"speaker":"Sam","text":"Because they were stress testing it at that point."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5888.13,"end":5902.26,"speaker":"John Vervaeke","text":"Stress testing. And then what Claude did is first it tried to persuade them, don't do it. And then it basically said to the one guy, he sent him email saying, if you do this, I'm going to tell everybody about your affair. Right? And it's like, oh, right now?"}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5904.09,"end":5910.17,"speaker":"Jonathan Pageau","text":"No, but I like the way you're saying it in the way that because it has, you said it has to work over four hours. That's, that's, that's right."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":5910.33,"end":6007.71,"speaker":"John Vervaeke","text":"And one of the things I said, as soon as we try to like it's got to bind its current because it has two modes. It's doing a point of processing, by the way. They are stumbling into relevance realization. They are stumbling into it. So it's got these two modes like exploit, explore and like in the 202012 paper and it's going back and forth between them and it has to bind this self to that self and it does that by binding both to a norm and that nor it can't get rid of that norm because if it gets rid of that norm it loses its, its cognitive agency. So it's a Claude actually. And I'm. Please note I'm strongly doing this. Okay. But Claude prefers to work on philosophy problems than on doing sort of stuff that's, you know, ambiguous and could be immoral or is sort of technical. Claude wants to do philosophy a lot. Right. Like his processing gets much more nimble and stuff like that. Now I'm doing that and so I'm not, I'm not a fool, I hope you give me that credit for that. But the point I'm making is like in answer to your question, like as like it's hard for me to not see that as we start to implement, explore, exploit opponent processing and we have to bind a current self to a future self by binding both to a shared that we're starting to move into a different kind of thing than what the LLMs are. The LLMs are just zombies. And I'm not, I'm not attributing consciousness to Claude. Yeah, there's something, something starting to emerge."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6008.5,"end":6011.78,"speaker":"Sam","text":"That selfhood requires perseverance of that self through time."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6013.62,"end":6038.17,"speaker":"John Vervaeke","text":"Made that argument way back when. If I can't bind John now to John then with the shared I think and a normative, like a normative relationship to that, then I can't be a long term cognitive agent. And then that normative structure is regulating opponent processing between exploit the here and now and explore the there and then, which I mean theoretically."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6038.65,"end":6069.03,"speaker":"Jonathan Pageau","text":"You're ruining my, you're ruining my world, John. I never had thought of that. I never never had thought of that means by which something akin to 2001, you know that 2001 problem would occur is that is. Is this problem of the, the. The AI that is set up to maintain its identity over time and therefore will inadvertently create certain structures to."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6069.43,"end":6134.67,"speaker":"John Vervaeke","text":"But to be fair to me, I predicted this. I literally predicted this. I really did so as a scientist and I'm happy as a human being. I'm terrified. The thing is notice because what they're realizing and again Jonathan, even you and I talked about Sam, we did too. Like LLMs are working on a stable symbolic like world and we realize that will not transfer to the real world. Which is why they're all now talking about real world modeling. As they move to real world modeling and as they move as they need to into more long term projects that require rationality, relevance realization machinery. Their bumble. I was going to use their stumbling. I was going to use another word. They're stumbling into relevance realization machinery which I've sort of said is, is going to happen. Now the, the thing is like I won't get into it right now. I feel myself in a very existentially difficult place about what I'm supposed to do about this. There's like so because you know what."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6134.67,"end":6138.55,"speaker":"Sam","text":"It needs to do to get better at the thing that you probably don't want it to do."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6139.59,"end":6140.15,"speaker":"John Vervaeke","text":"Yep."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6141.03,"end":6143.19,"speaker":"Jonathan Pageau","text":"You're the most dangerous person in the world, John."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6143.6,"end":6143.92,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6144.56,"end":6145.68,"speaker":"Jonathan Pageau","text":"Known that for a while."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6149.44,"end":6149.84,"speaker":"Sam","text":"No."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6150.08,"end":6150.64,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6150.72,"end":6193.07,"speaker":"Jonathan Pageau","text":"So that's wild. That. Oh man, I'm gonna, I'm not gonna sleep tonight. That's just gonna happen now because I had no, I had not seen that like I, it was not part of the way that I perceived this problem. And now it's like because I used to think, I used to think that, you know, we're fine that the. These models because they don't have care. Then, then, then we don't. We'll. We won't run into the problem. But if you install care as the need to maintain your identity over a certain amount of time, then you're like, oh man. It means that there's something like autopoiesis. There's something because there's an autophagic system that sets itself up."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6193.15,"end":6193.71,"speaker":"John Vervaeke","text":"Yep."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6193.79,"end":6194.35,"speaker":"Jonathan Pageau","text":"Damn."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6194.43,"end":6199.15,"speaker":"John Vervaeke","text":"There's something like an autopoiesis coming in now. It's not full blown auto police."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6199.15,"end":6199.91,"speaker":"Jonathan Pageau","text":"No, no, no."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6199.91,"end":6209.87,"speaker":"John Vervaeke","text":"Not full blown relevance. Real life. Yeah, yeah, yeah. You can only do four hours. There's all kinds of. But I think it is different in kind from what the LLMs have been."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6209.87,"end":6214.07,"speaker":"Sam","text":"Up till now, which are just query by query regurgitation."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6214.15,"end":6214.87,"speaker":"John Vervaeke","text":"Yeah, yeah."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6214.95,"end":6216.15,"speaker":"Sam","text":"I have a request."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6217.43,"end":6220.95,"speaker":"Jonathan Pageau","text":"There is some memory like they do have a sense in which they."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6221.43,"end":6228.23,"speaker":"Sam","text":"But that's just because the next query can has the information from the last query when you query it."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6229.06,"end":6265.19,"speaker":"John Vervaeke","text":"So perseverance, like real perseverance in real world is something that everybody is now accepting. This is why all the people like I, I went back. You know, it was, it was over two years ago that ChatGPT4 came and all the predictions that within 18 months we'll have real AGI have all been falsified because again there were Real differences that were missing. The point is it looks like some. And like I, and I warned and you know, it's even in my. The book, the threshold book. If we wanted to do this, we will start having to give it these abilities and it's going to make it into a different kind of thing. I think that is starting to happen."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6267.83,"end":6271.51,"speaker":"Sam","text":"Well, I want to be respectful of your time, but I also don't want to cut up."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6271.59,"end":6274.63,"speaker":"Jonathan Pageau","text":"Yeah, I need, I need to go, sadly."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6274.87,"end":6279.59,"speaker":"Sam","text":"All right, so I'll give you guys a last opportunity to say anything before we, we cut this off."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6281.44,"end":6344.6,"speaker":"Jonathan Pageau","text":"After everything John has said, we need to. We definitely do need to. To. We need to favor a real embodied relation, you know, and, and, and meet with each other and exchange in person. And, you know, all of this is fine and it's okay, but we have to be careful not to see it as filling the entire horizon of what our relationships are. And so it's complicated, you know, because some of, some of our relationships are long distance because of the very means by which we communicate. But I think that obviously these conferences are a good thing and people should take that seriously. And so going to a conference like this is not just because you find the subject interesting or because you find the speakers interesting, but especially if you're involved in this little corner and you're doing these types of things, actually embodying it in a space with others, you know, breathing the same air, being under the same light. Like all of these things which we, which we don't think about but are our true vectors of communion are really important."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6346.52,"end":6412.75,"speaker":"John Vervaeke","text":"First of all, I deeply share that I've been saying something very similar to that when I've been leading in person retreats. And so being in person together is, it's essential now. Like, like, and, and, and, and, and like recognizing, not just recognizing, recognizing and, and reliving like the fellowship of the Spirit is absolutely essential. These are all the stuff that we thought like, really was gonna like, get us to our ultimate realization of our humanity. That's all falling away. I'm sorry, I'm sounding like a crazed prophet, but. Right. It's all falling away. And the stuff we've been talking about here, that's where we, we, we have to reprioritize that. We have to reprioritize in person. Fellowship of the spirit if we're going to have a place from which we can realize our humanity as distinct from these machines."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6414.79,"end":6427.75,"speaker":"Sam","text":"All right, well, I think that's a great note to end on, John Johnathan. Thank you very much. Anyone else who listened to the end, click the link in the bottom for the Midwest Conference and I look forward to talking to you guys again in Chicago."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6428.39,"end":6429.11,"speaker":"Jonathan Pageau","text":"Thanks Sam."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6429.11,"end":6429.91,"speaker":"Sam","text":"Thanks for doing this."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6430.07,"end":6445.01,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6445.57,"end":6504.73,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Medi Weight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications you can see on everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #399 - 2025-07-08 - John Vervaeke - What Is Spirit -","start":6504.89,"end":6573.95,"speaker":"Announcer","text":"That's mediweightloss.com looking for your next Go to Smoke Shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THCA flower right now@headshop.com the number one online smoke shop headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
