{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":0.08,"end":82.02,"speaker":"Jonathan Pageau","text":"Hi, I'd like to welcome you to the 14th episode of the Symbolic World podcast. In this episode I am going to play for you a discussion which was originally posted on Jordan Peterson's YouTube channel called Intersectionality, Individuality and the Hero. The talk actually starts in mid sentence because Jordan called me in the morning and he had all these crazy ideas he wanted to work through and so he just kind of pressed record in the midst of the discussion. So you get all the rawness of a full on discussion that we had. And so we go through a lot of stuff and. Yeah, I hope you can enjoy. So this is Jonathan Peugeot. Welcome to the Symbolic World. So people are taking it seriously. That's good. It's good. I say that, but you're the one who has to deal with the pain and the pressure, so."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":82.18,"end":99.48,"speaker":"Jordan Peterson","text":"Yeah, well, I'm in a permanent state of being freaked out. So then I woke up this morning with all these ideas that I wanted to talk to you about. All right, okay, so let me pull up the emails that I sent you. Yeah, let me look at them at the. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":107.16,"end":114.68,"speaker":"Jonathan Pageau","text":"Okay. So one of the things. Did you want to talk first just to. Just to get our ideas straight? Or maybe I can. I also want to comment on some of the things you wrote."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":114.92,"end":115.48,"speaker":"Jordan Peterson","text":"Go ahead."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":116.55,"end":118.71,"speaker":"Jonathan Pageau","text":"One of the things, one of the difficulties."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":118.71,"end":120.07,"speaker":"Jordan Peterson","text":"I'm recording this, by the way."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":120.07,"end":121.27,"speaker":"Jonathan Pageau","text":"Are you recording this already?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":121.59,"end":123.35,"speaker":"Jordan Peterson","text":"Yeah, well, I can always edit it afterwards."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":125.51,"end":219.6,"speaker":"Jonathan Pageau","text":"Well, then maybe you should. Then maybe you should speak first because that way when I talk about the kind of the questions that I have, especially in regards to the cross. The cross is really complicated. It's a complicated. It's like it's meant to be a mystery. And, and so the way it's presented to us, it kind of breaks all the categories in a way, or it unites them together. You can rather see it that way. And so it's difficult to talk about the cross because it's both totally on the inside. It's the center of the world, it's the axis of the cosmos, it's all those things, but it's also at the edge of the world because even in the story it's brought outside. Crucifixion happens outside of the city, it happens on the Mount of the Skull. And also there's a verse in the Psalms that says that the just will never hang on a cross and so will never hang on a tree. It doesn't say cross, but the just will never hang on a tree. So there's an aporia in the cross which is that Christ is the just who's hanging on a tree. That's actually one of the reasons why Jews have never accepted Christ as the Messiah, because they can't deal with the absolute, like, paradox of having the perfect man hanging on a tree. And so it's like, how do those two things. But for a Christian, it's really bringing together the extremes. I talked about that before. Well, I think that Christ really isn't the top of the hierarchy, but is really the stretching out of the hierarchy from the top to the bottom."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":219.68,"end":225.4,"speaker":"Jordan Peterson","text":"Yeah, yeah. Okay. So. So all right, so we'll get to that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":225.48,"end":226.56,"speaker":"Jonathan Pageau","text":"All right. Yeah, yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":226.56,"end":236.52,"speaker":"Jordan Peterson","text":"Because I think that's a. That's. That's an interesting way of conceptualizing the potential solution to this problem."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":236.92,"end":237.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":237.28,"end":246.36,"speaker":"Jordan Peterson","text":"Okay. So Derrida had this concept of undecidability. Right. There were these things that existed on the margins that didn't fit into a category system."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":246.77,"end":247.17,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":247.49,"end":277.17,"speaker":"Jordan Peterson","text":"And we've talked about that before. And that seems to me to be very much associated with the idea that I developed in maps of meaning of anomaly. And the anomalous is the monster. And the reason the anomalous is the monster is because there's a very large number of things that won't fit into any category system. Doesn't matter what the category system is. There's the things inside the category system or the category, and there's the things outside. And there's a multiplicity of the things outside."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":277.65,"end":278.13,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":278.37,"end":284.85,"speaker":"Jordan Peterson","text":"And so the monster image is an appropriate image to represent that. Because a monster is a chimera that's made up of parts."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":285.01,"end":285.89,"speaker":"Jonathan Pageau","text":"Yes, exactly."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":285.97,"end":300.42,"speaker":"Jordan Peterson","text":"Okay. And you always have to confront what stands outside the category system. Yeah. And it looks to me like we use our predator detection and defense systems as the first defense against that. The first reaction against that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":300.5,"end":300.86,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":300.86,"end":305.38,"speaker":"Jordan Peterson","text":"Because it's. It's an archetypal reality that there are things outside the category system."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":305.46,"end":322.7,"speaker":"Jonathan Pageau","text":"Yeah. But it's actually, I think that in terms of phenomenology, I would say, I don't know, maybe you can actually, you can illuminate this in terms of evolutionary biology, because I'm not an expert in that at all. But it seems that there's both. The the predatory aspect, where it's. Where the. The."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":322.7,"end":322.98,"speaker":"Jordan Peterson","text":"The."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":322.98,"end":329.81,"speaker":"Jonathan Pageau","text":"The monster, the anomaly is seen as something to defeat. But there's also an aspect which is the desiring aspect."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":329.81,"end":333.21,"speaker":"Jordan Peterson","text":"Yeah, right, Right. Well, that's the dragon with the gold."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":333.61,"end":379.79,"speaker":"Jonathan Pageau","text":"Yes. Or the siren. The siren. No, the monster itself. Like, there's something about the siren and about the idea of Lilith for Example in Jewish mythology, this notion of, like. Or the incubus, you know, the idea of the female demon which allures and brings you out of yourself and kind of makes you kind of waste your seed in a Christian. In, like, a religious idea where it's as if there's something about the outside or the foreign or the. Which elicits a desire to move out towards it. I think you kind of talk about that when you talk about this notion of the snake that appears, let's say, amongst a group of chimpanzees."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":381.4,"end":401.04,"speaker":"Jordan Peterson","text":"Fascination with it. Yeah, yeah. That's the fascination of the unknown. And neurobiologically, that's associated with the positive aspect of exploration. So that's. Yeah, so, yeah, it's a paradoxical situation because if it's unknown, you want to be afraid of it because it might eat you. But because it contains new information, let's say, you also want to approach it. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":401.04,"end":440.25,"speaker":"Jonathan Pageau","text":"And that's really. I think it's important, especially now in, like, our situation, to understand the desiring aspect because it can explain a lot of the strange phenomena that, you know, that turn around sexuality in terms of all the strange fetishization of sexuality into, you know, sometimes it's opposite, you know, like the weird scatological fetishes that people have and, like, the strange. Like, it's as if there's something about the outside or the monstrous or the discarded which can also, in a certain instance, if people let themselves go, will pull them into a desire relationship with that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":440.41,"end":450.09,"speaker":"Jordan Peterson","text":"Well, one of the things you do find is that sexual release, like orgasm, is potentiated by novelty. So that's a good example of that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":450.49,"end":507.66,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And if you kind of go down that route, it can lead you into. There's no limit kind of to where it can lead you. And it can explain. I think it can also explain kind of like now we're in this weird paradoxical situation in terms of society where since the 60s, people have been telling us, you know, that emphasizing that aspect, the idea that novelty will increase pleasure, let's say, bring you further into pleasure. But then realizing that if you go down that road. Now we're kind of realizing, you know, it's like, oh, now we're surrounded by sexual perverts and we're wondering why we're surrounded by sexual perverts. It's like, well, maybe you led them down that road. And. And that road doesn't necessarily lead to just sunshine and rainbows. Like, it leads to very dark places which include a lot of violence and a Lot of an exploration of animosity and a mixture of desire and hatred and all those very strange things that people kind of let themselves fall into."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":507.74,"end":511.82,"speaker":"Jordan Peterson","text":"Yeah, well, you might say that that's in some sense, the story of Foucault's life."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":512.14,"end":542.83,"speaker":"Jonathan Pageau","text":"Yes, exactly. I mean. Yeah, we've talked about that before, that if. If you look at Foucault's life, he's almost like a microcosm of what's happening today in terms of his radical exploration of power and sexuality, but also the idea of the constant stranger and the constant anonymity of sexual encounters. I think that for sure, I see him really as someone to look at in terms of understanding the tone of what's happening today."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":543.12,"end":549.2,"speaker":"Jordan Peterson","text":"Yeah, yeah. Seems to me to be the case. It's interesting, too, because Foucault and Derrida didn't care for each other."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":549.6,"end":550,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":550.08,"end":567.36,"speaker":"Jordan Peterson","text":"And, you know, Foucault basically regarded Derrida as a trickster, as a wordy. Excuse me, as a wordy trickster, and. Yeah, but their ideas fall into alignment with regards to the notion of the excluded, as far as I can tell."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":567.6,"end":642.24,"speaker":"Jonathan Pageau","text":"Yeah. Well, the thing that. The difference. I would say with Derrida, I find Derrida more useful in terms of. You know, I've talked about this in my different. Talks about this notion that what's upside down can be turned back on its head, turned back on its feet. And I think that Derrida is more useful to play that game where you can use him and some of his categories to include them in a larger frame, let's say, so that his ideas are included in a more complete vision of reality. Because he has, like. He really shows the real. His way of thinking really shows the real danger. The real problem of postmodernism. Like, you know, you talk about that often. Like, how is it that there's this contradiction? For example, his philosophy has been described as, like, the philosophy of hesitation, you know, and that makes total sense because, you know, when you're faced, he has this notion that you're faced, you know, in this slipping and sliding analysis of the world, where all the reality multiplies itself is deferred, that things always point towards the future. So you never know exactly what something is because it keeps changing and it keeps slipping into something else. And so that actually leads."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":642.4,"end":644,"speaker":"Jordan Peterson","text":"Which is true. Things do that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":644,"end":693.63,"speaker":"Jonathan Pageau","text":"Exactly. But that actually leads to this hesitation. And if you've ever seen an interview with Derrida, you'll see it in his demeanor. He's constantly hesitating. He's Hesitating to speak because he's always kind of like, he doesn't know. He realizes that he doesn't know the total implications of what he's about to say all the time. So he's always like. He's like. He's constantly cautious and cautious and cautious. And so it seems like that's actually what should be normally derived out of the kind of postmodern idea that meaning cannot be contained. Whereas Foucault, he really used the kind of inverted idea of truth, the idea of the truth of the marginal, where you can use marginality as a weapon to destroy, let's say, the current order."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":695.47,"end":699.11,"speaker":"Jordan Peterson","text":"Okay, so you think that's more attributable to Foucault than to Derrida?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":699.11,"end":734.83,"speaker":"Jonathan Pageau","text":"I think so. Well, Derrida does it too. But what he does, it's weird because he'll use the marginal to kind of deconstruct the. The center, let's say. But then he'll also kind of. In the same way, he'll also say. He'll also. He'll, like, reverse it and then annihilate his reversal. So you end up really, in this slippery slope where you don't even know where you're standing. And so, in my opinion, that's useful because it helps you to see the. Actually, it kind of. In the end, it points back towards logos. It points back towards logos in the sense that, like we talk about, you can't live in a world like that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":734.83,"end":804.28,"speaker":"Jordan Peterson","text":"Okay, so that's exactly what I want to develop today. Okay, so the first thing that I thought of today is that, okay, so we have this issue of undecidability from Derrida, the thing that doesn't fit in the category. Yeah, okay, now, and we know that if you have a category, there's way more outside the category than there is inside the category, because otherwise the category isn't very useful. Right, right. And so Derrida talks about that as. And I think Foucault, too, at least alludes to it, is that they kind of make the case that the purpose of the category system is to exclude, and then they make a political case out of that as well. And the thing is, the purpose of a category is to exclude. It's to exclude an infinite multitude, because you can't deal with an infinite multitude. And so you have to simplify the world. You have to categorize the world in order to act on it. So then the ultimate question has to be something like, by what principle do you. Or what principle guides your categorization of the world. And that seems to me to point back to the logos in exactly the way that you just described, because I would say the logos is the divine principle of categorization, Something like that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":804.36,"end":828.09,"speaker":"Jonathan Pageau","text":"Well, there. There are two. There are actually two ways to do it. There. There's. I think that I talked about it. Talked about. Talked about this in Vancouver. It's like there's either. There's three possibilities. There's either the logos. There's either absolute dissemination, which is this kind of the. The idea that something will just kind of dissolve. It dissolves into uncertainty."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":828.09,"end":828.49,"speaker":"Jordan Peterson","text":"And."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":828.57,"end":857.55,"speaker":"Jonathan Pageau","text":"And it's important to understand the result of that. The result of that isn't that it'll just stay in this kind of shaky uncertainty. The result of that is that something else from the outside which has solidity is going to ram through it. And I think that's something that Degida didn't account for. You know, for example, I don't think Degida accounted for Islam, for example. It's like he thought, well, if we're all. If we all. If we're all kind of in this slippery, slidey situation, without firm identities, then we have no reason to fight."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":857.79,"end":858.11,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":858.11,"end":858.79,"speaker":"Jonathan Pageau","text":"That's kind of like."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":858.79,"end":859.35,"speaker":"Jordan Peterson","text":"Yeah, right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":859.35,"end":860.23,"speaker":"Jonathan Pageau","text":"That's like the positive."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":860.23,"end":862.11,"speaker":"Jordan Peterson","text":"Maybe we have an infinite number of reasons to fight."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":862.11,"end":872.39,"speaker":"Jonathan Pageau","text":"Yeah, maybe. Exactly. Or maybe we have an infinite number of reasons to fight. But he didn't see, like, that something on the outside, but which has strength will just then just come right through that and."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":872.39,"end":873.63,"speaker":"Jordan Peterson","text":"Yeah, well, absolutely."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":873.63,"end":874.19,"speaker":"Jonathan Pageau","text":"Annihilate."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":874.19,"end":879.27,"speaker":"Jordan Peterson","text":"Absolutely. Well, I think he thought he. He was probably Eurocentric in his outlook."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":879.35,"end":882.31,"speaker":"Jonathan Pageau","text":"Yeah, maybe. That's hilarious."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":882.47,"end":886.23,"speaker":"Jordan Peterson","text":"It is. It's really hilarious. Yeah, it's really hilarious."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":886.47,"end":889.83,"speaker":"Jonathan Pageau","text":"Okay, so we talked about undecidability."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":890.07,"end":890.51,"speaker":"Jordan Peterson","text":"All right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":890.51,"end":955.52,"speaker":"Jonathan Pageau","text":"One thing about undecidability that we need to mention, which makes it more complicated, is that undecidability also has to do with time. And so it has to do. And this is something actually that you have in common, I think, with Derrida, which might be funny to say, but the idea that something. Let's say you talked about that in example, you said, like, when Ford created the car, he didn't know what it was, because, let's say the totality of what the car represents is manifesting itself in time, manifesting itself in, like, urban landscape, in the way we understand economy and in the way. And so the ramifications were so big that you could never really know what a car is called. That's what Derrida talks about in terms of the deferral of meaning in time. So there's the idea of difference in terms of. That there's categories and that they're defined by their opposites and by their. They're outer categories. But then there's also this idea of time that makes it more complicated, too."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":955.6,"end":963.6,"speaker":"Jordan Peterson","text":"Yeah, well, what that means is that what a thing is depends to some degree on the spatial and temporal context within which you're interpreting it."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":964.16,"end":965.36,"speaker":"Jonathan Pageau","text":"Yeah, you could see that way."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":965.44,"end":1019.06,"speaker":"Jordan Peterson","text":"Yeah, yeah. I had a dream about that at one point. I don't know if it's a digression. I don't care. I'll tell you anyways. So I dreamt. This is such a strange dream. I dreamt that there was this ball floating above the Atlantic Ocean, and it was just zooming along about, you know, six feet above the surface, just cruising along. And it was so powerful that it was accompanied by four hurricanes, one in each quadrant surrounding the ball. It was only a little ball. And that was the first part of the dream. The second part of the dream was like a view of satellites and a bunch of scientists who were monitoring the hell out of this thing, trying to figure out what it was. The third scene was this thing was trapped in a room. It was like, in a Victorian museum case, you know, a wood case with glass, and it was sitting up there, like, suspended in midair inside the case."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1019.54,"end":1020.26,"speaker":"Jonathan Pageau","text":"The same ball?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1020.42,"end":1046.47,"speaker":"Jordan Peterson","text":"The same ball, yeah. So they captured it, and so then it was in the room. The room had no doors or windows, and in the room there was the President of the United States and. And Stephen Hawking. And so that. And then the room was made out of titanium dioxide. I remember that from the dream, which turns out to be the stuff that the hull of the Starship Enterprise is made out of. It's something like that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1046.47,"end":1047.79,"speaker":"Jonathan Pageau","text":"Something like that, yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1047.79,"end":1081.43,"speaker":"Jordan Peterson","text":"Yeah, it was something like that. And so the idea was that this intensely powerful thing had been put inside a category system, right? So it was inside a museum display case. And then there was the President there, sort of representation of social order. And Stephen Hawking, he was a representation of disembodied intellect. And then there was the room itself, which had impenetrable walls. They were like six feet thick. So it was like we got this thing, and then I was watching, and it turned into a chrysalis, so obviously. Which is something that can transform, right?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1081.43,"end":1081.99,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1081.99,"end":1093.23,"speaker":"Jordan Peterson","text":"And then it turned into a meerschaum pipe. It took me about a year to figure that out. It was an allusion to that famous painting by Magritte."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1093.23,"end":1093.87,"speaker":"Jonathan Pageau","text":"Right. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1093.87,"end":1094.79,"speaker":"Jordan Peterson","text":"This is not a pipe."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1094.79,"end":1097.27,"speaker":"Jonathan Pageau","text":"This is not a pipe. Yeah. That Foucault actually liked quite a bit."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1097.27,"end":1100.67,"speaker":"Jordan Peterson","text":"Yeah, yeah, yeah. And then it shot out of the room like there was nothing there."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1100.99,"end":1103.11,"speaker":"Jonathan Pageau","text":"Interesting. Yeah. That's a great dream. Wow."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1103.11,"end":1111.95,"speaker":"Jordan Peterson","text":"It was a great dream, man. And so. And it does allude to this idea that you can't capture the thing permanently in a category system because it shifts and turns."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1112.19,"end":1113.15,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1113.47,"end":1126.65,"speaker":"Jordan Peterson","text":"So, okay, so fine, so we're on board with that. All right, so now the category has to exclude because reality is so complex that you have to categorize it because otherwise you're swamped. Yeah, it's good metaphor for it."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1126.65,"end":1132.49,"speaker":"Jonathan Pageau","text":"Yeah. And I think that's something that the postmodernist or derida didn't totally see the. The extent to which that could be."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1132.81,"end":1141.29,"speaker":"Jordan Peterson","text":"Right, right, right, absolutely. I think he put. I think he thought that order was a lot more solid than it was."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1141.61,"end":1142.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1142.82,"end":1251.32,"speaker":"Jordan Peterson","text":"So. So. Or than it is. So then I was thinking, okay, so now in with identity politics, you have the politics of the excluded, alright? So, so then you have people excluded because of race or because of gender or because of sexual identity or whatever. And one of the problems we've seen with that is that the number of excluded keep multiplying. That's why you get that extension of the letters in the LGBT acronym. Right. And there doesn't seem to be any limit to that. And the reason for that is there is no limit to the number excluded because it's. The category of excluded is the category of all things that don't fit in the category system. And that's an infinite set. Right? Yeah. Okay. So, but then I woke up this morning and I thought, well, we could do. We could calculate that mathematically. So, because. Because of. I was thinking about the rise of intersectionality, because the rise of intersectionality is actually the reoccurrence of the individual within the collective ideas of postmodern neo Marxism. Because you might say, well, I'm excluded because I'm black, or I'm excluded because I'm a woman. And then someone puts up their hand and says, well, those two categories don't include black woman. They don't include the intersection of the. Of the two categories. And that there's no reason that black and woman is more important than black woman. Okay. So then I thought, all right, so that's fine. So the problem is, is that you start to get smaller and smaller numbers of people as exemplars of the categories that are excluded. So then I thought well, how many categories do you need to add in an intersectional analysis before you're actually down to one in a billion? Because you do fractionated down to the individual."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1251.4,"end":1251.8,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1252.44,"end":1312.61,"speaker":"Jordan Peterson","text":"So now it's kind of screwy mathematically because it depends on the gradations of your category system. Right. I mean, I could call you old or young. That'd be binary. Right. But I could say, no, no, you're on a scale from 0 to 100. So that would, that would be. That would give you a.01 probability of. There'd be a hundred groups that you could belong to in age. So I thought, well, let's just use a hundred as an example because it could be two or it could be 10,000. It's arbitrary because we could say that, well, I'm 41, and, and there's advantages and disadvantages that go along with that. But someone else could say, well, I'm 41 in six months. And there's a slightly different set of advantages and disadvantages that go along with that. So anyways, if you have six categories with a probability of 0.1, then you're one in a billion. So you just need six dimensions of intersectionality before you fractionated the population down to the level of the individual."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1312.61,"end":1313.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1313.73,"end":1324.05,"speaker":"Jordan Peterson","text":"So that means the individual comes sneaking back into the collective ideas of postmodernism once you hit six intersectional categories."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1324.62,"end":1325.26,"speaker":"Jonathan Pageau","text":"That's interesting."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1325.66,"end":1514.59,"speaker":"Jordan Peterson","text":"I thought that was really. Well, it's ridiculously amusing. So I said, this will do the trick. So if you're multiracial, woman who's bisexual, 27 years old, smart, 30th percentile for attractiveness, 10th percentile for familial wealth, and 80th percentile for education. There's, there is the. You're the only one in the world like that. That's hilarious. So, okay, so then I was thinking, okay, so now then I was also thinking about this from a scientific perspective. So the reason you assign. If you're going to do an experiment on two groups, you know, you, you do something to one group and not to the other group. But to make the control group proper, you have to assign randomly to each group. And the reason you do random assignation is because there's an infinite number of variables you can't control for. And so you assign randomly so that infinity cancels, cancels itself out. And the only difference you're left with is the experimental condition. And then. But scientists sometimes try to get around that. Like we used to study people who were sons of alcoholics and multi and they had a multi generational family history of alcoholism. And then we were trying to figure out what might distinguish them from a normal person, let's say. So we try to get a control group to contrast them with. So we bring them into the lab, say, and give them alcohol and give the control group alcohol. But the problem was we didn't know what to control for, like, because alcoholism goes along with antisocial personality disorder. So do you control for that? Mm. Do you control for education? Do you control for iq? Do you control for socioeconomic status? Like, the answer is you don't know because you don't know how those are associated with the alcoholism. You can't know. And so you guess, and then you do an analysis of covariance. But the problem is, is that you don't know what to covariate, which is why you need random assignation to groups. It's the only way of solving that problem. Okay, so the same problem of undecidability in some sense pops up very, very frequently in clinical research. Same thing happens if you're trying to figure out schizophrenia. You need a control group. Well, how about siblings? The siblings who don't have schizophrenia? Well, yeah, except they have a different genotype. You know, it's an impossible problem to solve fundamentally, which is why you need random assignation to groups, because you can't control for all the variables. You can't know in advance what's relevant. All right, so then I had this. So I thought that was very funny, that the idea of individuality comes back inevitably with intersectionality. Yeah, it's. It's just. You just push intersectionality to six dimensions and bang, you're down to the individual. All right, so then I had this little vision. So I'm going to tell you the vision. Okay? All right. All right. So imagine a pyramid. Like, imagine a plane first, like a place in a place, a land, but flat. And then imagine a pyramid."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1514.67,"end":1515.15,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1515.55,"end":1523.62,"speaker":"Jordan Peterson","text":"And then around the pyramid, some distance from it, is a wall. Okay? So think about that just as the basic scheme of a walled city."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1523.7,"end":1524.26,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1524.42,"end":1546.27,"speaker":"Jordan Peterson","text":"Okay. Now, the pyramid is the group that's in there, let's say, and the value structure that that group orients itself by. Okay? Now, outside that wall, there's a very large number of other pyramids, and that's basically the postmodern world. I would say that's kind of the world that Derrida described. And Foucault. Is that reasonable? Hmm."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1547.23,"end":1575.95,"speaker":"Jonathan Pageau","text":"I don't. Yeah, I mean, continue your example. I think. I think that. I think that for sure that Derrida would say. Would say something like. Would talk about the problem of the contained. Even the contained space. You know, the idea of the wall and the pyramid. Like, he would. He would have. He would have a problem. He would have a problem with that structure itself. Like, for him, that would be. That would be. It wouldn't be a solid structure."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1575.95,"end":1582.07,"speaker":"Jordan Peterson","text":"Right. No, it would ebb and flow with time. Yeah, right. That's okay. We'll get to that. That's okay, fine. That's no problem. Let's say that is the problem."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1582.31,"end":1582.67,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1582.67,"end":1608.46,"speaker":"Jordan Peterson","text":"Okay. So you added another dimension to it. The problem is there's an inside and a wall and an outside. That's problem number one. The outside excludes. We could call that problem number two. Problem number three is that the center will not hold. Right, right. And that's the same problem, as far as I'm concerned, as the serpent in the Garden of Eden. Yeah. Okay. Okay, good, good. So. So let's say that really is the problem. I mean, fundamentally."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1608.7,"end":1611.82,"speaker":"Jonathan Pageau","text":"Yeah. Usually if you go back to the Garden of Eden, you find the problem somehow."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1611.82,"end":1719.77,"speaker":"Jordan Peterson","text":"Yeah. Okay. Okay. So now. Now imagine that outside the. Outside the wall, all those pyramids fragment, and they fragment down to the level of individual people. So they decompose to the level of individual people. Yeah, because that's how much variability there actually is. Right. Because those groups were artificial constructions. Right. And so you can fragment them down to the individual. Okay. So now the question is, you want to let some of those people into the enclosed. Okay. Now, next part of the vision, the pyramid grows across on top of it. Now, it's a church. The center and the cross represents whatever the ordering principle of that center is. Okay, so then I would say. And you're going to add to this because you did at the beginning of the talk already. The cross is the center point of the world. It's the axis of the world. So it's the world tree. It's also the place of suffering. And it's the place of suffering accepted voluntarily and transcended. It's all of those things. Yeah. Okay. And so the cross is also a symbol of the hero, and the hero is the person who confronts chaos and gains something of value from it. So that's voluntary. And the hero is also the person who recasts the archaic structure of the structure when it's necessary. Right. And so you see those heroic themes developed quite regularly across any reasonable historical span of time. So that's the redeemer. That's the Messiah. Right. It's. That makes order out of chaos and then takes order when it's too rigid and breaks it apart and recasts."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1720.41,"end":1746.11,"speaker":"Jonathan Pageau","text":"Yeah, you see that in the story of King David. You see that Actually, really? Well, like, very, very well. He breaks like he acts as a fool and as a. As someone who is actually a kind of thief, trickster figure while the tyrant is in power. And then when that tyrant falls, then he comes and creates a new centralized order by bringing the ark to Jerusalem. So he has that whole arc in his story. It's a very good version of it."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1746.19,"end":1845.24,"speaker":"Jordan Peterson","text":"Okay, good. I'll keep that in mind for when I get to that story in my biblical lectures. All right, so now you have to open the door on the wall, and the question is, who do you let in? So here's the idea. Okay. So you need to have a center, and the center has to hold because things are too complex without a center and a category system. And then the question is, let's say that your category system has to exist in accordance with the process that creates it and revitalizes it, because otherwise it can't maintain its stability across time. It degenerates into chaos or it rigidifies into too much order. Right. Okay. So the only people that you let into this, the inside the wall, are those who agree to live by the rules ethic and the ethic that's symbolized by the cross. Yeah, that's two things. That's the willingness to abide by a certain level of social organization. But it's more importantly, it's also the ability to transcend that and to participate in the process by which chaos is confronted and voluntarily. Voluntarily confronted and reordered. And also to participate in the process by which order is broken when it's too rigid and brought back. That's the death and resurrection, essentially. So those are the only people that you can let inside the structure without pose. Without them posing a fatal threat to the structure itself. And then if the walls fall, then the infinite multitudes stream in and we're done."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1845.64,"end":1851.96,"speaker":"Jonathan Pageau","text":"No, I mean, it ceases to exist. It's like you just cease to exist. That's all. You know that that's all. That's all it is."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1852.36,"end":1861.34,"speaker":"Jordan Peterson","text":"Right. Well, and you'd also say that that's. That's the problem that's being thought about in some sense with regards to the border issue in Europe."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1861.5,"end":1861.98,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1862.06,"end":1906.08,"speaker":"Jordan Peterson","text":"Do we have a right to have a border? Right. And then I was thinking today about a store. Like, just take your typical grocery store and you say, well, it's a. It's A category system. Only those with money are allowed to bring food out of this place. Right. And you might say, well, that's. That's a terrible imposition of capitalist patriarchy on. And an unfair imposition of capitalist patriarchy. So you throw the doors open and you say, everybody come and take what they want. Yeah. And that works really well until the store is empty and then that's the end of that. Yeah. Because if everyone can do anything they want, whenever they want, then not. Then it's complete and utter chaos. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1906.08,"end":1943.43,"speaker":"Jonathan Pageau","text":"It's nobody. Then what happens is what happens? Because I've lived in a place that is absolute and utter chaos. And chaos doesn't. Cannot sustain itself. So usually what happens is the rise of a warlord of a tyrant, the rise of someone who will by sheer force, by sheer physical force, impose their will on others because the others will be. Will have nothing to unite them. And so it's not true that a lot of, you know, you meet anarchists and people who think that there is such a thing as like this just kind of free anarchy where everybody's equal and everybody can do whatever they want."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1943.43,"end":1943.66,"speaker":"Jordan Peterson","text":"That."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1943.73,"end":1947.57,"speaker":"Jonathan Pageau","text":"That doesn't exist because in that anarchy comes a tyrant inevitably."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1947.73,"end":1948.13,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1948.13,"end":1949.73,"speaker":"Jonathan Pageau","text":"There's no. There's no stopping it."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1949.73,"end":1962.29,"speaker":"Jordan Peterson","text":"Right. Into anarchy comes a tyrant. Yeah, absolutely. Absolutely. And that's the. That's. And. And then the problem with that is that the fundamental organizing principle of the tyrant is tyranny. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":1962.29,"end":2005.13,"speaker":"Jonathan Pageau","text":"Pure. Pure power. Pure power. And pure also personality cult. Like it's that. It's that person instead of being an ideal unto which we we serve, you know, or mythic figure or a divine figure, it becomes a guy, you know, it becomes. Becomes Hitler or it becomes, you know, it becomes Napoleon or it becomes Stalin or become whatever. Like it's like it's that person. Everything is embodied in their personality. Like I always say, like I always have this image of a functionality system is the person who in some manner is able to at least symbolically step down from their power."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2005.21,"end":2005.57,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2005.57,"end":2051.32,"speaker":"Jonathan Pageau","text":"They always say that George Washington, what made him so great is that he stopped being president. That's what created the impetus for the system to work. And the same in the Roman Empire, like Augustus. People will say that he didn't really do it, but when Augustus became emperor, he stepped into the city as a citizen and he gave away all his power. And by giving away all his power, in a strange way, he actually became the most powerful person in Rome. But his power was not a legal power. It was like there was something about his capacity to not be the tyrant which stabilized the empire and made him very powerful, but in a very kind of strange way, it's different."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2051.32,"end":2057.4,"speaker":"Jordan Peterson","text":"Right, so like a legitimate ruler has to be bound by proper sovereign authority."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2057.4,"end":2067.32,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Like he gave himself to the. To the. To the Senate and said, I'm at your service. And so it made him very powerful, but he also kind of bound his power in the Senate."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2067.4,"end":2132.47,"speaker":"Jordan Peterson","text":"Right, right. Well, do you see that emerging as early as Mesopotamia, where Marduk, or where the emperor had to act out his. His embodiment of Marduk in the New Year's festival? And Marduk was the God hero who went out and confronted the dragon of Chaos and made the world. And so the reason that the emperor had. It's not sovereignty, legitimacy. The reason the emperor had legitimacy is because he was acting out an archetypal pattern that transcended his own personality. Then the question is, well, what's that archetypal pattern? And the answer to that is that's the hero who recasts the tyrannical state and who confronts chaos. So the structure that. The answer to the problem of how you maintain a structure in the. In the flow of time is that you make the structure itself subordinate to the principle by which the structure is generated. And that means that the. The sovereign needs to be responsible to the word, essentially. That's. That's how you would think about it from a Judeo Christian perspective. And that's above everything."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2132.71,"end":2133.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2133.23,"end":2185.97,"speaker":"Jordan Peterson","text":"And it's the thing that does the categorization initially, that's when God creates the world because of the word and when Adam names the animals and all of that, but also maintains that across time because it does slip and slide. So, you know, it wasn't really. See, we've been talking about a post. Postmodernism, Right. And about a logocentrism, and we've been kind of laughing about that too because of. Because of its reference to Derrida's phalogocentrism. But it's funny too, you know, because if you look at Hindu representations of the center, they're not phyllogocentric. The phallus is embodied in. It's the lingam and the yoni. The phallus is conjoined with the yoni. It's a masculine female duality that's at the center. It's not just the masculine."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2186.13,"end":2186.53,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2186.77,"end":2192.13,"speaker":"Jordan Peterson","text":"And so the idea that that center is necessarily phalogocentric is also wrong."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2192.29,"end":2265.63,"speaker":"Jonathan Pageau","text":"Right. But the thing is that, okay, this is going to get explicit, I guess, but it is phallogocentric Even if you imagine the phallus inside the woman, the phallus is the center, and the woman envelops the center, the phallic center. But I think that what I've been trying to get to, and I think what we've all been trying to get to, what you've been trying to get to too, is to be able to speak of logocentrism as in the proper manner. That is, to understand that. To say logocentrist means that we also understand the power of the frame, let's say. So the image I have of logocentrism is really. There's an image of the mother of God, of Mary with her hands up like this, and in her center there's a circle, and out of her is coming the Christ child. And inside that circle you see the stars, as if it's like the entire cosmos, which is the frame for the Logos to manifest itself in."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2265.71,"end":2285.71,"speaker":"Jordan Peterson","text":"And so the idea that in those open virgins, too, from the 14th century, where Mary is holding a globe, I think, generally speaking, and then she opens up and inside you have God the Father, and he's holding Christ on the cross. It's a similar sort of notion."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2285.87,"end":2327.76,"speaker":"Jonathan Pageau","text":"Right. And so I think that if we understand it that way, there's like an implicit in the notion of logocentrism. There's an implicit kind of secret mention of the power of the feminine in that very term, if we understand it fully as the need for this kind of the kind of chaotic outside or the chaotic potentiality which frames the manifestation of the Logos. And to understand that those two things need each other, like the, you know, the Logos doesn't manifest himself without a question. Right. There has to be a question for there to be an answer. And the question is a frame for the answer."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2327.84,"end":2329.28,"speaker":"Jordan Peterson","text":"It's like, definitely."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2329.28,"end":2340.48,"speaker":"Jonathan Pageau","text":"Well, okay, that's really important. That's like super important. And it shows how powerful the feminine is because it actually acts as the category, like, let's say, the frame in which the answer is given."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2340.8,"end":2387.68,"speaker":"Jordan Peterson","text":"Okay. Okay. So let's develop that for a minute. So let me. Let me see. That had made me think of something that I also wanted to tell. To talk to you about. Oh, yes. So, okay, so you said the frame is determined by the question that's answered. Yeah, that's asked. Okay, good, good, good. Perfect. So this is where I've been butting heads with Sam Harris and where you butted heads with Weinstein in Vancouver. Right. Okay. So because the question is. Okay, so you have to have a category system Now, Harris basically claims that you can derive the category system from the. From the facts. Yeah. Right. But the objection to that is there's an infinite number of facts, and they don't tell you what to do with them."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2387.68,"end":2388.16,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2388.16,"end":2405.06,"speaker":"Jordan Peterson","text":"Okay. So I would say instead that you derive the category system from your aims because categories are there to. To help you fulfill your. Your goals. That's. That's how category systems work. Yeah. That's why I think of them as pragmatic."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2405.06,"end":2405.38,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2405.38,"end":2466.87,"speaker":"Jordan Peterson","text":"Okay. So now the question is, given that your. Your category system includes and excludes and defines the world, what should be the aim of the category system? And so I think that's what the Sermon on the Mount talks about, because it basically says, well, you should aim at the highest possible good. You should aim at union with God, let's say, whatever that might mean. But you aim at the highest possible good with fully. Right. Fully right down to the bottom of your soul, if you can manage it so that you're not broken and bent up and twisted in a bunch of different sub personalities. So you try to unify yourself as a force for the highest good. And you do that in large part by deciding that being is worthwhile. Right. So you pledge allegiance to. To the concept of being. So you're not. You're not like Cain. Yeah. And then you speak truth in the service of that being, and then that from that, your category system flows. So that's another reason that the pyramid with the cross is the center of the category system."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2466.87,"end":2467.35,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2467.35,"end":2479.35,"speaker":"Jordan Peterson","text":"Because then you get a category system that includes what it should include, if the goal is the establishment of the kingdom of God, let's say, which is the highest of possible goals and. And excludes what it should exclude."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2479.51,"end":2539.39,"speaker":"Jonathan Pageau","text":"Yeah. One of the things, too, that kind of differentiates, let's say, Christian ontology or like a Christian cosmology is that we have this idea that there is an intimate relationship also between, let's say, the highest and the lowest. There's something which unites them together completely so that. So that even beyond, let's say, there's this capacity to move outside. How can I say this? To unite things together. And so there's this idea, let's say, like, you know, for example, there's an idea like the idea of a normal of a Christian family. Let's say that, you know, the father is the head of the household. You know, like this idea that people hate today. But there's this really this sense that the head or the. The king or the chief exists for the benefit of those that are the lowest. That are the lowest."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2539.55,"end":2552.99,"speaker":"Jordan Peterson","text":"Right. That's continually insisted upon in the Old Testament because the prophets always come up and say to the king, you're not attending sufficiently to the widows and the orphans. And that means that you've become corrupt."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2553.87,"end":2583.47,"speaker":"Jonathan Pageau","text":"And so in a way, you can kind of see the hierarchy moving up in the sense of things looking up towards, you know, into the hierarchy. But then there's also a really important manner in which the hierarchy moves down. And so the idea is that the top of the hierarchy exists for the bottom of the hierarchy. It's like. So that. So the top of the hierarchy in a really important way is a sack, is a sacrificial existence. And so the highest thing is there. The highest thing is the one that sacrifices itself for those that are."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2584.27,"end":2611.26,"speaker":"Jordan Peterson","text":"Think about that. You can think about that practically as the willingness of a father to care for an infant. Yeah, Right. So because the infants, obviously the. And of course, the infant also has that potential, which is why the infant is made sacred as well in that. In that symbolic realm. So the highest is serving the lowest. The lowest is the infant, let's say, because it's most helpless. But the infant is also the future of the hierarchy. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2611.5,"end":2680.52,"speaker":"Jonathan Pageau","text":"And so, I mean, I think that that really. And we've talked about this before slightly, is that the notion that the Christian hero is actually slightly different from the pagan hero, for example, so the knight, let's say in Western Christianity, the knight would be the archetypal image of the Christian hero, which is the notion of an aristocrat and a warrior, you know, a soldier whose purpose is not to. It is not only to gain honor on himself, but in a way, he gains honor on himself by sacrificing himself for those who can't do it. And so his honor is based on the fact that he's willing to fight for the. For the widow, for the orphan, for those that don't have the strength to fight for themselves. And so obviously, in reality, that doesn't always play out, but the ideal is there, and the ideal is real. And it's the basis of all our hero movies, all our hero stories always had this idea of the hero is the person who's willing to use their strength and their power to."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2680.6,"end":2681.64,"speaker":"Jordan Peterson","text":"To defend the weak."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2681.72,"end":2689.13,"speaker":"Jonathan Pageau","text":"Yeah, to sacrifice themselves for the weak. Which is very different from the pagan hero. Like, you know, Achilles, weakness."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2689.13,"end":2691.53,"speaker":"Jordan Peterson","text":"Weakness was contemptible under those circumstances."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2691.53,"end":2754.38,"speaker":"Jonathan Pageau","text":"And also, it's like the only purpose was to attain honor on ourselves. So Achilles is sitting in his tent and he's Moping and whining because we've taken away his sex slave and he won't go back to fight until it affects him personally, you know, but he's actually not. He doesn't care that much about helping, you know, the Greeks and their cause. He's really doing that, doing things for his own honor. And so he's perfectly heroic in sitting in his tent and moping and not going back into battle because his honor has been attained. Whereas in Christianity, in stories like if you see Sir Gawain and you read the Knight and the Cart, for example, that idea of Lancelot, who is willing to be seen as a criminal, as the worst kind of person in order to. To save the helpless damsel in distress, you know, he's willing to sacrifice all his honor in order to help that. That person who is in danger. So it's a really. It's a very different way of seeing the world."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2760.62,"end":2763.42,"speaker":"Jordan Peterson","text":"Okay, well, I don't know what to say after all of that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2763.42,"end":2766.62,"speaker":"Jonathan Pageau","text":"How does that fit in the whole thing? But it fits in the idea of the cross."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2767.18,"end":2816.71,"speaker":"Jordan Peterson","text":"No, absolutely. Absolutely. I'm not. I'm not. I'm not suggesting at all that that was not relevant to the. To what we've been discussing. It's dead relevant. I really like the idea. I know we've talked about the fact that, you know, I've been conceptualizing Christ as the. Not as the apex of the hierarchy, symbolically speaking, but the apex to such a degree that it actually detaches itself from the hierarchy. Sort of like Horus the Osprey, or the. What. What the hell is he? A falcon in Egyptian symbolism. Right. He's the thing that flies above everything that can see, or the Egyptian eye. And your correction was that it's not exact. Once you're detached, in some sense, you're not at the top anymore. You're everywhere. You spread throughout the entire structure, which is a very good way of looking at it."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2816.71,"end":2852.64,"speaker":"Jonathan Pageau","text":"Right. The story of Christ is in his story and in his symbolism, you see that he's at the top of the dome, let's say, in the church, where he's really exactly what you're saying, this kind of detached top of the hierarchy. But then he also stretches all the way down into death, into Hades, into chaos. And the cross is the other side, where he's outside of the city being killed by his friends. He's the outcast. He's all of those things. And so he unites the two extremes of the hierarchy together and fills the hierarchy with logos."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2852.64,"end":2938.64,"speaker":"Jordan Peterson","text":"Well, in the idea that he transcends death. Again, I'm just going to take this from a psychological perspective because the theological waters are getting too deep for me here. Well, they are, because I don't understand it exactly. I'm really trying to work it out, but I don't understand it well enough yet. But the idea that Christ descends into hell and rescues people from hell and death, that can be read quite straightforwardly, psychologically, because the consequence of. Not of erecting a category structure that isn't predicated on the hero is that everyone will be in hell and die. So, I mean, that's what happened in the Soviet Union as far as I'm concerned. And so those hell stories are real enough as far as I'm concerned, but that doesn't speak to their potential transcendent reality, which is a whole different issue. I mean, here's something else that's been. That's been bugging me, and I'm just starting to think this through. You know, I do think that there's. There's an idea that if you're in the right place at the right time, that everything comes together and lines up, you know, And I was wondering, you know, how the story, like the story of Christ is told in many, many ways, like from the cosmic to the microcosmic. Right. So. And one of the macrocosmic stories is the relationship between the astrological speculations and Christ himself. So there are 12 constellations. Like there are 12 disciples, and the sun is Christ, essentially."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2938.64,"end":2939.04,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2939.04,"end":2942.56,"speaker":"Jordan Peterson","text":"And that story really works. It even maps onto the calendar properly."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2942.56,"end":2942.96,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2942.96,"end":2969.85,"speaker":"Jordan Peterson","text":"And so then you think, well, that's because people have. One interpretation of that is. That's because people have retold the story at each level of analysis. But another possible reason for that is that it's synchronous in some sense, and it is the fact that everything comes together around that central axis in a. In a. In a real way. Yeah. And that the story can't help but be represented at multiple levels of reality simultaneously, because that's what the story is."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2970.01,"end":2970.57,"speaker":"Jonathan Pageau","text":"That's."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2970.57,"end":2970.89,"speaker":"Jordan Peterson","text":"That."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2970.89,"end":2973.25,"speaker":"Jonathan Pageau","text":"I mean, it's like. That's exactly what it's about."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2973.25,"end":2973.89,"speaker":"Jordan Peterson","text":"The whole."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2973.89,"end":2975.09,"speaker":"Jonathan Pageau","text":"The whole thing is about this."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2975.09,"end":2975.37,"speaker":"Jordan Peterson","text":"This."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2975.37,"end":2978.37,"speaker":"Jonathan Pageau","text":"This lining up of. Of everything, you know, like."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2978.37,"end":2978.97,"speaker":"Jordan Peterson","text":"Of everything."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2979.05,"end":2979.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2980.57,"end":2982.53,"speaker":"Jordan Peterson","text":"Yes. And. Okay. Okay."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":2982.53,"end":3048.62,"speaker":"Jonathan Pageau","text":"It's hard to see that it'd be. It's so. It's hard to see the fullness of that. When you look at it, it always kind of jars you because it's so. So the story of Christ. I always tell people, if you pay attention to it, it'll constantly be knocking you down. Because it seems, even at a first glance, sometimes it seems like it's contradictory because Christ is all these things. He's the teacher, he's the king, he's the shepherd, he's the outcast, he's the technician, he's the artist. And so it's like, how is it that a story can encompass. And the more you look in the story, the more he's a fisherman. And so all these things. How is it that all these things can fit in one story? It's easy to glance over it because it's so short. You read a gospel, you kind of go through it. But then if you really look at all the aspects and you understand the traditional categories, let's say then in a normal world, let's say the shepherd and the agriculturalists usually are not the same person, but in Christ, they're the same person. He's able to. Sower and the reaper. Yeah, exactly. He's the fish, but he's also the fisherman."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3048.62,"end":3049.1,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3049.1,"end":3061.3,"speaker":"Jonathan Pageau","text":"And he. So he's the stumbling stone, but he's also the capstone. So he stretches. Like we talk about this idea of stretching out the entire hierarchy. So he's like. He's the stone that doesn't fit that the builder."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3061.54,"end":3103.58,"speaker":"Jordan Peterson","text":"So here's. Yeah, right, exactly. That the builder rejected. Yeah, okay. So one of the things I've come to understand about tyrannies is that if you have a tyrannical person at the top, the tyranny isn't just at the top. The tyranny is mirrored all the way through the entire hierarchy. Right. It's like. What are those, 3D holographs? It's like that. Or hologram. It's like a hologram. Every part is a reflection of the whole. And so I wonder if that's analogous. If you have a pyramid, say, with the principle of the divine hero at the top, then what happens is that's reflected at every single level of the. Of the hierarchy. Just like it would be with the tyranny."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3103.66,"end":3189.13,"speaker":"Jonathan Pageau","text":"Right? Yeah, it should be. Except that. Yeah, except that the. The. Yeah, the tyranny is. Will be just that. That kind of up, down, like the top down. You know, light that shines down and kind of puts everything in place. And then when it reaches the things that it doesn't. That it can't absorb, it'll just. It'll completely cut them off, you know, like, it'll kill them. It'll burn them off, you know, it'll just destroy them. Whereas there's something about Christianity or like a traditional hierarchy which is a stretching out in. So, so you could imagine, Right. Let's say in terms of all of Christianity, it isn't like there really. There is, there's like a, a place, let's say, for at least in, in the world, there's a play until the Last Judgment, let's say until the Last Judgment. There's a place for that buffer to be there and to be slowly assimilated. Right. And so, so it's not, it doesn't, it doesn't totally shut itself off. There's a, there's a, there's a, there's room, there's a gate, you know, like you said, and there's always people that can come through the gate and that are always kind of entering and, and slowly being identified. Assimilated, but not just assimilated, but also transforming it into what it's going to be, into what it's going to become. But it's a, but it's not, it's not a radical process. It's like this organic transformation, let's say."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3189.13,"end":3207.39,"speaker":"Jordan Peterson","text":"Well, and that's a huge part of what we're arguing about right now in our culture, which is how is it that you handle the integration, let's say. And the answer isn't no integration. No. Because what that does is rigidify the structure. Because if you, if you close it off completely, you also rigidify it inside."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3207.39,"end":3207.87,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3208.27,"end":3213.59,"speaker":"Jordan Peterson","text":"And so what that means is the chaos is going to break forth inside. So. Because you can't get rid of the chaos."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3213.59,"end":3213.95,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3214.19,"end":3235.09,"speaker":"Jordan Peterson","text":"Now, you know, one of the things we talked about, so, for example, with the idea of gay marriage, so now there's. The excluded are included. And then the question is, well, what. What is then the responsibility of the included. And the responsibility of the included is to not break the structure of the system that included them. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3235.09,"end":3279.19,"speaker":"Jonathan Pageau","text":"You know, that's a really, that's a really good way of seeing that because that's an, that's actually probably the best way of understanding, understanding it in terms of how it works itself out in real life. It's like, you know, if you come in, if you come in as, you know, an assimilated margin, you know, as a margin that wants to participate in a country or in an identity or in a group or whatever it is like in a club, like your responsibility is, like you said, is to not break what makes that something like you, you know, if you want to, if you want to be, you know, if you want to join a. I Don't know, a baseball group. And you. Baseball team. And you come into the team and you're the newbie on the team, and you. And you all of a sudden expect everybody to."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3279.75,"end":3280.83,"speaker":"Jordan Peterson","text":"To play basketball."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3280.83,"end":3283.87,"speaker":"Jonathan Pageau","text":"To play basketball. It's like. Well, then why. Like what, What."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3283.87,"end":3284.39,"speaker":"Jordan Peterson","text":"It doesn't."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3284.39,"end":3284.95,"speaker":"Jonathan Pageau","text":"You know, you're."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3285.03,"end":3286.23,"speaker":"Jordan Peterson","text":"Why did you join the club?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3286.39,"end":3291.15,"speaker":"Jonathan Pageau","text":"You destroy the club. It's Exactly. No, I think that's a simple way."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3291.23,"end":3306.19,"speaker":"Jordan Peterson","text":"Yes. Well, we talked about that a little bit with the Abrahamic stories, if I remember correctly, because there was the problem in the Abrahamic stories of how to deal with the marginal. So I can't. Unfortunately, I can't recreate that on the fly."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3306.75,"end":3310.51,"speaker":"Jonathan Pageau","text":"Like it had to do with hospitality, proper behavior."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3310.91,"end":3322.07,"speaker":"Jordan Peterson","text":"Right. So the rule is I show you hospitality. But that's my rule, my obligation. But your obligation is not to do. Not to make passes at my wife and disrupt my household. Yeah, Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3322.07,"end":3350.55,"speaker":"Jonathan Pageau","text":"And then. And then a relationship builds with the stranger. And then. And then slowly the stranger, you know, becomes a friend, you know, and then maybe you. Then maybe the stranger marries your daughter at some point. Right? It's like, you know, there's like the possibility of creating a relationship which will integrate the two identities together, but it's a gradual process and one which has to be done with mutual respect. And that's."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3350.55,"end":3386.45,"speaker":"Jordan Peterson","text":"Right. Well, in the proper spirit. Well, I would say that would be the spirit of the Logos, because the Logos is also the thing that goes outside the boundaries. So let's say you have person from group A here and person from group B here. And then they decide to communicate. Both of them have to go outside their group and meet in. In the junction between the two groups, which is a different place. And they have to make peace, but they make peace there under the guise of themselves as individuals, exploratory individuals. And then maybe the groups can integrate as a consequence of that. Right. And maybe without falling apart and without."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3386.45,"end":3419.48,"speaker":"Jonathan Pageau","text":"Fighting, and something appears like something will manifest itself as whatever is. Is holding, you know, the two groups together, the two families or the two people. And so that logos will. With the coming together, let's say two families is a good example. You have two families, and then people in the two families intermarry. And so there's something that unites them together. And it's in the coming together that that logos will appear and will hold the relationships in place."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3419.8,"end":3437.87,"speaker":"Jordan Peterson","text":"That marriage is a recreation of that masculine, feminine union. And that's. That's associated sometimes with the androgyny of Christ and sometimes with. There's an old idea, and I can't remember where it comes from that. That Adam before Eve wasmaphroditic. Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3437.95,"end":3439.67,"speaker":"Jonathan Pageau","text":"Yeah. Or androgynous."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3439.67,"end":3446.83,"speaker":"Jordan Peterson","text":"Yeah. Or androgynous. Right. And that Christ as the second Adam, recreates that androgyny in the proper manner."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3446.91,"end":3492.19,"speaker":"Jonathan Pageau","text":"Yeah, No, I think so. I think that. That you find it in some of the church fathers where they'll say things like. Just to help you to understand and understand it, they'll say things like that God separated Adam and Eve. Adam into two. In view of the fall, in the sense that it wasn't the fall, but it was the idea that. It has to do with. With the idea of living outside the garden, let's say, and having then to come back together. And that coming back together in terms of sexual union and in terms of procreation, then becomes a little microcosm of what was in the garden, let's say."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3492.19,"end":3492.59,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3493.07,"end":3495.51,"speaker":"Jonathan Pageau","text":"And that's why also, you know, like, you know, Adam and Eve."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3495.51,"end":3518.26,"speaker":"Jordan Peterson","text":"Well, I wonder if that's actually. I wonder to what degree that's actually. Let's say. I wouldn't say neurophysiologically true, but I'm going to say something like that because it seems to me, and I made allusions to this when we did that talk about Logos, people maybe thought that it wasn't the most appropriate thing to say, but sexual union produces this brief union in paradise."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3518.26,"end":3540.33,"speaker":"Jonathan Pageau","text":"Yeah. I think that's the highest point of sexuality. And that's why sexuality is used as an image for the union of the soul with God. And it's used as an image of the union of the church with Christ. Because the idea that the union of the masculine and the feminine is a glimpse of eternity, it's a glimpse of paradise."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3540.33,"end":3544.77,"speaker":"Jordan Peterson","text":"Right. Well, and I'm not sure that's just an idea. I kind of think that that's actually."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3544.77,"end":3545.69,"speaker":"Jonathan Pageau","text":"That it actually happens."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3546.09,"end":3547.77,"speaker":"Jordan Peterson","text":"Yeah, I think that it actually happens."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3547.77,"end":3554.57,"speaker":"Jonathan Pageau","text":"Yeah, I think so. Yeah. And that's why also I think that in Christianity, the idea of taking that lightly."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3555.62,"end":3555.86,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3555.86,"end":3573.3,"speaker":"Jonathan Pageau","text":"Is very dangerous. The idea of uniting yourself with all kinds of people is very dangerous. Because when you unite yourself with someone, you're actually creating a very powerful spiritual unity. And then if you kind of wander that and make it shallow, then you're."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3573.3,"end":3576.74,"speaker":"Jordan Peterson","text":"Right. Then you don't have. Yeah, you're devaluing it."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3576.74,"end":3590.29,"speaker":"Jonathan Pageau","text":"Yeah. And it also will rip you apart because you leave a part of yourself with that other person and. And you leave a part of. It's like you leave. You're Kind of still attached to someone and you're leaving a part of your soul, whatever, with that person, and then it gets ripped apart, so you end."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3590.29,"end":3599.77,"speaker":"Jordan Peterson","text":"Up fragments, you might say it makes you cynical, which I would say. I think that sleeping with a hundred women would leave you cynical for sure."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3599.93,"end":3602.41,"speaker":"Jonathan Pageau","text":"I don't see how it wouldn't. I don't see how it wouldn't."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3603.53,"end":3609.21,"speaker":"Jordan Peterson","text":"Yes, yes. Well, that's the question. But I think that's a very good way of thinking about that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3609.96,"end":3626.36,"speaker":"Jonathan Pageau","text":"So we would at least leave you in a position of, you know, like the person who only eats caviar, let's say, who doesn't understand how precious things are, you know? And to not understand how precious things are is to devalue them. Like, if you. If you."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3626.84,"end":3642.12,"speaker":"Jordan Peterson","text":"Well, and if that's the highest thing that you're devaluing, then you end up like Cain with Abel. Like, he kills Abel, his highest ideal, and then he says the punishment is more than he can bear. So if you take what actually is the highest value and devalue it, then you're left without hope."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3642.28,"end":3660.84,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Oh, I mean, that's why. That's why. I mean, I don't know, but it's like the people that I've known in my life who sleep around a lot, they tend to have a kind of nihilistic tendency, let's say a blase tendency, like to not."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3661.4,"end":3663.16,"speaker":"Jordan Peterson","text":"Yeah, well, things can be discarded."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3663.41,"end":3663.73,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3665.89,"end":3686.69,"speaker":"Jordan Peterson","text":"And that moment of union, let's say, is also pretty much devalued to just brief pleasure. That's the only way that it's conceptualized, you know? And it is the case, too, that if you look at early promiscuity in teenagers, it's associated with antisocial behavior. Yeah. It's a strong predictor or strong correlative antisocial behavior."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3686.77,"end":3687.41,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3687.65,"end":3694.18,"speaker":"Jordan Peterson","text":"Yeah. Now, I'm not saying there's a causal relationship there, but I am saying it's part of the same constellation."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3694.18,"end":3694.5,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3694.5,"end":3714.42,"speaker":"Jordan Peterson","text":"That's quite clear. So. Yeah. All right. Well, that's probably enough of that. Yeah. Yeah. Okay. Okay. Well, that was good, man. I was thinking about these things when I woke up this morning. You know, like, for about an hour, they were just flashing around in my mind like crazy."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3714.42,"end":3718.52,"speaker":"Jonathan Pageau","text":"Yeah, you've got that fixated look on you. I can. I can kind of discern it now."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3718.84,"end":3735.44,"speaker":"Jordan Peterson","text":"Yeah, well, it's too much, you know, it's too much. This sort of thing really is. It's just so. It's like, Christ, I'd like to get up in the morning and think about raking the backyard or something like that, you know, so. Oh, well, that was really good, Jonathan. Thanks."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3735.44,"end":3740.36,"speaker":"Jonathan Pageau","text":"Yeah. You think that. You think that went. You think that's good? Like, you think that we got to what we wanted?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3740.44,"end":3742.91,"speaker":"Jordan Peterson","text":"Well, we got farther than we have. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3743.63,"end":3749.71,"speaker":"Jonathan Pageau","text":"Look, if you want, like, think about it, I mean. I mean, because we had a whole bunch of things that we said we wanted to talk about."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3749.79,"end":3750.35,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3750.75,"end":3755.83,"speaker":"Jonathan Pageau","text":"I mean, maybe we could make it, like, whatever, every two months or every month or something."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3755.83,"end":3766.27,"speaker":"Jordan Peterson","text":"Yeah, well, I think so. Well, I'm sure that I'll have. The way my mind is working right now, I'm sure that I'll have some ideas that you'll be the right person to talk to about, so."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3766.27,"end":3767.71,"speaker":"Jonathan Pageau","text":"Yeah, well, like I said, I'm here."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3768.2,"end":3781.56,"speaker":"Jordan Peterson","text":"See, you're one of these weird intersectional people, eh? You're a Greek Orthodox, French Canadian icon carver who knows a lot about postmodernism. It's like, I think there's probably exactly one of you in the world."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3781.72,"end":3783.4,"speaker":"Jonathan Pageau","text":"Pretty sure. I'm pretty sure."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3783.96,"end":3785.52,"speaker":"Jordan Peterson","text":"So that's."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3785.52,"end":3806.32,"speaker":"Jonathan Pageau","text":"Yeah, that's why I think that is why, like, I've always been a marginal person. That's why I understand it so well. But I think that the key. The key to my situation right now is that I. I kind of saw it, but now I also see how it can serve the. The center, let's say. And so that's my job in life. I think I've. That's pretty much, I think, what I'm."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3806.32,"end":3813.76,"speaker":"Jordan Peterson","text":"Supposed to be doing. Right. Well, that's a good way of ending, because the. The postmodern claim. The postmodern neo Marxist claim is that the center should serve the margin."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3813.84,"end":3814.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3814.72,"end":3818.04,"speaker":"Jordan Peterson","text":"But the. The counterclaim is the margin should serve the center."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3818.04,"end":3818.44,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3818.44,"end":3819.56,"speaker":"Jordan Peterson","text":"And both those claims are right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3820.43,"end":3820.67,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3820.67,"end":3828.67,"speaker":"Jordan Peterson","text":"And that's associated with that idea that you already described of the image of Christ as the perfect man saturating the entire hierarchy."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3829.55,"end":3861.82,"speaker":"Jonathan Pageau","text":"Yeah, no, I agree. And the first will be the last, and the last will be the first. There's something about that in Christianity which is absolutely true, that there's even something. There's even something weird that happens at the end or at the bottom, where there's a mere reflection between the bottom and the top, where, like, the lowest thing would be the fool, for example, and the highest thing would be the holy fool. And so there's this strange completion that happens in the whole thing, but it's really a very. It becomes very mystical at that point. It's hard to describe in straight categories, but."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3862.86,"end":3865.74,"speaker":"Jordan Peterson","text":"Well, I think Milo is kind of a good example of that."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3865.98,"end":3925.3,"speaker":"Jonathan Pageau","text":"Well, I'm asking myself. I've been asking myself that for months. You know, I did that interview with Dr. Rachel Fulton Brown about Milo, and by the way, she really would like to talk to you. Anyways, so the thing I'm wondering about him is that in the Holy fool, usually there's a lot of self depreciation. And so St. Francis, you know, he would go out into the public space and strip naked, you know, and he would pass for a beggar and all those things. And so I think that that might be a requirement for the Holy fool is that. And the humor is not only against the people around them, but also it turns back on themselves constantly. And so that's what makes them the Holy fool, is that you can't criticize them, because as much as they're criticizing the rulers or the structure or the order, it turns back on them. And then they act as the lowest of the low. So that's what is able to hold them, to hold them in that high place. So something to think about."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3925.95,"end":3932.91,"speaker":"Jordan Peterson","text":"Okay. All right. All right. Well, I'm gonna cut the front of this off maybe a little bit, and. Yeah, that's gonna post it, so."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3933.07,"end":3933.79,"speaker":"Jonathan Pageau","text":"All right, cool."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3934.03,"end":3935.07,"speaker":"Jordan Peterson","text":"All right. All right."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3935.07,"end":3935.95,"speaker":"Jonathan Pageau","text":"Good luck with everything."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3936.59,"end":3938.27,"speaker":"Jordan Peterson","text":"Yeah. I've got another lecture tonight."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3938.43,"end":3939.99,"speaker":"Jonathan Pageau","text":"Oh, is this a biblical lecture?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3939.99,"end":3941.35,"speaker":"Jordan Peterson","text":"End of Jacob's ladder. Yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3941.35,"end":3941.87,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3941.95,"end":3944.83,"speaker":"Jordan Peterson","text":"So now I have to go prepare that, huh?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3945.15,"end":3956.03,"speaker":"Jonathan Pageau","text":"Wait, let me. Let me think about Jacob's Ladder. Two seconds. Did you ever watch that talk On. On. On Moses and the ascent of my talk I gave on the. On."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3956.87,"end":3957.11,"speaker":"Jordan Peterson","text":"On."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3957.51,"end":3972.95,"speaker":"Jonathan Pageau","text":"It's called the life of Moses. Like St. Gregory of Nisan, the life of Moses. You should watch that. If you have time. You should watch. It's like 45 minutes, and it's really about the ascent of the mountain and the ascent of the Holy Ladder."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3974.95,"end":3976.31,"speaker":"Jordan Peterson","text":"Would you email that to me?"}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3976.31,"end":3977.55,"speaker":"Jonathan Pageau","text":"Yeah, I'll send you the link."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3977.55,"end":3978.95,"speaker":"Jordan Peterson","text":"I'm completely out of brain."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3980.55,"end":3986.46,"speaker":"Jonathan Pageau","text":"I'll send you the link right now. I think that might be helpful for your talk tonight. Get some rest."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3986.78,"end":3987.82,"speaker":"Jordan Peterson","text":"Okay, See ya."}
{"episode_id":"SW - #014 - 2018-08-30 - Intersectionality Individuality And The Hero - With Jordan Peterson","start":3987.82,"end":3988.46,"speaker":"Jonathan Pageau","text":"All right, bye."}
