{"episode_id":"SW - #326 - 2024-02-08 - The Symbolism of Titans, Giants, and Nephilim","start":0.32,"end":1348.6,"speaker":"Jonathan Pageau","text":"I would suggest, you know, just do it. Take a test, right, look at the different legends of giants and see if you can find the thread of what I'm saying. This is Jonathan Pedro. Welcome to the symbolic world. Foreign. As some of you know, we are getting ready. We are just about to launch the new God's Dog Warrior Kickstarter. And I thought that as we get ready to start on this new journey, it would be a great idea to look at the symbolism of giants, because in the graphic novel, of course, the, the bad guys are the giants. Now it's interesting because we wrote this a long time ago. My brother and I wrote this now almost 15 years ago at a time where nobody was really caring about giants and nobody thought about that and their relationship to what's happening in the world today. But now with the Lord of Spirits and, you know, people like Michael Heiser and also a lot of conspiracy type people, the question of the Nephilim and of giants is back in people's perception and has been taking up more and more cultural space. And so what I thought we could do is we could look at the symbolism surrounding the question of giants, understanding why they appear the way they do in the different forms, why there's so much versatility in the symbolism of giants and what that can mean. In order to look at the symbolism of giants, we have to, we'll take the biblical and Enochian account first as a kind of standard to look at it and to understand why it looks the way that it does and what that can mean. And then we'll see how it plays out in the, in the different instantiations that they have in culture. Now, as you know, in the book of Enoch and, you know, based on the book of Genesis, we have this idea that the sons of God came into the women, the daughters of men, and the result of that were the Nephilim. Of course, in scripture, it's very vague what it is. Like what is the Nephilim, these fallen ones, who are these watchers that are mentioned in the Book of Enoch? All of this is a little vague. But when you look at extra biblical traditions, and especially how they connect even to other mythologies from other cultures, you can start to understand how all of this fits together. And so the idea is to understand that there's something from above that mixes in an appropriate way with something from below. You know, whether you understand it as angels having relationship with humans, whether you understand it as, you know, the descendants of Seth that have relationships with the descendants of Cain, in the end, the symbolism is the same. It is an improper union between that which is above and that which is below. So you could understand it as an improper union between heaven and earth, no matter how you see it. And so, you know, if the idea of the principalities or the angels having children with humans and, you know, producing offspring, of course, I mentioned this before. Fr. Stephen DeYoung seems to have given us a very good solution to avoid the problems that this causes, which is that the these types of relationships were mediated through ritual, and that the way in which someone would have a relationship with a God or principality was through ritual sexual practice with a priestess or priest or a temple prostitute, and that this is what would give a powerful being, which came to be understood as what we would say, the giants or these fallen beings that are also represented, at least culturally and at least in the stories, as being gigantic. And if you understand that that's the basic relationship, you can see that across several stories and across several traditions, you will find that that is how they're represented. So if you look at the way in which the Greek giants are born, they are born out of the castration of heaven and the seed of heaven falling haphazardly onto the earth in a non planned, you could say, non purposeful manner, and then creating the giants in that accident. And so that's the way to think about it. It's something like the accident of meaning, the side effect of meaning. These are all ways to understand what it is that giants are for. And you could say also the excess of body is really the way to understand it in this case, which is in some ways that the meaning isn't aligned. It's not aligned towards what it really should be. And so because of that, it creates something which you could say has a lot of body, but doesn't have a lot of head, that has a lot of body, but that doesn't have a lot of spirit. And if you think of just different ways in which giants are represented in popular cultures, as, you know, stupid, the kind of ogre type figure that is huge, but is not very smart. This is, of course, something that is just very pervasive in the way we understand our culture. But you can see how all of these things kind of come together, which is the bad union of heaven and earth, the wrong union of heaven and earth, the accidental union of heaven and earth, which makes it. So what you get is something like a lot of power and very little direction. A lot of, you know, you could call them, you have more of the accidental aspect of the union of Heaven and earth. And this is represented, of course, also in the way in which the giants are represented in, for example, in Greek culture, again, as usually some kind of excess, you know, beings with a thousand arms or, you know, with the legs of serpents. They have a kind of hybrid aspect to themselves or kind of excessive aspect to themselves. And some of them are huge, you know, like massively. Not just, you know, a few feet tall, but like hundreds of feet tall or whatever. And this is to show this kind of breakdown. Now, this seems all very mythological, you know, and it seems all very strange. But a good way to understand the giant is something like civilization gone wrong, okay? This is a way to apply the question of the giants to something that you can understand and that isn't just totally captured by mythological storytelling. It is something like something above, like the head or a king or someone. And the king, because of he's a principality, right? Like an angel, but in the world, something that is like a God but in the world joins with a body, right? Joins with the city, has this large body, very powerful body that is aligned with him. And you could say that the gigantic part or the fallen part, the nephilim part of that is the side effects of the city, the way in which the systems become out of control. They forget what they're for and they take on a life of their own. So they become a kind of parasitical body that is no longer enacting what they should be aligned towards. So think of it now at different levels. It's important to understand it at different levels because if you don't, then it's going to sound weird. What I'm saying, you have to understand something like the fallen angel itself is an image of that. That is the. For example, in scripture, the idea that the angels rebel against God, or the idea in the Greek myths that the Titans, who are these beings created by the meeting of the proper meeting of heaven and earth, that these Titans rebel against heaven, and in rebelling against heaven, they castrate the God. And that castration, that wrong relationship between heaven and earth is what gives the seed of heaven, falls on the earth and then brings about the giants. And so all of this happens all the way through. And so it's completely aligned with the idea of the rebel angels that rebel against God and then come down to the earth and have relationships with women which bring about the fallen ones, because the angels are not aligned properly. The relationship between the angels and the women on the earth is not a proper relationship. It's misaligned. And so therefore the fruit of that is the misalignment, the fallen one, the too much body and not enough purpose. And so now you can apply it more reasonably to something like a city, and you can understand how that happens, which is the aspects of the city which are misaligned, either towards the king, right, towards the president, towards the mayor, towards the corruption that appears there, or the manner in which the king himself or the mayor himself is corrupt and is not aligned towards a higher purpose, which will then cause the fruits of that to become misaligned. And so what you'll have is you'll have things like tyranny, you'll have corruption, you'll have chaos. You have all of these types of behaviors which will appear like the giant. So now kind of empty your mind of all the stories that I've told. Now think of the giant in the fairy tale. Think of the giant in the popular imagination of how the giant acts. The giant moves around, uses power arbitrarily, right? Is a cannibal, usually will eat humans, will sit on things, you know, will break things. Well, you know, we'll have a big club and we'll just start bashing things around. And is in some ways a representation of the forces of nature themselves, right? Because in the story of the Greek theogony, for example, the Titans and the giants, they kind of get banished down under the earth. You know, the Titans get put into Hades and the giants get kind of put into the ground. Like they become the source of volcanoes, the source of earthquakes, the source of all of this. And again, you can see how it fits together, which is, although now we're not in the human sphere of civilization, we're in the idea of the misalignment of heaven and earth. Well, all of a sudden, the earth is not acting towards purpose. It is being destructive. It is not helping purpose come about, but is rather going against purpose and is a kind of brute force without head that is acting on the world. And so just understanding that can account for all the different aspects of the giants and how they, you know, how they manifest themselves as, you know, we're also writing a version of Jack and the Beanstalk and Jack and the Beanstalk. It's very interesting because now you have giants in the heavens. And so you'd think, well, if the giants are these bodies without heads, why are the giants up in the heavens? That doesn't make any sense. Right. But that is, of course, again, you just have to understand it as a misalignment of heaven and earth and as the way in which Heaven is misaligned with Earth. And you can see why it's not weird to imagine that there are giants that are up above you, that they would be represented that way as something like leaders that are not acting towards the higher good, right? So a leader that is not acting towards the higher good could be represented with the tropes of a giant, an ogre, a cannibal, you know, all the different. The different images that we represent as the. As the giant. And so then you have, again, because if you see it fractally, you'll see that when the giant is represented, like in the story of Jack and the Beanstalk, as being in a castle up in heaven, he's in a castle. He has a kind of kingly function because he's above you in a castle. And so then he's both, in some ways, the fallen angel and the giant at the same time. Because you can see that both of those are just different versions of the same problem. Which is why both in the scriptural text, the idea that the sons of God rebel against God by mixing improperly with the daughters of women, bringing information, bringing wisdom, bringing the knowledge of God down into the world, but in a way that is weaponized, right, in a way that is there to give, to bring power, rather than to be a transparent vehicle for something higher, then that gives the Nephilim, that gives the fallen ones. And in the Greek mythology, you have the same image, which is that the Titans rebel against heaven, they castrate the gods, and then that brings about the giants. And both of those are fighting against the gods. And so both of them, ultimately, in the Greek story, it's a little more complicated because then there's like a kind of restoration that happens to avoid things from falling further down. So it's not as clear as what you see in the Christian images, which is that Zeus is not heaven himself, he's not the God of Heaven. He's kind of a figure that stops the chaos from continuing. But nonetheless, the structure is there, which is that you have to fight against the Titans and you have to fight against the giants. And so you have the Titanomachy and the Gigantomachy, which are the two wars that the gods have against the giants. And then in the Christian world, you have that same type of imagery, which is, on the one hand, you have the image of the battle against the heavens, the great war in the heavens, where the angels and the demons are in a battle, but then you also have this kind of imagery in terms of how the flood will destroy the world. Of the giants. How. Of course, there's also this fight against Gog and Magog in Revelation, which is related to this idea of these kind of, you know, giant monsters that. That are. That are too much body. Okay? So that can kind of help you understand a basic structure of how giants work. Now, there's another way that giants are represented that you can help you understand what giants are. But it's the same thing. It's just. You have to. Instead of thinking about it in terms of a kind of hierarchy of authority and then the giant, the. The. The principalities rebelling against what is above, and then that giving birth to the side effects of. Of a hierarchy, the side effects of power. You can also have it in something like, in time, which is that often in many traditions, the giants are represented as that which was there before the current order. And that is a way to maybe understand it more in terms of the way the Greeks represent it. But you also see that, of course, in Norse mythology and in many other mythologies where the giants were there before us, and they are in some ways a remainder of an ancient world to which we don't have access anymore that doesn't connect to our origin. You know, if you look at the way in the Scandinavian. In the Scandinavian mythology, you have this idea even that the world is built out of the body of a giant that was there before. So the world that's there before is dead and now is decomposed. And now we take the remainders of that world and we reorganize it in order to create. To create the current world. This, of course, is there also in the story of Noah, which is that now to. It also appears in time, which is that the giants appear as a remainder of the pre diluvian world, as this kind of broken, chaotic remainder of what was there before, because it is a place where heaven and earth don't meet, which is that we have an origin of our story. We have a foundation of a nation, the foundation of a culture, of a story. And that is the order of that world. And it's the manner in which heaven and earth join together. And what precedes it is, of course, something that we can't understand because it's like a residue. It's a remainder of something that doesn't make sense to us. And that remainder and things that don't make sense to us is equivalent to the natural forces that are in the world. Think again of the giant that was broken down in Northern mythology in order to make the new world. And you can think about that in terms of culture. So if there's a massive change in culture, then that which was there before has to now be realigned, has to be used as the potential out of which we're now going to make the new world. And that is akin to coming to a land and then finding the land that's there or whatever is there, and then having to organize it, to plant food, to build buildings, to do whatever in order to make it into now a habitable place. So that is why giants also appear as that which was there before us. And so you see that in every so many cultural stories, you'll just see it non stop everywhere, which is that whether it's Native American, you know, different aboriginal mythology, that there were giants there before they arrived, that there was this strange race of giant men who are there before. You see it in the how the Brutus from Troy comes to England to the British Isles, and what does he find? Of course he finds giants. He has to defeat the giants before being able to found his new civilization. Now that is exactly the same as the Norse gods or the. The Norse world having to create a new world out of a previous giant, okay? And that is so pervasive, that way of thinking is so pervasive that no matter how the giant appears to us, the giant will always have that structure. So if you then move into a world of evolutionary thinking where humans are descendants of apes and that now we're humans when we see our giants, that is, when we encounter the giants, whether that encounter is imaginary or not, it doesn't matter. We will use the same story trope no matter what. And so we'll say that Bigfoot or that, you know, the different giants that are encountered in the Americas with like, was it Wendigo or all these, these giants that are in. In American mythology that those are apes, right? They are a world that was there before our origin. They the potential out of which humans have arisen and their remainders of that world, right? They're the possibility of some kind of humanoid creature that is not us, but that was there before us, or that is a kind of remainder of our ancient past. And so there's really no way to get around this type of mythology. And it's a good way to kind of try to connect all of the elements of the giants together. And so I would suggest, you know, just do it. Take a test, right? Look at the different legends of giants and see if you can find the thread of what I'm saying. If you can, if you can notice how the giants manifest these different aspects, which is really a misalignment of heaven and earth and what that looks like. Whether it is in some ways a kingdom out of control where the power of the institution is now acting like a tyranny on us or whatever, or whether it is a savage giant wearing, you know, animal skins with a club that's eating humans, all of that manifests this misalignment between heaven and earth. And so I hope this was helpful and I encourage you to sign up for for God's Dog for the Kickstarter. We're going to. We're trying to launch around the 30th, but we want as many people subscribe because we're going to have early bird specials for those who are willing to go in there first. And in this book you will really will discover, you know, what is the relationship between the garments of skin between, you know, and these giants that appear in the first book. And it's all related to mature and I's understanding of this question of residues, of remainders and of the pre diluvian world. And so I really hope to take all of you along on this trip to discover the continuation of God's Dog, which is called God's Dog Warrior. And so thanks everybody for your support and we will talk very soon. Bye bye."}
