{"episode_id":"SW - #265 - 2022-12-16 - The Burning Bush - Exodus 3 - 4","start":0.4,"end":3687.06,"speaker":"Jonathan Pageau","text":"Saint Gregory really gives us a beautiful image. And this is actually one of my favorite images in the life of Moses. And I'm actually going to read it to you because it is so amazing. It really is like, if you want to understand everything I do, it's pretty much contained in this text. So when he says that when you remove the garments of skin and you enter into the holy place, or you remove the coverings and you come into the place where God is manifesting himself in the world, he says, when we do this, the knowledge of truth will result and manifest itself. The full knowledge of being comes about by purifying our opinion concerning non being. In my view, the definition of truth is not to have a mistaken apprehension of being. Falsehood is a kind of impression which arises in the understanding about non being, as though we what does not exist does in fact exist. But truth is the sure apprehension of real being. This is Jonathan Peugeot. Welcome to the symbolic world with Jordan Peterson's Daily Wire Exodus seminar, in which I participated a few months ago and which is streaming now on Daily Wire. They're putting out episodes, I think once a week now. I thought I would really continue looking at Exodus as a kind of compliment. Adding to the discussion which I had, the last video I did was on the first few chapters of Exodus. We're going to do chapter three and chapter four, which is really the burning bush. This is one of my favorite parts of the text, but it's also one of my favorite parts of St. Gregor of NYSE's commentary on the text. And so I'm going to dive a little more into St. Gregor of Nyssa in this particular episode. And we're going to look at what it is that's going on in the story of the burning bush, leading all the way up to one of the strangest stories in scripture. The circumcision of Moses, son by the hand of Zipporah. As God is coming to kill someone, either Moses or. Or Moses's son in his tent. And so I think I have a little bit of insight to offer you. Of course, I. Sadly for that story, I will not be able to completely unlock the mystery. But I do have some insight I think I can offer, starting at the beginning of chapter three of Exodus. Now, Moses was tending the flock of Jethro, his father in law, the priest of Midian. And he led the flock to the back of the desert and and came to Horeb, the mountain of God. And the angel of the Lord appeared to him in a flame of fire from the midst of a bush. So he looked, and behold, the bush was burning with fire, but the bush was not consumed. Then Moses said, I will now turn aside and see this great sight why the bush does not burn. So when the Lord saw that, he turned aside to look. God called him from the midst of the bush and said, moses, Moses. And he said, here I am. Then he said, do not draw near this place. Take off your sandals, off your feet, for the place where you stand is holy ground. And so the first thing to understand, which is very important here, is, of course, the importance of understanding that as Moses is ascending the mountain, what we're going to see this is going to be true everywhere in this story, which is that Moses is a microcosm of Israel. We have to keep thinking in fractal structures. Moses is a microcosm of Israel. The story of Moses is a microcosm of what's going to. What's happening to Israel. And so we can see that Moses going up the mountain here and seeing the burning bush in the mountain of God is a preview or is a little version of what will later happen when the entire nation of Israel is gathered around the mountain and Moses goes up the mountain to encounter God. It is very important to understand that if we want to understand the symbolism. Most of you, I hope many of you will have read St. Gregory of Nyssa's Life of Moses, and you will see that St. Gregory takes certain things for granted. That is, he takes certain understandings for granted. His text is very slim, and he presents things sometimes which may look to people like a kind of jump in logic or a kind of jump in. In understanding or analogy, let's say, too much analogy. But when you look at the text, you realize that his analogies are deeply, deeply grounded in this structural vision of how the text lays itself out. One of the things that St. Gregory, for example, emphasizes, although I'm not sure it's there in the Hebrew text, but he says that it is a thorn bush, it's a bramble bush that he would have seen in the desert, in the mountain, which is not completely unfathomable, considering that, you know, those are the types of bushes that can grow in deserts, are thorn bushes. And so the importance of understanding that it is a thorn bush can help you understand what it is that's going on. That is, Moses is coming up the mountain, and he is encountering two extremes. He's encountering the fire in the thorns. Now, the thorns are, of course, the thorns of the fall. That is what's going on. The Bush represents the fallen world, right? The fall, the consequences of the fall. And so he is seeing the fire of God burning inside, the consequence of the fall, but not totally consuming it, not consuming it. There's these two things that exist together. And so St. Gregory really sees this as an image of. Of the Incarnation, and especially as an image of the Incarnation based on the notion of the Virgin. And so we have traditional icons in the Orthodox Church where we will see the burning bush represented as the mother of God with her hands up, with the image of Christ in her center. And this is something which comes in part, for sure, from St. Gregory directly, because he talks about how the burning bush is an image of, you know, the virgin's virginity not being consumed in the. The manifestation of Christ. But it's not just about not being consumed, but also the possibility of manifesting God, right? The possibility of manifesting God in the Incarnation. This is what we mean by not being consumed. Because we have to understand that in Exodus, God is represented as this all consuming fire, which, which will consume everything if it's not connected to it properly. And so there has to be the proper relationship between God and the world in order for what we see in the burning bush to be possible, which is for God to be present in the world without consuming it. And so this is why the burning bush is so important, because it is a kind of miraculous event where God is present in the world without completely consuming it. Which is why it is an image of the Incarnation ultimately for Christians. But why it is in some ways the beginning of what will be set up later, which is that God is going to manifest to Moses the manner in which he can be in a relationship with the world without consuming it. And that will imply a hierarchy and a set of mediations which will mediate, let's say, the presence of God down into the world in order to be able to be there. And so you can see already that the question of mediation is important in the story, because Moses, immediately he covers his face. But it's interesting because there is in the approach to the burning bush a uncovering and a covering. And so this is of course, the mystery of the revelation of God all the time. It is always this mystery of the relationship between covering and uncovering. And so how things, veils cover the holy place. But they in some ways reveal the holiness, because even in their veiling. And so that's why there's this mystery of a relationship between veiling and unveiling in the idea of. Of manifestation, right? Because the only way to See, God is through mediations, but those mediations are at the same time a covering. And so that's why, on the one hand, Moses removes the sandals from his feet and but then also covers his face. Those two things are kind of happening simultaneously to show you this. This mystery of how it is that you can encounter the infinite in the finite. How can you do this? What's important to see here is, of course, the idea that Moses removes his sandals in order to come into the holy place. Like I said, it's important to understand the fractal nature of this. Saint Gregor of Nyssa really points us in the right direction when he links the fact that Moses removes his sandals in order to come to the holy place. And this removal of the sandals is an image of circumcision. It is an image of removing the animal garments of skin which God gave to Adam. And so God gives to Adam these garments of skin which are there to be a protection from the thorns, you know, and they're right. They're good to have these garments to protect you from the thorns. But if you want to come into contact with the manner in which God reveals himself in the thorns, then you have to remove the garments of skin in order to be able to have that revelation. And so it's deeply linked to the story of Adam and Eve in the garden of Genesis. But like I said, it's deeply linked to what will happen later. And so St. Gregory pointing us to the fact that he removes the sandals in order to come into contact with God in the burning bush is directly related to when Moses goes up the mountain to receive the law that what he will leave down there at the bottom of the mountain will be the golden calf. The animality will stay at the bottom. And St. Gregory points to the fact that in the ascent, it says in the text that the animals should not even touch the mountain. And that he sees this as this image of animality which is lower and has to be, let's say, removed in order to come into contact with the revelation of God. But when he come into the. The revelation, this moment where you encounter this St. Gregory really gives us a beautiful image. And this is actually one of my favorite images in the. In the life of Moses. And I'm actually going to read it to you because it is so amazing. It's. It really is like, if you want to understand everything I do, it's pretty much contained in this text. And so when he says that when you remove the garments of skin and you enter into the holy place, or you Remove the coverings and you come into the place where God is manifesting himself in the world. He says, when we do this, the knowledge of truth will result and manifest itself. The full knowledge of being comes about by purifying our opinion concerning non being. In my view, the definition of truth is this not to have a mistaken apprehension of being. Falsehood is a kind of impression which arises in the understanding about non being, as though what does not exist does in fact exist. But truth is the sure apprehension of real being. So whoever applies himself in quietness to higher philosophical matters over a long period of time will barely apprehend what true being is, that is what possesses existence in its own nature and what non being is, that is what is existence only in appearance, with no self subsisting nature. It seems to me that at the time of the great Moses was instructed in the theophany, he came to know that none of those things which are apprehended by sense perception and contemplated by the understanding really subsists, but that the transcendent essence and cause of the universe on which everything depends alone subsists. For even if the understanding looks upon any other existing things, reason observes in absolutely none of them the self sufficiency by which they could exist without participation in true being. On the other hand, that which is always the same, neither increasing nor diminishing, immutable to all change, whether to better or worse. For it is far removed from the inferior, and it has no superior standing, in need of nothing else, alone, desirable, participated in by all, but not lessened by their participation. This is truly real being, and the apprehension of it is the knowledge of truth. So what St. Gregory of Nyssa is setting up for us here is the idea that I've talked about several times on the channel, which is that things exist. He sets it up in an extreme way. So he says nothing exists on its own. Things only exist to the extent that they are dependent on self subsisting existence, that they are dependent on God. And if we wanted to use other words that maybe can help you understand more being, we could say the good. We've talked about this, that things are dependent on their good. They exist in their good. So although St. Gregory, he sets it up as this radical distinction and it makes sense to do that saying nothing exists if they don't exist in God. There's a way in which we could say only God fully exists because he is the he doesn't have other causes above him. He is the cause of all causes. He is self subsistent existence and all things depend on him for their existence. But you could also understand it fractally in the way that is suggested in the Exodus text, which is that things exist in their goods and those goods in the intellectual, let's say the physical things exist in their intellectual goods. And those intellectual goods also don't have self subsistent nature. But it all scales up and moves towards something like an infinite good, which is the source of all the other goods and the way which they exist. And so anything which is grasped for itself, and we acted on it, if we act on it as if we think that it has independent existence and existence in itself becomes an idol. And this is of course, what is the whole much of the story of Exodus is about, which is why you can understand, for example, the story of the, of the golden calf, because there's nothing wrong with a golden calf, but that if you try to make it into a point of attention on its own, then it becomes bad. But if you see it as scaling up towards higher and higher goods, then it participates, then it finds being, then it becomes something which participates in this transcendent possibility. And so you can see that this is true of anything. We've talked about this before. It's true of, of any action that you do, whether it's the normal actions of eating or, you know, making money or working or loving other people. Like all these things are good if they scale up towards higher goods. And they become, let's say, they manifest their illusion if you try to grasp them for themselves. And so if you, if you grasp it for themselves, it's an illusion. But if you see how it is connected to higher and higher beings, then it becomes good, then it become, then it has its proper level of being, you could say. And so this is of course what St. Gregory is pointing towards. And it's pointing towards how all of these is, is pointing towards, let's say, the incarnation as the very movement of this, as the very movement of the highest into the lowest. And how, if things are seen properly, that this not only becomes possible, but becomes the very way in which the world actually exists. And so St. Gregory sees the image of the burning bush essentially as an image of ultimately of the incarnation, which can be understood as the possibility of the transcendent to manifest in the, the particular. And so when we look at all the other aspects of the burning bush, we're going to notice that this is what is, this is what he's going to see almost everything in that story as related to, and it will make sense and for people watch, who watch my content, you'll understand it, especially if you understand it fractally, as something which is true in the absolute, but is also true at every level, that is, at every level that has a transcendence to it, that has a good, which is above the particulars that this is true all the time, all the way up into the highest goods. All right. And so let's continue. All right. So then he said, do not draw near to this place. Take your sandals off your feet, for the place where you stand is holy ground. Like I said, this is circumcision. It is removing of the garments of skin. Moreover, he said, I am the God of your father, the God of Abraham, the God of Isaac, the God of Jacob. And Moses hid his face, for he was afraid to look upon God. And the Lord said, I have surely seen the oppression of my people who are in Egypt and have heard their cry because of their taskmasters, for I know their sorrows. So I have come down to deliver them out of the hand of the Egyptians and to bring them up from that land to a good and large land, to a land flowing with milk and honey, to the place of the Canaanites and the Hittites and the Amorites and the Perizzites and the Hivites and the Jebusites. Now, therefore, behold, the cry of the children of Israel has come to me. And. And I have also seen the oppression with which the Egyptians oppressed them. Come now, therefore, I will send you to Pharaoh that you may bring my people, the children of Israel, out of Egypt. So there are a few things to understand in this revelation. The first thing is that God presents himself as the God of Moses's ancestors. And this is important because this is what in some ways is happening from fractally, because you can. You have to understand the Israelites as this kind of scattered people in Egypt that God has forgotten, that God doesn't remember, that they also don't really remember themselves and, you know, aren't able to. To come together as a people and exist as these. As this potential for the Egyptian tyranny. And so God is saying he's going to deliver the Egyptians out of. Of Egypt. But it's important that he also connects himself to the order of being that the Israelites have, which is he's saying, you know, I am the God of your ancestors. I will gather you back to myself. But I will also gather you back to the identity in your father, Abraham, and. And your father's Abraham, Isaac and Jacob. And. And so God is going to do that at different levels. And it's important to understand because you'll see that Israel, when they leave Egypt, they're represented as a. As a. Even not. The people that leave aren't actually just the actual descendants of Abraham. They're that plus a gathering of all kinds of people. You know, they are a mixed multitude. And that the creation of these intermediary structures, of the giving of the law, that Moses will do what will bind them together as a nation and will create a hierarchy amongst them, even though some of them aren't even actually descendants of Abraham. And if they agree to follow the covenant that God will give them, then it will bind them to the identity. And so this is important because a lot of people sometimes see that Christianity is somehow factitious, because there are places where St. Paul talks about how you are also children of Abraham as Christians because you participate in this covenant. But this is something which was there in Exodus. It's already there in the Exodus story. And so in the version of the Christian version, it's only, let's say, expanded even more. But it's not new. It's not something which just comes out of nowhere, but rather finds its place in the Exodus story as the manner in which the mixed multitudes are able to cohere towards unity and towards participation in Israel and becoming. Becoming children of Israel. And so God says that he remembers Israel, and not only that, but he sees Israel. And this is important in understanding the manner in which, first of all, even how creation was done, we have to remember. When God creates, He creates. And then he sees. And he sees. He evaluates. When he sees, he notices the phenomena that he's created. And then he evaluates that it's good. And in this, he's doing the opposite. He's seeing that it's bad, but he is. He is noticing, let's say. That's really important because a lot of what's going to happen has to do with the problem of attention and noticing and memory. And so God remembers Israel and so he wants to reconnect with Israel. But in some ways Israel is too scattered. Israel is too far from God, we could say, in order to be able to properly connect to Moses. And so what God has to do is he has to create all these intermediary structures, these mediating structures, these veils is a good way to understand it in order for him to be able to connect with them. But he also has to remove the improper veils and remove the improper aspect of the Egyptians in order to be able to join with Israel. So it has to do exactly with what we saw in the. Right away, when Moses comes to the mountain, he has to cover his face, but he removes his sandals. So he's removing the improper aspects of the Egyptian covering, we could say, or the animal covering the uncircumcised flesh. But then he's also covering his face in order to manifest the proper mediation in order to be in contact with God. And so this is something which you'll see if you understand it that way, there's a lot of the things that happen that are going to. That are going to make sense. So God says he's going to bring Israel into the land of milk and honey. And it's interesting to understand the land of milk and honey and to understand that, you know, what are those images like, what does this represent? And so the land of milk and honey seems to represent something like that which is tame, the best of what is close, that is the pure, you know, the tame animals that produce milk or the mother that produces milk. The idea of something which is also in some ways for nourishing and then the best of the wild, or the best of that which is barely connected. And so. But that is also extremely sweet. And that seems to be the honey. And so because, you know, the idea of why honey is kosher in. In the laws is very. It's ambiguous, right? It's like, it's. It's. There are a few of these types of food which are a little ambiguous. And so if you want to understand the best image of the land of milk and honey, it really is an image of the deises. And you see in Christianity you have this image of Christ in the center with the mother of God on his right hand and St John the foreigner on his left hand. And that really seems to be something of what is represented here, which is the best of the right hand, the best of the left hand, the best of that which is close and nourishing and pure, you could say. And then the best of that which is wild, because of course, people would gather honey in the wild. They would gather it from. They didn't necessarily have honey the way that we have it now, that the best of that which is wild and the best of the wild prophet in the desert wearing the garments of skin. And so you have these two extremes where God is saying, this will be the land which is flowing of the best of the two sides of reality, you could say. And so that's, of course, a very interesting part of it. So God says He's going to send Moses as his envoy to right towards the Egyptians, and he's going to deliver Israel by him. But then Moses comes back to God and says, but Moses said to God, who am I? That I should go to Pharaoh that I should bring the children of Israel out of Egypt? So he said, I will certainly be with you. And this shall be a sign to you that I have sent to you. When you have brought the people out of Egypt, you shall serve God on this mountain. Then Moses said, indeed, when I come to the children of Israel and say to them, the God of your fathers has sent me to you. And they say to me, what is his name? What shall I say to them? And God said to Moses, I am who I am. And he said, thus you shall say to the children of Israel, I am has sent me to you. Moreover, God said to Moses, thus you shall say to the children of Israel, the Lord God of your fathers, the God of Abraham, the God of Isaac, and the God of Jacob has sent me to you. This is my name forever. And this is my memorial to all generations. Go and gather the elders of Israel together and say to them, the Lord God of your fathers, the God of Abraham, of Isaac and Jacob, appeared to me saying, I've surely visited you and seen what is done to you in Egypt. And I've said, I will bring you up out of the affliction of Egypt to the land of Canaanite and the Hittites and the Amorites and the parasites and the Hivites and the Jebusites, to a land flowing with milk and honey. Then they will heed your voice. And you shall come, you and the elders of Israel, to the king of Egypt. And you shall say to them, the Lord God of the Hebrews has met with us. And now please let us go three days journey into the wilderness that we may sacrifice to the Lord our God. But be sure that the king of Egypt will not let you go. No, not even by a mighty hand. So I will stretch out my hand and strike Egypt with all my wonders which I will do in its midst. And after that he will let you go. And I will give this people favor in the sight of the Egyptians. And it shall be when you go that you shall not go empty handed. But every woman shall ask of her neighbor, namely of her who dwells near her house, articles of silver, articles of gold and clothing. And you shall put them on your sons and your daughters, so you shall plunder the Egyptians. So in this text you can really see, you know how this connects with what I was talking about before, which is that when St. Gregor of Nyssa talks about God being, being in itself, being, that has no other causes, you can really understand that in this text, God says, I am. That I am. That is, I am that which names. I'm the only thing that can name itself. You could say, because he is the origin of being, he doesn't have anybody else naming him. And he in some ways almost doesn't have a name. His name is simply Being. His name is I am. And so you can see that there's a relationship right here, because God says, tell them I am sent you, true being sent you. But then he says, then tell them that I am the God of your ancestors. That is, it connects fractally down the levels from true being and being itself to the way in which you recognize yourself to have being. That is, how do you recognize, how does Israel have being? It has being by sharing a common origin in the patriarchs. They have. They have this common ancestor. And of course it makes sense because this ancestor had a covenant with being, had a covenant with God himself. And so it all connects together that this is the way in which it works down the hierarchy. And so if you look at the text, I mean, it's very interesting. And so God says, I am being. I am the God of your fathers. I am the way in which you connect to your identity. I remember you. I have seen your scatteredness. I've seen your suffering. I've seen that which is breaking you apart. And now I will gather you back. And how will I do that? You will come out and you will all come to the mountain together, and you will gather together at the mountain, and you will worship me and at this mountain. And then you. This is how you will join together. This is how all this is going to happen. And then I will bring you to a land flowing with milk and honey. After that happens, after we are able to, after all this connection has been done and you've remembered who you are, you are remembered, brought back together, and you receive something from above. And now you will be move out towards the land of milk and honey. And so what was interesting is that if you look at the entire text, you can really see there's an interesting kind of hierarchy just in. In the way in which God presents himself. He starts with being, and then he ends with the idea that you are going to plunder the Egyptians, that is, you're going to take riches from the Egyptians. So he starts with being itself, moves down to identity, talks about gathering the People together and goes all the way towards the edge and says, this is also how you're going to take from potential, from the stranger. You're going to take your possibilities and you're going to gather them together as well. And so it's like this whole cosmic image of how being moves all the way down to. Even into the idea of, you know, leaving Egypt and gathering the. Gathering all the strange. And this is important. Like the idea of plundering the Egyptians is an image which is very important in, in. In the commentary of St. Gregory of Nyssa, but also in other church fathers where they talk about this, which is San Gregory of Nyssa really represents the Egyptian as being all that which is not, let's say, which is pagan, which is secular, which is not directly coming from the revelation of God. This kind of indirect aspect, like I said, philosophy, science, all these other, all this other knowledge. And St. Gregory talks about how, you know, we are called to plunder the Egyptians, that is, take which is good from this, these, this outside knowledge and gather it together towards being, towards the highest being. And that is how it's going to find its true value. And so, you know, the Egyptian is a tyrant. If the Egyptian rules over you, but if you are subject to God and you're subject to the highest good, then what the Egyptian offer becomes potential for you. And so there's this interesting reverse potential if you reverse relationship. If you remember in the first chapter, the first video, I talked about how the tyrant, the Egyptian, wants to reduce the Israelites to being potential for his tyrannical rule. Well, here you see a similar structure, but now it's seen as being good. That is, that which the Egyptians offers is gathered together towards a higher purpose, not just the tyrant, but then all the way up towards serving God, serving being itself. And this is what St. Gregory talks about. This is the text. This is why the text that I read from you, from St. Gregory is so important, because it shows this symbolic structure that I've talked about in terms of Dante, that I've talked about in different guises of how realities exist together all the way up a hierarchy of goods. And it's presented very beautifully in this statement that God makes. So Moses isn't sure and this is going to be important to understand. Moses hesitates, of course, and he says, so then Moses answered and said, but suppose they do not believe me or listen to my voice. Suppose they say the Lord has not appeared to you. So the Lord said to him, what is in your hand? He said, a rod. And he said, Cast it on the ground. So he cast it on the ground, and it became a serpent. And Moses fled from it. Then the Lord said to Moses, reach out your hand and take it by the tail. And he reached out his hand and caught it and became a rod in his hand. That they may believe that the Lord God of their fathers, the God of Abraham, the God of Isaac, and the God of Jacob, has appeared to you. So what is going on here is what just happened. Like, it's just a repetition of what just happened. It's a repetition of what God said when he said, I am. That I am. And then he says, I am the God of your fathers. And he moves all the way down, and he says, you will gather the riches of the Egyptians in service of the highest God. And so now God is exemplifying it in practice. A very simple. In a very simple way, he's saying, you're holding a rod. And this rod is the image of the vertical. Like you could say it's the image of the mountain. It's the image of identity. It's the image, you know, it has the masculine quality. And so it's the image of the name, right? It's that which. Which is straight. It's the right. And then he says, let go of it. And as he lets go of it, then it becomes change. It becomes a serpent. It becomes that which is wavy, that which moves from left to right, which doesn't have a direction. It becomes something like missing the mark. It becomes potential, it becomes the waters. And that's why it's also thrown on the ground. So, you know, it's standing up. He puts it down on the ground, and then it becomes water. It becomes changey and shifty and all those things. And then he says, grab it again, right? So let's say, grasp the potential. And then when he grabs it by the tail, then it turns back into. It recovers its identity. And so this is what God said. He said, you will go to the Israelites in Egypt, and you will call them out of Egypt, and they will come and gather around the mountain of God, and then they will become one people. They will become my people, and I will be their God. And there'll be this vertical relationship which will be established. And so he's showing you how attention works, basically, right? How things gather together in attention and move from potential into identity. And this is, you know, this is something that you can experience. This is something that you experience all the time. You move out into reality. That is how you. You grasp that is what attention is, it's like you. There's a quantity of phenomena. You grasp it mentally, not just physically, but you also do it physically as well. And that's how you discover the identity. You gather it together into one, and then when you let go of it, then you discover its multiplicity, you know? And so this is what John Vervaeke talks about this, you know, all the time. He talks about what he calls optimal grip, which is the notion that when we. When we hold on to things physically, we have to be careful not to grasp them too tightly or too loosely. We have to find the optimal way in which we can hold them. And this is true physically, but it's also true in terms of categories, in terms of identities, because identities are made of multiplicity and unity. And so you have to be able to find that balance between the two. And here in the text, you see the movement from one extreme to the other. But in reality, this happens, sorry to use the word fractal all the time, but it happens at every level, and it happens subtly in terms of every moment. You're constantly judging between letting go and grabbing the serpent. You're constantly judging between the rod and the serpent, between that which is one, that which is many, that which is stable, that which is fluid, that which has identity, and that which is changing, because all of that is part of reality. So this is really a very powerful image of what. Of just how reality works. Segregation of Nietzsche, really. He sees it obviously as an image of the Incarnation itself, as the manner in which God can move into creation. And so when, you know, the serpent, when Moses lets go of the rod, then he becomes a serpent. And St. Gregory goes as far as saying and repeating the words of St. Paul, which is that Christ became sin for us, that missing the mark is what Christ became. And in becoming, that, then in some ways returns it to the Father. And let's say he becomes the snake. And the snake, which would then be regathered up into the rod. And that would be, of course, an image of the resurrection, an image of the man which Christ gathers all things up into. Into the Father. And so that is the. That is the. The image. And so then, if you understand that, then you can notice that the second image that Moses gives. So furthermore, the Lord said to him, now put your hand in your bosom, and. And he put his hand in his bosom. And when he took it out, behold, his hand was leprous like snow. And he said, put your hand in your bosom again. So he put his hand in his bosom again and drew it out of his bosom, and behold, it was restored like his other flesh. Then it will be, if they do not believe you or heed the message of the first sign, that they may believe the message of the latter sign. So you can notice that now we have the similar image, which one was a vertical to horizontal, right? A rod to a snake on the ground. Now it's the center to the periphery. And so he's saying, you know, bring your hand into your bosom, and when you exit becomes disease or it becomes leprous. And then when you bring it back, then it becomes healed. And again, St. Gregory sees this as an image of the Incarnation. And as you know, it's basically the same image as the snake and the rod. There is one possible difference, is that there might also be a hint that this in some ways might be the opposite of the other one. And that is something that you can ponder on yourself, something that I've thought about, which is it has to do possibly with an excess of purity. The idea of leprosy in the Old Testament, the idea of your skin becoming white as snow seems to have something to do with an excess of purity, and not exactly the same as an excess of the snake. But this is something that I'm not 100% sure of. But if we take the story of the. The. The story of. Of Miriam and Moses's Ethiopian kushite wife, that seems to be. What's going on is that, you know, Miriam criticizes Moses for having a dark wife. And then she becomes as white as snow. And. And so it becomes like. It's like a. It's like a funny. It's not funny, but it's like an ironic punishment where she becomes too, too light. And that too light is actually a. Is a. Is a. Is an excess of purity. But you could also probably see it, I mean, saint, for sure, Saint Gregory sees it as the idea of the incarnation and disease. He sees it more in the sense of disease. So something healthy moves out into disease and thump. Something disease, disease moves back into that which is healthy. And so I think that that's also a completely appropriate reading of this particular text. And so then you will have the Last sign, verse 9. And it shall be, if they do not believe even these two signs or listen to your voice, that you shall take water from the river and pour it on the dry land. The water which you take from the river will become blood on the dry land. And so here, of course, he is talking about the plagues. And you can Kind of understand that in some ways, he's hinting at the plagues from the beginning. The plagues are like a exploded version of what it is that's going on here in terms of the sign of something untouched turning into blood. Now, as Christians, it's very important to. To understand what is going on here and also understand what, at least in the Christian story, this is going to return. Now, where are the plagues leading to? Right. We're going to see this later when we get to the actual plagues. But the plagues are leading to the final plague, which is the death of the firstborn. And the changing of water into blood leads to the death of the firstborn ultimately. And you can understand it as a kind of saturation of reality, as well as moving from, let's say, that which doesn't have any identity to that which is something like a kind of controlled. A controlled breakdown of identity. Right? That's what wine is. It's like the extreme of fermentation. And so in some ways, it's like a controlled decomposition. So you have purity without any identity. Then you have wine, which is kind of inebriating. And you also have the milk honey situation here. Sorry, I'm talking about wine already. But this is. It's blood. But you can understand where I'm going with this, which is that in the story of the Winning of Kanna, it's referring to the plagues of Egypt, because the changing of the water into blood leads to the death of the firstborn. And now once you understand that, you can understand why the strange story of the Winning of Kana represented represents itself that way. Which is, why is it that. Why is it that, you know, when the Mother of God says to Christ, there's no wine there, and he knows he's going to change water into wine, that it means he's going to die. It's like it's leading him to his death. This is deeply ingrained in the story of Exodus, in the story of the plagues. But then, you know, you'll see how the whole idea of the death of the firstborn has a lot more than you think related to it. All right? And so then Moses said to the Lord, o my Lord, I'm not eloquent, neither before nor since you have spoken to your servant. But I am slow with speech and slow of tongue. So the Lord said to him, who has made man's mouth, or who makes the mute, the deaf, the seeing, or the blind? Have not I the Lord? Now therefore go, and I will be with your mouth and teach you what you shall say. But he said, o my Lord, please send by the hand of whoever else you may send. So the anger of the Lord was kindled against Moses. And he said, is not Aaron the Levite your brother? I know that he can speak well. And look, he is also coming out to meet you. When he sees you, he will be glad in his heart that you shall speak to him and put the words in his mouth. And I will be with your mouth and with his mouth, and I will teach you what you shall do. So he shall be your spokesman to the people, and he himself shall be as a mouth for you, and you shall be to him as God. And you shall take this rod in your hand with which you shall do the signs. And so I hope by now you can see how this is becoming connected together. And so God set up a relationship of the way in which he is being itself, and then also the way in which he is the God of the ancestors of Moses, the God of the ancestors of Israel, and the way in which Israel the. The place in which Israel binds together. And so now God is telling Moses to go speak, to be his spokesman, right, to be a representative of him. And Moses said, I am not able. I cannot speak. And so now we're going to start to see God set up the intermediary structure between himself and the world. And it's going to start already with Aaron. Now, it's important to understand these things are. They're a little difficult to perceive, but once you start to perceive them, you'll notice. So a good example would be in the story of King David. The Israelites ask for a king, and then God is angry and in some ways doesn't want to give them a king. But then ultimately relents, gives them a king. But then the king becomes the tool of God in the world. The one who builds the temple, he becomes the one who builds the house for God. And so sometimes we see the text a little too simply. And so we say, you know, kingship is bad because God didn't want Israel to have a king. But that's not how it works. It's that in some ways you could say that that which is below, because of its insufficiency, requires mediation in order for God to manifest himself in the world. And so Moses asks for something to mediate, and then God is angry, but then God ultimately relents. And that's the way in which it happened. God gives Moses it's an extension of himself. And so here you really See the fractal relationship getting set up. It's pretty clear. God says to Moses, aaron will be your mouth, right? And then you will be my mouth in some ways, and you will be as God to him. I mean, it's pretty wild. That's written in the text. It's like Aaron's God will be you and you and I will be your God. Obviously not completely, but in this context, there is this, this self. Same relationship, this fractal relationship going down the manner in which mediation appears. And so, and so you, you can see how even though you could also get the sense that Moses is Aaron's heart, you know, that's why it says like, he's glad in his heart when he meets Moses, because Moses is one level lower than God. And then he speaks to Aaron and then Aaron speaks to the people. So Moses appears as hidden behind a veil. Now Aaron is his veil. Moses is constantly, you know, hiding himself behind a veil in the sense of God, but then also for the people, like when he comes down the mountain and puts a veil on his face, well, God is doing the same to Moses. Now he's saying, I'm going to put a veil on your face, and thou, this thing that I'm putting in front of you that will manifest you in the world will be Aaron. And so it's pretty interesting. And St. Gregory of Nyssa really gives us a powerful image. And this is one, like I said, one of my favorite. This whole part is my. One of my favorite aspects of St. Gregory of Nyssa's commentary. Because here St. Gregor Garnisa talks about Aaron as the helper, and he really presents it as the angel and the demon, right? The angel on the right shoulder and the demon on the left shoulder. And so the guide, the helper. This aspect of Moses, which can either bring him up or bring him down, and you can understand it in terms of a supplement, in terms of the idea of mediation or the problem of mediation, because mediation always causes a problem, which is the problem that St. Gregory of Nietzsche brings up in his text, which is that if you create mediating levels between with that which is above and that which is below, then those mediating levels are always in danger that people will see them as having being in themselves. Themselves will attach to them too much. And because of that, they will appear as an illusion, as a mistake, as an error. And so Aaron is exactly that. Think about it. God says to Moses, aaron will be the one doing the signs and manifesting you in the world. So he's like one step down on the hierarchy of mediation. But then who makes the golden calf? Heron makes the golden calf. Right? That's the problem of mediation. It's the problem of creating these levels coming down. But it's also inevitable, and it has to be done appropriately. And we could say that all of the book of Exodus is about understanding the way in which these mediating levels exist. And the ultimate image of that is going to be the tabernacle. Because the tabernacle, that's what the tabernacle is. The tabernacle is the manner in which the presence of God is mediated in the world through ritual, through space, through layers, through veils, through sacrifice, through offering up, receiving down. All of this is what the tabernacle is. And that's why the tabernacle is an image of reality. And that's, of course, the way that St. Gregory presents it in his own text as well. All right, and so let's continue. Verse 18. So Moses went and returned to Jethro, his father in law, and said to him, please let me go and return to my brethren who are in Egypt and see whether they are still alive. And Jethro said to Moses, go in peace now. The Lord said to Moses in Midian, go, return to Egypt, for all the men who sought your life are dead. Then Moses took his wife and his sons and set on a donkey, and he returned to the land of Egypt. And Moses took the rod of God in his hand. And the Lord said to Moses, when you go back to Egypt, see that you do all the wonders before Pharaoh, which I've put in your hand. But I will harden his heart so that he will not let the people go. Then you shall say to Pharaoh, thus says the Lord, israel is my son, my firstborn. So I say to you, let my son go so that he may serve me. But if you refuse to let him go, indeed, I will kill your son, your firstborn. You can see being set up, right? The idea of the giving of the firstborn and how it is related to how reality works, which is that Egypt has to let God's firstborn go in order to be made sacred, in order to be given up towards God. And though he says, if he doesn't do that, then I will take his firstborn. And we're going to talk about this a little later when we get to the actual plagues. But this is obviously the plagues are being set up in this text, and a lot of people really struggle to understand the next part, which is coming. So I'm not going to go too Much in terms of understanding the idea of the giving up of the firstborn and why that's important. We'll talk about that when we get to the place because we've already been going for a while now. But when we read the next part, maybe it'll help you already see. Hopefully, if you've been listening to me for a while, you'll start to understand at least what's going on here. So the next part is one of the strangest texts in the entire Bible. And so here it is. And it came to pass on the way at the encampment that the Lord met him and sought to kill him. Then Zipporah took a sharp stone and cut off the foreskin of her son and cast it at Moses feet and said, surely you are a husband of blood to me. So he let him go. Then she said, you are a husband of blood because of the circumcision. And so what is happening in this story now? There's a few things going on, and it's a very ambiguous text. The way it's written is ambiguous. It means that even when the way that it's translated, it's translated in a way that's trying to kind of guess at what the meaning is. Because first of all, it says, and it came to pass on the way at the encampment that the Lord met him and sought to kill him. And so the question is, who is he trying to kill? It's not clear whether it's Moses or the son of Moses. And then Zipporah took a sharp stone and cut off the foreskin of his gun and cast it at Moses feet. Now, again, in the text, in the Hebrew text, at least, it just says, cast it at his feet. Now, it doesn't say whose feet it is, whether it's Moses or the son. And it's actually, possibly not just his feet. It might be his genitals. Because in the text, the genitals and the feet. In the Bible, the feet are a euphemism for genitals. And you see that in the story of Ruth. You could say the story of Ruth is like the opposite of this in some ways, of what's going on here. Because it's related to this, let's say, where the strange woman uncovers the feet of Boaz. And here you have the strange woman circumcising her son and then putting the foreskin on the feet of Moses. Now, at this point, if you. It's funny because St. Gregory of Nyssa doesn't go very far into interpreting this he basically, I'll give you his interpretation, which is excellent, but he doesn't go far. But if you see this, you can understand why is it that St. Gregory makes the analogies between Egyptian stranger in general stranger, foreskin and sandals, and garments of skin, where he makes these all related? Because in the actual text there is a euphemism between the feet and the genitals. And so removing the sandals and removing the foreskin is there in the actual language of the text as being related in terms of what it is that's going on. And so the first important thing to understand is where the text is placed. I've always seen people tend to want to interpret this little sequence as being a self contained event, but we have to see it as following the text before which is, Israel is my son, my firstborn. Let my son go so that he may serve me. But if you refuse to let him go, I will kill your son, your firstborn. And then you have a text where Moses is going back to Egypt and his son is not circumcised. And now God wants to come and kill someone in the camp, either Moses or his son. And in order to prevent that, Zipporah removes the garments of skin around her son and then touches Moses feet with them. And so it's like, it's very mysterious, but it has to do in some ways with the relationship with the stranger which we've been talking about the whole time. And this is what St. Gregor Nyssa says. He says he understands, of course, the son of Moses from Zipporah as the fruit of our union with all that is pagan, all that is secular, all that is all the secular science, all these things. And so the fruit of that union is Moses's son. And now, in order for things to be proper, right, in order for his son to be given up to God, right, let my son go so that he may serve me. Then he has to be purified from the negative aspects of the strange. He has to be circumcised. All the negative aspects of the pagan knowledge, of secular knowledge, you know, all the dangerous, captivating aspects of them have to be weaned and have to be, let's say, cut off in order to be able to present the son of his union with the stranger as being acceptable to God. And so St. Gregory uses the example, he says, you know, in philosophers, in Greek philosophy, they have this idea of the immortality of the soul, which is something that is the right way of thinking. But you can imagine that the fact that the Greeks taught reincarnation or that taught other aspects which were not, let's say, which were kind of were off key, then those things have to be pruned. And so we can read Plato, we can get from Plato an insight and a help even in the language and in the terminology to help us formulate and understand our Christianity. But it has to be circumcised. You have to remove the excess and the things that don't fit, ultimately. And so that's one thing that's going on, but there's another thing that's going on. Like, in terms of structure, folks. Like, it's very fascinating. Think about it just in terms of the story. Moses goes up the mountain, and then he has to remove his garments of skin in order to enter into the sacred place. And now Moses is going back to Egypt, and so his wife removes the foreskin of her son and she touches his feet with them, she puts them on his feet. And so it seems like she's also adding sandals to Moses so that he can move out and go back into the strange land. That seems to be at least part of what is going on there. But like I said, it is a very. It is a very strange text. But I think it's also possible that some of the ambiguity in the text serves the meaning of the text. But for sure, you cannot interpret this part of the story without understanding that it has to do with sacrificing the firstborn and giving the firstborn up to God, which is related to removing the excess and then giving up to God. But like I said, very mysterious. All right. And so then we get to the last part. And the Lord said to Aaron, go into the wilderness to meet Moses. So he went and met him on the mountain of God and kissed him. So Moses told Aaron all the words of the Lord who had sent him and all the signs which he had commanded him. Then Moses and Aaron went and gathered together all the elders of the children of Israel. And Aaron spoke all the words which God had spoken to Moses. Then he did the signs in the sight of the people so that people believed. And when they heard that the Lord had visited the children of Israel and that he had looked on their affliction, then they bowed their heads and worshiped. So, of course, this seems like an obvious thing. It reads very easily, but you have to look at it properly. And this has something to do with the manner in which multiplicity becomes one, the way that I've been telling you guys for years now. So there's the hierarchy, right? Moses and Aaron go Down. And then Aaron becomes the spokesman for Moses. He becomes the spokesman. And then God says, I have seen from above, I've seen you. And now I'm manifesting myself through this hierarchy down to you. And what that looks like is the gathering of the children of Israel together and the worshiping that which is above. And so gathering in order to give attention to that which is. That binds us. So they listen to Aaron, they listen to Moses, and they listen to God, and they worship God. Because that is how, let's say that is how multiplicity binds to one through attention to a common good, something which is beyond the multiplicity. And what that does is it gathers multiplicity into one. And ultimately, in terms of the transcendent, it looks like attention at different levels, but ultimately it becomes worship. And it also means that they bow their heads, they submit themselves to. To that which is above. And that's how they. That's how it all comes together. And so this, in some ways you could say, is an image, a little image of what is coming later, right? Because it says Aaron met Moses at the mountain of God. This is the same mountain that they're going to later. And then he comes down the mountain, and then he gathers the people together and they worship. And so it's a little image of what is coming later when the. They leave Egypt and they go out into the wilderness. And then it's going to happen at a grander scale and at a more, let's say, at a larger. In a way that will bind them, let's say, more permanently, we could say, so that they can actually become a nation, but that also that they can be in a relationship with God through these. These mediations. So I hope this was helpful. Like I. Like I've said you before, like I told you before, this is a compliment to the videos that I'm doing with, that I did with Daily Wire on Exodus. Make sure you check that out. The discussion is very interesting. I've been getting some great feedback from people who have watched the video. So I'm excited to see that people are enjoying it. It's going to continue. And we're also going to do a second part in January, recording the second part from the Law until the end. And I will try to track these as the videos come out with Daily Wire. I'll try to track them with some. With some videos on my own so you can get a little more of what I think of the book of Exodus. So thanks, everybody for your attention, and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Padreau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
