{"episode_id":"SW - #222 - 2022-03-07 - February 2022 Q&A","start":12.08,"end":5778.88,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello everybody. Hope everybody's doing well. So Today is the 23rd. We just found out that for those who don't follow Canadian politics, and I don't, don't blame you if you don't, but a lot of people are, even people that aren't in Canada. So our Prime Minister enacted what's called the Emergency act, which is actually something. It's actually something which replaced what's called the War Measures Act. And the reason why the War Measures act was removed and changed had something to do with Justin Trudeau's father, who was the prime minister in the 70s, enacting it himself and causing a lot of controversy for the way in which was enacted, the way in which people were arrested without a reason and held and stuff. So they change it and called the Emergencies act and, and Trudeau used it, which means it gave him unlimited power, Marshall type power. And he started freezing people's bank accounts and saying he was going to increase it, going to make it longer and everything. And then today he decided to back away and to drop it. So, yeah, it's pretty crazy. Everything's pretty crazy that's going on. And so it's so weird because, you know, you guys have been following me for a while since I pretty much, I've been online, I've been telling people that this is coming and that, you know, that our societies are going to move towards more authoritarian structures and more authoritarian, let's say, impetus. And now that it's happening, I can't seem to deal with it very well. The morning that Justin Trudeau announced the Emergency Measures act, it's like I literally threw my back out and I wasn't doing anything. I was just kind of hanging around, sitting on my computer, and then my back went out. It's like, man, all right, I need to just get my act together. And so, so, all right. So, yeah, it's good to see Jacob in the chat. I haven't seen you there for a while. Jacobus Ruddiness and Lafair. I see in the chat. So anyways, it's good to see people around. It's. It's good to be able to get involved more in the chat the way that we're doing it now. So, so a few announcements for those that are following the God's dog stuff. It's. If you could see my headache. I wish you could see my headache. It is such, it has been such a pain for so many reasons that I won't go into. But I'm still just plowing ahead and trying to get this to happen as it's going to happen no matter what. But it's just the speed at which things are crawling. I feel like, I don't know if it's because Covid has damaged our entire system so badly that nobody seems to be able to do anything at any normal pace. But whatever, it is very frustrating. So don't worry. I haven't forgotten anybody who, who supported Gus Dog. I'm still, still working tirelessly at making everything come together. Interesting announcement is in theory, unless, unless things change, which is possible with all the crazy politics going, going on here. But unless something changes, I am going to be on stage with Jordan Peterson in Montreal on May 23rd at Place des Art, which is, which is one of the big arenas, the big kind of theaters here in Montreal. And so that's pretty exciting. I don't even know what we're going to talk about yet, but it's all getting set up as I speak to you, so that's pretty cool. I haven't seen Jordan since 2017 in person, so that's going to be interesting to see him again. Looking, definitely, looking forward to that. And. All right, so last announcement is, as you know, the way we're doing it is that people who support me on Patreon at $10 or more can ask questions in advance. And someone goes through the questions and kind of filters them. And it's important that you not hand in your questions the last day because the person who is going through the questions will already probably have done the sifting just because we don't want to do it at the very last minute. And so please try to get your questions in well, please. I mean, if you want your questions to be looked at, you want, you have to have them, you have to have them put in. Two people are going through the questions. Brad, I'm happy to know that. I thought it was just one person. So, so the people that are going through the questions, they, they need at least they, they can't do it. They're not going to do it last minute. So just make sure you get your questions in before. And the questions are gone through depending on if it's something that's been asked many, many times or if it's something that's confusing or something that is, that is kind of off color. And so though that's how there are different ways in which the questions are chosen. So bring them back to a reasonable level. And the other thing you can do, if you support me, everybody that supports me on Patreon, you know, from like $2 up or whatever, can come live on the chat. And now that we have less people, I will definitely be engaging with people in the. In the chat. So. So that's the way we're doing it. All right, so here we go with the. The questions. All right. And so I'm starting with the website. So Gideon Yu says. Hi, Jonathan. So my question is, what is the symbolism of snakes or serpents as we see them shedding their skin all at once, whereas basically every other animal sheds its outer layer of death much more gradually? And so I think the way to understand that is it's related to the idea that the snake represents something. Well, two things. Something like change, and then something like the remainder. And so, interestingly enough, if you. If you watch that movie Noah by Aronofsky, which is kind of half, it's kind of 50. 50. A lot of it is weird and some of it is interesting. But anyways, in that movie, the garments of skin that Adam. That Adam and Eve get and that get kind of transmitted down, interestingly enough, very similar to our comic book. We had written it before Aronofsky's Noah came out, but they had the same idea of having, like, this notion of the garments of skin are kind of transmitted down the generations, but in their case, it's a snake skin, which is the garments of skin that they kind of received, it seems, from God. So that's super interesting. And so that's why the snake is the. It's the thing in the garden which is, you could say that's inside, but is not completely of the inside, that comes from the outside or is related to the outside of the garden, but is. But is inside. And that is. It is the variable which brings about change. You know, that's how you experience it in life in general. Something comes from the. Something unexpected, something not part of the system manifests itself, and then you have to deal with it, and the way you deal with it will. Will manifest a change. And so. All right. Hi, Jonathan. As we exist in a largely digital age, surrounded by technology powered and run by electricity, can you comment on the symbolism of electricity and on a related image, lightning. Thank so much for all you do. And so I haven't thought about this a lot, to be honest, but it's the way that we experience electricity, at least, you know, as. As in our houses and in the wires and everything. It has something to do with power. I mean, I'm saying that if you're like, well, yeah, no, so it. It's a. It's an aspect of power. And so a lot of our society is obsessed with power. That is, it is obsessed with the capacity to do more. And that's what electricity provides. It provides the capacity to do more. And so that's mostly, let's say, the symbolism that it has in our lives. But lightning is different. Although lightning is electricity, but lightning really is a kind of pointing from heaven. It really is like, you know, the image, right. Zeus with the lightning bolts, throwing lightning bolts down at people. That's pretty much what lightning is. It's like the finger of God coming down and touching. And so there are some traditions in different countries where the idea that if you died, for example, if you died by a lightning strike, that it meant that maybe you were actually a saint, because it was like God pointing you from above. Like. And Lisa Barrett thinks it's funny. She says that's why we call it power. It's like. Yeah, we call it power. So. But that's. That's the difference between lightning, it's like light coming from above and hitting the ground, and let's say fire coming from above. Heavenly fire is what lightning is related to. So. So it'd be interesting to think about the relationship between the lightning which comes symbolically, the lightning which comes down from above, and then the. The electricity that's in our. Our wires. But I'd have to think about that. I feel like that's something that Matthew would have really good insight in on. Yeah. All right. Josh the mover says it seems that as time rolls on, there are less and less Christians of great aesthetic rigor. This is obviously bound up with the materialism of the present age. But is it possible that the early church produced far more impressive saints by virtue of her chronological proximity to Christ's earthly sojourn? I think of how the holy fire doesn't burn believers, but only for about the first 15 minutes. Thank you. Yeah, definitely. I mean, I think that there's a sense in which. There's a sense in which there's a kind of decline in Christianity from the time of Christ until today. I think that's not too controversial to say that you get that you read that even in some of the monks and some of the ascetic writings where they tend to talk about the difference between them and those that came before them and how, even if it's for us, it's before they had a sense that, you know, they were less than the first Christians or the early Christians and the saints that came before them. And so there's definitely something of that going on, a kind of general sacrifice of. Of quality. Quality for quantity, something like that. So David Flores says, what is the symbolic significance of the ear and big toe? Huh? I specifically thinking about the ritual in which Moses smeared blood on these body parts of Aaron and his sons. Man, I did not remember that text at all. And so it's like, for me, it's as if it's. The first time I read this. I feel like I would. I might misstep. But it, it seems have something to do with extremes. For sure, the ears have something to do with extremes because their ears are shaped like shells and they're. They are something of a shell, let's say. And a shell also in the sense of something which receives the sound. And also, ears are kind of like the extremities of our heads. And then the toes maybe would be like. So it'd be something like covering the blood on both extremities, like extremity above and extremity below. But why the big toe of all toes? Not sure, man. Yeah, that's a tough one. All right, Douglas. Matthew says hello. It seems many current events over the past couple years have some kind of connection. The idea of congestion, constriction, etc. Respiratory infections. Floyd's death that the. Ever given. Jammed in the canal. Clot shots, the Freedom convoy. I have an intuition that as society devolves, a coming coagulation is manifest, manifesting itself in the background. Do you think I am onto something or is something else going on here? No, for sure, I think. I think you've got a. You've got it right. And it's like a. It's something which. There's a weird, contradictory. There's this weird contradictory thing happening. And that happened especially at the time of Floyd's death, which was such a strange event because it was very strange that. That George Floyd seemed to die from an incapacity to breathe. Or at least he. He seemed to express that incapacity to breathe. You see it in the video even before. Even before the policeman puts him on the ground, that he seems to be experiencing an incapacity to breathe. And that the whole I can't breathe thing became like a symbol for this idea of the system which clamps down in terms of racism and everything. But simultaneously the system was clamping down in terms of mask and everybody was forced to wear masks. But there was this opposition where both sides. We're experiencing this kind of restriction, but for different reasons. One, it was More like an actual physical thing. And the other. It was more this sense of the oppressive kind of institutional racism. So it's very fascinating. Fascinating. It's very strange to see that that symbolism seems to be. And you can understand it in. Especially in terms of the breathing. It has to do with the running out of spirit, ultimately, is what it has to do with. It has to do with the sense that we're running out of air, running out of spirit, and then things are jamming up inside because we're running out of spirit. And so the idea of the truckers seemed. That seems to be part of that as well. So. Yeah, and I hadn't thought about that boat that was clogged up. I mean, it's like you can see that it's basically this lack of spirit and then things here, everything getting locked up, you know, and the truckers, it's. It's a really good intuition because I hadn't connected the boat getting clogged up and then also the freedom convoy and stuff trying to stop transport and borders. So, yeah, good insight. So, Mark, greetings from Tbilisi. People talk about individuality, unable to divide, but I see no evidence for this in anyone I've met, including myself. We're not individuals. If we assume that Christ was an individual, then is not individuality a good thing to pursue? If we assume that Christ was an individual, then is not individuality a good thing to pursue? And so I think that it's important to understand, like, if you notice, I rarely ever use the word individual. I mean, I know that Jordan uses that word a lot and kind of the idea of individual rights. And at least I think that in Christian terms, we tend to talk about persons. And the reason why we talk about persons in the traditional sense, the idea of hypostasis, is related to the idea that persons are united by a nature and persons are not individual in the absolute sense, that is, their communal, you could say. So our trinitarian theology and the Christology tends to point towards the idea of something which exists fully. Like a person has its own. Its own reality, its own kind of ontological reality, but that reality is shared with others. And there's a kind of interpenetration between persons that come together and maintain their. Their. Their separateness, but are always being filled and are feeling others with their presence, you could say. And so it's a different. Definitely a different vision. And. And it's one which in a certain manner, doesn't totally jive with just the idea of this. Of the obsession with individual rights and Freedom, which we see in the. In some of the Enlightenment project and something like the American, American project as well. So I would say the. It's better to use the word person. It's a much better, much better term. And it has a richer, has a rich history and a rich connotations that avoid this idea, like you said, of the individual as like isolated or impossible, of being divided. MFP R. YSL asks, can you expand on why you think nominalists ruined everything? He said something in this vein in one of the interviews. We talk about LOGO in categories of chairs and cuffs. You seem very in line with nominalism. What, until you make a claim and they can make a jump to the claim that these are all spiritual beings. Is this about nominalists not recognizing that the various patterns actually act in the world and don't just sit quietly in a filing cabinet? And so the reason why nominalist ruined everything, they didn't ruin everything. They started something they're part of. I mean, it's hard to always tell exactly when something starts. I mean, obviously there was all this bubbling going on at the time. And so some people pointed back to Aquinas, some people pointed back to Augustine, and then some people pointed back to the beginning of Christianity. Right? Depending on, like how hostile you are to Christianity itself, let's say. But the best way to understand it is that what Occam did is in his desire to preserve the, let's say, the holiness of God or the separateness of God. What he did is he made God, he removed all the necessities, anything that you could consider necessary in God. Let me start up at the beginning. So. So in the more traditional way of understanding Christianity, let's say in the Dionysian way of understanding of God, you had a sense in which God is both. There's an apophatic aspect of God that God is beyond all, name is beyond all, all of everything. But that because of that, and through that, he also then fills up the world with his presence, that he keeps the world going. So he's both absolutely transcendent and absolutely imminent at the same time, that both of those need to coexist in order for Christianity to be true. Now, what Occam did, in my estimation, is that he really wanted to preserve the transcendence of God, the idea that God is free, right? God can do anything. But in doing that, he made God completely removed from the world and made the world separate from God. And then it ended up making God arbitrary, though I know that's not what he wanted, but it ended up making God something like arbitrary. Because the idea isn't that God can do whatever he wants. That's not the way in which freedom was understood by the ancients, by people before earlier thinkers. And so by making God completely outside of the world, so completely transcendent, then what he did is this world became a kind of thing that had its own rules and its own causalities that were not related to God and didn't want to. You didn't want them to be related to God because you wanted God to be completely transcendent, incapable of acting on the world, but that the world is separate, let's say, from God. So it meant that the world. Not at the outset, but it slowly started to become more and more arbitrary itself with arbitrary causation and arbitrary mechanisms. And so if you look at the notion of Occam's razor, which is that you should not posit any more beings that are needed to in order to describe a phenomena. And so it's like, what does that. What does that mean? It means that you're moving. Maybe it didn't happen right away, but you're moving towards a world where you don't have to posit the reasons for things or the higher aspects of things in order to describe their mechanical causes. Right. I can describe the makeup of a being without positing higher. Higher purposes for that being. And so it ends up being something like not positing intermediary being, not positing active agents which move down from the higher spheres, up from the transcendent realm, down into the. Down into the world. And those. Those higher beings are something like the fractal pattern that I talk about. They're beings that embed themselves in each other that. That are under patrons. You have patrons that act in the world. And these patrons kind of come all the way down into. Into the world. So there's. Everything is connected. Every. There's an analogy between. Manifestation, between the. The events in the world and then through all these intermediary beings, whether it's where there's just higher participations, right. It's like things participate in higher and higher beings, and that's how things kind of hold together. And then that scales all the way up into something like the infinite. You know, of course, there's a jump at the infinite. There's a jump at some point where it kind of jumps up into something which is infinite. But nonetheless, that normal relationship is the one. I feel like I'm not being super clear. Hopefully. Hopefully this is clear. Yeah. All right. Sorry, guys. If that wasn't clear. All right, let's just keep going. So I'm not an expert on nominalism also, by the way, but I do have a good sense of what it, of what it is and what Occam was, was declaring. So. C. Streetsol says. Hello, Jonathan. Are you familiar enough with the epic of Gilgamesh to elaborate on the story symbolism? If not, can you please explain the predatory aspect of, of heaven? Yeah, I mean, Gilgamesh is a story about a tyrannical system. That's the story. And so heaven can be predatory in the moments when systems become tyrannical. I talk about this. It's like a deformation of heaven. It's, it's, it's when principalities go off script, when they do things on their own and they, they act in pride, you could say. And so that's definitely the story of, of, of Gilgamesh. And so you can imagine that Gilgamesh is a. He's like a Nephilim, basically. He's like a. He's this powerful, powerful being which brings about civilization but then becomes tyrannical in the way that he imposes it. And the way he becomes tyrannical is that he wants all the potential for himself, right? He wants to take everybody's wife. That's, that's, that's the, this image of the tyrannical king who wants to, you know, establish his kingdom in a way that goes in every, into every detail that he wants to penetrate every aspect of his kingdom. You know, that's what Gilgamesh is doing. Think about an image that I talked about of King Saul who tries to pin David to the wall. And so that's what Gilgamesh is trying to do to his kingdom. But that is an impropriate, that's an inappropriate relationship, because that's why it's like, that's what hierarchy is for. It's like when systems become tyrannical, what often happens is that there's a lack of respect of the natural hierarchy. And so the person at the top wants to infiltrate every level of the hierarchy all the way down, whereas a normal way of doing it is that you have intermediaries along the hierarchy, intermediary patterns, intermediary structure. So if Gilgamesh had been a good kingdom, he would have let his aristocracy, you know, rule the different elements that they're ruling, and he would have left, let the husband be the husband to their own wives in a manner that was normal and didn't need the king to come all the way down to the bottom in order to fill everything with himself. So that's what Gilgamesh is doing. Now, the answer to Gilgamesh is, is Enkidu. Because Enkidu is the margin. He's the wild man. He is. He is the power of that which is below, right? He's the dragon, he's a monster, he's a hybrid. He's all these things. He's this uncivilized man that challenges Gilgamesh and reminds him that Gilgamesh cannot fully kind of contain this. And so when Enkidu challenges Gilgamesh and tries to stop him, if you remember the story, of course they're a different version of it, but if you remember the story, Gilgamesh is going into the town to take someone's wife. And then Enkidu steps in front of him and prevents him from going into the door. So he becomes like a guardian, right? He acts as. He's trying also to reinstate the normal hierarchy between the levels. He's like, no, you can't come into this house to take this woman. Stay up there. Don't come all the way down here. And it's interesting because usually we think of the guardians as acting the other way. Like, you know, we're going up. But no, it's like Cerberus who says, it's like, you know, Cerberus is at the gate of, of Hades and he's like, yeah, you may be a king, but you're not going down into Hades because stay on your side, stay in your world. So that's what Enkidu is doing. But then the interesting aspect is that Yankee do ends up completing Gilgamesh, and that when Gilgamesh fights Enkidu, but then ends up having a kind of admiration and compassion for Enkidu, then they become brothers and, and then they complete each other. And, and Gilgamesh is able to see his. You could say, see that which is he is lacking, or see that potential that he doesn't have access to as something which is, which is glorious in a way, because it's, it's, it's not him, but it's also reminding him of, of a truth about how reality works. And so, you know, and so you see the predatory aspect of heaven in a lot of stories. Like, think about when. Think about when Israel asked for a king and Samuel tells Israel. He's like, you want a king? If you have a king, what is the king is going to do? He's going to come from above like a predatory bird, and he's going to take your sons and he's going to take your daughters for himself. He's going to take the best of yours, and he's going to pull it up. And so the predatory bird is the good, is a good vision of, in general, let's say, the predatory aspect of heaven. So, yeah, hopefully that makes sense. All right, so Cormac Jones says. Hi, Jonathan. I'm currently fascinated by the Nika riots in Constantinople in 532, the ones that precipitated Emperor Justinian rebuilding Hagia Sophia. Do you know about them enough offhand to discuss their symbolism? If not, perhaps you can invite Dr. Mario Bagos again to talk about the age of Justinian. It's very apocalyptic. Thank you. Yeah, man. Yeah. Justinian is a fascinating character just because think about everything he accomplished and everything he did, all his amazing successes, but also his tragic failures, thinking that he went through a plague and, you know, he was basically fighting barbarians and stuff. It's pretty impressive. But I think in the case of the Nika riots, I think the thing that stands out is. Is, of course, Theodora's reaction, which is that, you know, I talked a bit about the role of women in Christianity, about how they. They tend to act. You could say something like, they act in private in a manner which. Which opens the door to possibilities which the man didn't think of. And so you see that that's why there's always women converting before men in. In for all the emperors and all the kings, basically, of Europe. It's always like a mother or a sister or. Or a wife that is converting before the king. And so here you have this. This same image where. When. When Justinian wants to. To flee the. So it's interesting that, first of all, it's interesting that the riots happen at the games. It happens at the. At the chariot races. And so, you know, it's like. It's like, here is this. These games, here's this kind of entertainment, and then the factions of the game kind of turn against the emperor and. And then decide to attack the palace. And like I said, it's interesting. Theodora is the one who says Justinian is ready to go. He's ready to leave, to flee the city. And what is it that Theodora says? She says something like, the purple will make an excellent burial shroud. The purple is, of course, the color that only emperors are allowed to wear, which was this kind of dark, kind of reddish blue, kind of purplish color. And she's basically saying, you know, it's like, I'm willing to go all the Way with this, like, I will die here in Constantinople as a queen and not as a. As some fugitive out there. And she basically gives Justinian the courage to, to stay and to face the rioters, which, you know, ended up in a pretty bloody. Of course. But. But, yeah, so that's what I think. It's pretty interesting. Definitely an interesting time. Let's see if there are some questions in the chat here. Quickly. Are there any questions in the chat or is it just. Just Lisa and Brad arguing with people? All right, so let me ask one, one, one question. So, Jenna Dziki ask how does petitionary prayer work? It works just like any petition that you have. It's hard. It's a little hard to understand for people how it works. But you. If you bring it back to the level of your. Of the way you understand it, it works so similar to that. That is, let's say you ask of something, and if that something is in line with the will of that which is above you, then that thing might be granted. It's also, petitionary prayer is also something like an opening up of a possibility which wasn't necessarily visible before, wasn't necessarily the needs of the people. You know, they act as questions which are answered from above. And though the world gets filled that way, it's like, you know, a child asks for something of his parents, and then the parent will give or not that thing to the child, and that giving will, they will make that thing now exist in the world, in the child. And so the type of prayer where you ask is something like. It's something like making it possible, making things possible for God, opening up possibilities and asking God to manifest himself in those possibilities. That's the best way I can explain it, you know. All right, so Revo says, hi, Jonathan. What is the symbolism of Christ's statement that in the world to come, none shall be married or given in marriage? As a romantic person, this has always been a great stumbling block for me. I've heard David C. Ford argue marriages are eternal in some sense in the orthodox understanding. But I. But still I struggle to understand why Christ would say such a thing. I mean, I think that. I think it's simply just because it's supposed to be something like a return to the garden. It's something. So there's a sense in which for Zane, Gregor of Nyssa and some other saints, St. Maximus, they suggest that the separation of the human into male and female was a provision for the fall. That it was. It was like, it's not a fall, but it's like. It's like God knows the fall is coming and so he creates this division. The sense would have been that before that male and female would have existed within Adam as a kind of balance opposite within him, and then that become exteriorized in Adam and Eve. So I think that that's what's being suggested is that when in the next world, right in the, in the fullness of things, then we will have that fullness within us and that the types of relationships that we have will not be, will not be complementary in the sense of opposites, but rather like full beings that engage with each other in a different manner. That's the best way that I can kind of understand that. All right, Kelly Madden says, what is the meaning of the destructions of the Amorites by hail? Is it related to being descendants of giants? As they fled before Israel while they were going down the slope of Beth Horon, the Lord threw down huge stones from heaven on them as far as Azekah and they died. There were more who died because of the hailstones than the Israelites killed with the sword. Interesting. I mean, I don't know if it has necessarily something to do with the fact that they're giants. Maybe, maybe. It definitely has something to do with something like the uncut stone which comes out of the mountain. The idea that like a stone which comes from heaven as something which is, I mean, it's like a natural, let's say something like an. It is like a, something like a natural, something unexpected, something which comes down from above, from down this uncut stone which rolls down the mountain and crushes the, the, the statue in the vision of Daniel. I think that the symbolism has something to do something to do with that. And so I mean, I think that in general you also have to kind of understand that, right, there's a way in which heaven also judges and heaven also stops the can stop the things which are not according to. Are not aligned, you could say. And so that's why there's fire that comes down from heaven. That's why there's. And I think the stones are probably similar, but I'd be interesting. Maybe there is a relationship between that and the giants. All right, so Jay Grubb, what is the symbolism of toys in particular? Those that are miniature or real world things like dolls or toy cars? What funct do they serve? I mean, I think they, they. They just play play function of kind of training for kids. They're a way to train kids to engage with, with the things of their parents. And so discovering the meaning of something is probably the best way to understand it or discovering the purpose and kind of moving into purpose. And so you kind of start on the outside and then you get fake versions of something and then you kind of play around with it and then you get realer versions of it until you actually have a baby. And then when you have a baby, then you've got the thing. And so it's like a training into meaning, you could say. And so you get used to certain things as a child, as a kind of. Yeah, something which is not fully purposeful, it's not completely into its purpose, but it's still flexible and fluid, just like you as a child are a little more flexible and fluid. And then as you move into adulthood, you kind of solidify yourself into, into more concrete purposes. So I think that's, at least that's the way I would understand it. All right, so a popper. What is the symbolism of oil, dark water from deep beneath the earth, being the source of power of our modern machine centered world? What does it mean for the machine to transition to feeding off the power of the sun? Yeah, for sure. The oil, like that oil is super interesting and it's interesting to listen to like the narrative about it and the way that people talk about like what it is and you know, what is it that the theory, you know, the idea that it's, that oil is, is like the residue of ancient organic matter which would have been there, you know, millions and millions of years ago. And so it really is this idea of like this ancient organic matter that has kind of settled down into the world and is like this residue which is there. And, and then you use this residue as fuel for power. Right. So it's almost like, it really is almost like a seed that falls into the ground and then uses the residue as a kind of power in order to give it its upward ascent. So definitely that's, I think it's pretty, it's very symbolic and it's very, it's very symbolic of what, of what the modern world represents. And then the idea of the machine transition to feeding off the power of the sun. I think that for sure there's something about, there's something about the solar panels which are definitely about capturing like it's more, it's not just, it's not just the sun, it's about capturing the sun and about kind of capturing in these, in this power structure. So I think it's a little different. Yeah, so I think it's. All of the things about power have to do with this idea of capturing. And so you can imagine that the symbolism of capturing the sun's power in a. In a battery or capturing it in a, you know, through a panel of some kind is very similar to the idea of capturing electricity as well and kind of holding it in a way that now you can use as a. As a form of power. All right, so Patreon. Moving on to Patreon. All right. Elisa asked, what is the symbolism of tails? Is it significant that human beings don't have tails? It is very significant that human beings don't have tails. And so. And so, yeah, Matthew, man, I wish Matthew could tell you about his analysis of the symbolism of tails. He has a really, really good vision of that. And it has to do with. You could say that human beings are. Are 1 above and are 2 below. It's like a. It's like a pyramid. And that. That is. Is very important. But animals have a residue, you could say, of that structure. And that residue is a tail. And so you can imagine that the tail is like a unity from behind, but it's flexible, you know, it's shifty. So it's like a snake, kind of. Right, and so that's what the tail has to do with. Yeah, so that's what a tail is. All right, Jeremy Firth, what is the symbolism of graffiti? Most of it is tagging. I was here in forbidden places, and it's often coded with obscure fonts or in group references in public places. Can you talk a bit more about the symbol of graffiti? So graffiti is definitely a form of participation. That is very low, let's say, on the scale of participation in the sense that it's a form of participation which is playing on the idea of the fool or the illicit. It has to do with a jester. It has to do with the idea that. So let's say you make a really nice building, and you're like, I've got this right? Look at how powerful we are. Look at how we made this thing, right? This is the structure that's holding up our city, right? These are the structures that are making the system work. And then someone. All they need to do is to come with a can of spray paint and go. What they're doing by saying that is, you can't hold it all together. You can't keep this clean. You can't control everything. And so it's like a challenge to the control of the system. And so the more the system becomes. So graffiti has always existed. You find it in Roman times. You find it all in all kinds of moments. But the fact that graffiti becomes almost like a cultural art form can only happen in a world that is extremely controlling and extremely systematic and extremely clean and. And. And, you know, technical. And so you have these. You know, you have all these structures. And then someone comes and just puts their name on there. It's like they. They just tag it. And it's. Like you said, it's. You don't. You're not even supposed to really read their name. It's almost like an obscure. You know, an obscure kind of chaotic sign that just shows that. That they. That the system is in total. So it's a. And that's why it's also like an affirmation of the individual. You know, when we talk about individualism, you also have to understand that the individualism is the balance of the tyrannical kind of state system. So the idea of, like, the rock star that is like, an individual and has his own style and the artist that has their own style, and you can recognize. You can. You can, you know, you know that it's that person, by the way they look, by the way they dress, by the way they. They draw, by the. By their art. That's just a reaction to the other side, which is this extremely kind of mechanical world in which we live. And so you can understand then that in a system that is tyrannical, someone to challenge that will want to assert their individuality. And so a graffiti artist is something like the punk rocker, right, that doesn't want to follow your rules, and that will have some idiosyncratic way of dressing in order to kind of call attention to themselves in a world of robots and a world of people that are all the same. And so. But they're both the same. They're both two sides of the same coin. And one is. Let's say, one brings about the other. And so the graffiti artists will bring about systems of cleaning, systems of control that are even more radical, that'll force the police to criminalize graffiti because there's so much of it, or they'll try to capture it and tame it, you know, then have walls that are just for graffiti artists, that kind of stuff. And so it's a. It's a super interesting thing, especially like the idea of also political commentary challenging the people in power at the time. You think of Banksy or of. Of Jean Michel Basquiat and how he was also writing these absurdist kind of statements. So I hope that makes sense. All right, so Janet Ziki asks, is there a pattern to who people marry. I've heard arguments against soulmates. You could marry 20 people and be happy. But it seems circumstances, timing, grace at work in each person plays a huge role. Is finding this person a search or is it a gift? Well, I would say that they're probably. I would say that you probably end up being with someone which is kind of complementary to you. And I think that that's usually the type of person you're going to end up being attracted to in the same manner. If you don't, it's going to kind of happen because you can imagine just you have two people. What's going to happen is that the one person, let's say one of the people, has characteristics and then has lacks, and the other person has characteristics and lacks. And so it's normal that if two people are always together and kind of in close proximity that at some point this person's, this person's characteristics are going to try to. The characteristic that this person has, which compensates or opposes this person's lacks, are going to just kind of start to manifest more and more in a good way. In the sense it's like, oh, great, this per. You know, I married someone who can do the things that I'm not good at and that can take care of the things that I'm not good at. But then that can also flip into the negative where it's like, you know, why don't you ever. Blah, blah, blah, blah, blah. I'm the only one who. Blah, blah, blah, blah, blah. Right? So. So I think that that, that's just like a natural thing that's going to happen when you're, when two people come together, especially because a man and a woman are already complementary in their, in their gender, then it's going to kind of happen in the, in the personality. But I mean, the idea that, like the soulmate stuff, I think some, some people, some people are not meant to marry. You know, as an orthodox Christian, I think that that's pretty clear and that in some ways that's probably the best, the best path if you can do it. So. But I, I do think that, for example, I'm sure that people who marry for romantic reasons and people who marry in societies that, that have, let's say, arranged marriages, I would pretty much bet that on the whole there's no difference between which marriages are successful or not, and maybe even that there are less successful with the romantic part because the romantic marriage, which I said like I married that way, you know, most of us marry that way. It can be A little dangerous, because at first what you see shining in that other person and which attracts you to them strongly, really strongly, is that kind of complementary aspect. And then when that complementary flips and now you see the negative aspects of that, of those very qualities that you. We're attracted to, it can be harder to deal with. And if you kind of come into it more in a posed way, where families are involved and everybody's kind of involved. So it's not as. It's not as radical a shift. But I don't know because I never lived in a society that has arranged marriages, so I don't know if that's actually true. But for sure, I'm looking around and seeing people marry romantically and I'm seeing the rate of divorce. And I'm thinking something's wrong, let's say, about the way we're doing it now. So Christian Kleist asks. Good evening, Jonathan. What's the symbolism of Simon of serene. Thank you. From Korea. And so I think I mentioned this before, and I think that it really has to do. It has to do with the sense of the stranger that is kind of participating in the story. So you can imagine you have the Romans that are bringing Christ along. You have also that say that the Pharisees and the Jews that are responsible, that are more powerful. And then you have this stranger which comes from very far away from and is, let's say, helping Christ support the cross. So think of, if you think of the cross as like the pattern of reality, then you have something on the edge, like an atlas figure that comes and helps to support it. So it has to do with how Christianity works, how it also extends out into the strange, how it extends to the lost sheep or to that which is outside. You see that in the story of. Of the Ethiopian eunuch. But. But I think in here it really has to do with the idea of. Of carrying, like the idea of the. Of the mount or when Christ, for example, comes into Jerusalem on a donkey. Right. I think that it's mostly some of that that's going on. I've mentioned, I mentioned before that Origen and many of the church fathers interpret the donkey on which Christ is riding when he comes into Jerusalem as the nations, as the strange nations. And, you know, and rabbis, Jewish interpreters also interpret this prophecy of the Messiah riding on the donkey as being related to that. And so I think that Simon and Cyrene is playing, kind of is playing another version of that in the story of the crucifixion. So Anderson Vad Hi, Jonathan. I'm curious about the difference between the snake around the tree, center heart, and the snake around the garden outside the garden. Ros. There are many snake images in the Bible. Staff of Moses, snake on pole, dragons. How could you know which is related to which symbolism? They're all very much related, to be honest, in the sense that the Ouroboros is like. Is a circle and then you see the serpent eating its own tail. But let's say the best way to understand it is rather to understand that it's never fully the snake eating its own tail, although there's usefulness in that symbolism at that moment when the beginning and the end come together, that there's a kind of chaos, there's an inversion, or there's a confusion in causality in the moment where the end of the beginning appear. Like when the system breaks down and a new thing is on the verge of starting. But another way to understand it is as cycles that go like this, that kind of go up or go or go down, however you want to think of it, depending on the system. So it's like cycles that go like this. And so the serpent wrapped around the tree is similar to the serpent wrapped around the world. It's just at a lower. At a more inside level. So one is more microcosmic and the other is more macrocosmic. And the different snakes that are on the different poles all have pretty much the same symbolism. So, yeah, so that's really, I think, the best way to understand it. All right. Matthew says is there hierarchy of symbolism in Scripture. Some books blossom with symbolism, Genesis, Song of Songs, while other, not so much Paul's epistles. Appreciate all you do. I mean, I think there's for sure a hierarchy of symbolism in Scripture. I think that, you know, that Genesis, like you said, Exodus, the story versions, the story aspects are a very. Are more important, but there's not less symbolism. There's a lot of symbolism in Paul's epistles. Just people, for some reason, they just struggled to. I think that the more and more people now are more conscious of what Paul is actually talking about. I think that it's becoming clear and clear that he's laying it out for you. I mean, St. Paul, when he talks about the man as the head and the woman as the body, and then he talks about these principalities and the thrones and, and how Christ has. Is. Is going up, you know, the principalities and subjugating all these levels of reality, you know, into himself. And all of this stuff that Paul talks about, I mean, My goodness. Like, that's. It's amazing, you know, But I think that. I think it's the best way to understand is that for sure. Let's say the Gospels. Let's say Genesis, Exodus and the Gospels are like the first. Really. They're the. They're the keys that say to the rest. And so you need those in order to be able to then go into more. The. Let's say, the explanations or the details that you find in other. In other books. But yeah, so Express says, in your episodes with Andrew Gould, you mentioned that orthodoxy is related to piracy. I didn't say that. Andrew Gould said that. I was wondering if we could expand more on that as I'm having trouble understanding that, what that could be. I don't know what Andrew means by that. I been thinking about it for a while. I guess I should have him on again. I said I would. And then for some reason, life just kind of got away with us. But I don't know why. Andrew says it's related to pirates. I was really surprised that he was saying that. So it probably has something to do with a kind of embodied aesthetic practice. Maybe like, especially pirates, like the ones that appear in stories. They have a kind of excessive aesthetic that is. That kind of overflows and. I don't know if that's what he means. I don't know. I don't know. Andrew, if you ever see this. I mean, maybe we should talk again on. On the. On. On. On the channel. All right, so let's see. So in the chat I'm seeing Brandon Burns says, Jonathan, are you a tool fan? If so, any thoughts? The symbols of the album Pure Inoculum. I'm not a tool fan. A lot of people have kind of pointed me to the tool and said they have really complex music and. And super. I just struggle. It's too. It's just too heavy for me. It's hard to listen to. I really like melody, and so I struggle with music that isn't. That doesn't have good melody melodies. So a popper theologian asks, is anything meaningless? And so I would say, let me answer it this way. So, no, because meaninglessness is the place where things cease being things. So things are always meaningful. But there is a place at the edge of things where things break down. And that's where you can experience levels of meaninglessness. But obviously, ultimate meaninglessness or just pure chaos is not a thing. It's. It's under things. It's. It's a field. Right? It's a field of possibility. Or a field of chaos. So hopefully that makes sense. So, Nathan Hart says. Hi, Jonathan, what do you make of recent attempts to divorce authors from the myths they created? Of course, there's been a concerted attempt to disassociate Rowling from Harry Potter because of her statements. But I've also noticed an increased push to divorce Tolkien, particularly as Catholic Catholicism and traditionalism from Lord of the Rings possibly drummed up by the new Amazon series. Yeah, thank you. If you're feeling nice, perhaps you can comment on the symbolism of the spamming of rushing translation of JR's quota in the trailer. Yeah, I saw that. It's like. It's just like. Just the same comment about how evil cannot create anything new, but can only distort or whatever that comment is. I mean, I think it's not so much to dissociate the authors, but I think it's mostly to capture. There's a desire to capture all these intellectual properties by the new religion. And that's definitely what seems to be happening with Toki. And I'm really disappointed at what I kind of like. For sure, I had a similar reaction to a lot of people, like, what is going on in this. In this trailer? Like, what is. What are they trying to prove? And I'm kind of sad because the lady who did the costumes, which look awesome and the rings, who designed the rings and designed the costumes, is actually the. Her name is Heather Pollington, and she is the one who did all my new branding. I mean, she's an amazing artist. She's just astounding. And so. And so I was gonna. I'm probably gonna have her on the channel to talk about some of her Lord of the Rings designs in. In the next few months. But. But like you said, it's just weird to watch this, like, desire to capture, you know, and it has to do with my idea of parasitic storytelling that I mentioned in my. In one of my videos. You know that that's what's going on. It's going on everywhere. Right. A desire to kind of capture these stories and. And control them for the new religion. So. All right, Alexander, I was wondering if you could speak on the Catholic symbolism of the pelican and its younglings. Yes. Where that symbol originated and how it found significance on altars, tabernacles all over the world. There's particularly striking image as we enter the Lenten season. What do you. Don't you think? So the image that Alexander is referring to is an image of a. A. Of a pelican that is Feeding its children with its own blood. And so this was like, kind of like a legend that existed or. Because when you look at a pelican, you see the pelican. Pelicans kind of rub their. Their beaks and their chest. And so I think, like, it. It brought about a kind of vision of the pelican that the pelican was actually, let's say, piercing itself and then feeding itself, feeding its young ones with its own blood. And so it obviously became an image of self sacrifice, an image of communion. And that's why it was so prominent in. In early churches, you know. And it's still useful today, even though, you know, it's not technically. At least to the way we understand the word, it's not technically accurate anymore. I think. I think it's still useful because it can help you. It's still an image of self sacrifice if you kind of understand the story that goes around it. The idea of giving yourself to. To. To others. Someone asks, I feel like. Used to listen to punk music back in your youth? Any nostalgic favorites and so. Sure, you know, I. I started listening to punk when I was like 13, I guess. And then it was mostly like anybody that grew up in the 90s was just the. The bands that were. When I was. When you're 13 and you're not super. I mean, you're still really young. Like, I like the Violet Femmes and. And the Dead Milkman because it was so funny and you're 13 and it's so absurd. And so those were the bands that I like when I was super young. And then later I really like the Pixies a lot. Think that was the first concert I ever went to see where the Pixies and then moved out of punk and more into kind of just the kind of alternative stuff that became popular later in like the. In the. Let's say in the mid-90s. And so. So where we are really into the Red Hot Chili Peppers, you know, back in the like late 80s when they were just crazy and super vulgar. So anyways, I don't necessarily recommend that, although I do think that the song Californication, for example, that album, it's almost like it's like a liturgy for the end of the world. I mean, it's. If you want to understand kind of end of the world symbolism, they just get it so right. And I think. And they're. They're. They're morons, those guys. I mean, they're not very smart, but I think they're just. They just had this intuition about what California is. And when I talk about California is the end of the world, it's because it is. And the Red Hot Chili Peppers get it right. They really get the symbolism right about, about California and what it represents and also kind of what they are as these kind of chaotic, nihilistic, crazy jester figures, you know, that, that were embodying that at the time. So. Yeah. All right, so Alexander, another Alexander. Is there any symbolic connection between St. Christopher and Christopher Columbus? Both sought to serve the most powerful principality. Both cross large bodies of water that resulted in an epoch making transformation more personally for St Christopher International for Columbus. And the ship that carried Columbus was named after Mary, Santa Maria. What do you think? Yeah, definitely. There's definitely. Christopher Columbus is definitely a symbolism happens moment, you know, where you could say despite himself, right? So despite himself he end up, let's say, connecting the west with Christianity, you know, and, and so it's interesting, the idea of carrying the dove, you know, across the ocean into, into the, into the Americas and so. But it's also like the beginning of a new world, right? It's the effect of change, the amount of change that Christopher Columbus brought about or the Colombian exchange is so dramatic. I mean, people don't realize how dramatic the transformation that happened at that time is. You know, so much of the food you eat, for example, didn't exist before the Colombian exchange. Like chocolate, like tomatoes. You know, there's so many examples of food that we just totally take for granted. Tobacco, all these things. There's so much that kind of, that appeared at the time. It was a really, it was like a bodily transformation that happened in the world with that connection. And so, so I definitely think that there is a connection between the two. All right, so Kevin Patterson, in our modern materialist culture, raw power, wealth and force attract our worship, just like in ancient pagan cultures where their gods promise them such power, making materialist worship the default for humans. Am I right then in thinking that Christianity is actually quite radical and unique for positing an afterlife directly connected to abstaining from material pleasures? Does Christianity posit an afterlife that is based on abstaining from material pleasures? I don't think so. So there are definitely. So let's kind of break that down. Let's, let's break that down. So there are definitely cultures which have an ascetic quality to them besides Christianity and so Buddhism, some ethics of, of Hinduism. And what is the other one, I forget, the one where they don't even kill insects. Why is my brain sometimes Just seizes up on me. And so there are others. But I think that Christianity. It's important to understand that Christianity doesn't. The afterlife isn't connected to abstaining from material pleasures, but it's rather of not being a slave to material pleasures. Because the problem is in the material pleasures. The problem is that we are so easily duped and seduced by them and that we tend to act towards them. And so. And so asceticism is there to kind of remove our slavery from these material pleasures and be able to focus higher. But abstaining from material pleasures is definitely not going to get you into any particular state on its own. It's just a way to be able to redirect your worship and your attention to the property. Reorganize things in their proper order, you could say. And so. So, yeah, so I would say. I would say that it's probably better to kind of understand it that way than to understand it as a. Yeah. And so Garrett Widner says. Hi, John. Forgive me for being so dim on this. I'm still trying to understand the pattern of the ascent ascending a mountain, as with Moses at Sinai. I can see the pattern itself, but I'm still cloudy on what it means or its applicability. I noticed recently when Jesus prays and gethsemane in Matthew 26:36, first he leaves all the disciples with Peter, James, and John. Then he leaves even then, then comes back to them and finds them sleeping. Yeah. How does this apply to human life? All I can see is that those who struggle for virtue and succeed find that most other people fall away. That doesn't seem deep or interesting enough for such a central pattern. You can understand it this way. There's an exchange that happens between that which is below and that which is above. And so when you go up the mountain, you kind of have to be able to abstract the multiplicity. Right. If you want to. If you want to. I'm trying to apply it to everyday life for you. Okay. So this is. Obviously has a deeper kind of. It does have a personal meaning and a spiritual meaning the way that it's described. But you can understand it that. Let's say you've got a bunch of things and you want to figure out how they connect together. So you have to be able to get your eyes away from the particulars. You kind of have to remove your eyes from the particulars. Let's say you're in a team and everybody's doing all. A bunch of crazy stuff, and everybody's doing all These things. And you're like, what is happening? Why? We need to figure out what our team is doing, what our purpose is, and how that organizes everything else. And so you have to stop focusing on all the details, because you get lost in the details. You get lost in all the multiplicity. So you kind of have to bring that down. And there's a hierarchy of that, right? So there's, like, all the detailed details, and then there's maybe higher aspects of what you're doing in the team. But you also have to kind of remove that in order to find, let's say, the one thing, the one reason why everybody's doing what they're doing, okay? And so you can understand that when people forget that purpose, they do something like fall asleep or they worship idols, right? So think about a team that's building something, and then people get caught up in the little thing they're doing. Then they start fighting with the other members of the team, because it's like, you're trying to stop us from doing the thing we're doing. And then it's like, no, it's your fault. And everybody's fighting because everybody's so focused on their little task, they don't see the big picture, right? And so that's idolatry. Or it's. There's also, like, a sense of they just falling asleep. Like, why am I doing this? Why am I doing this thing? It's pointless. I'm just gonna sit in my office and I'm gonna go on Facebook, because who cares? I don't even know what the purpose of what I'm doing is. And so all these people in the team, they can just become kind of just drop and stop even really acting together because they don't understand what they're doing. And so the person, the leader, goes up, finds the purpose of the meaning, finds the purpose of what they're doing. And then that person comes back down the mountain and says, wake up. Remember the purpose. Remember the attention. So Christ says, I'm going up to pray. I'm going up to the highest thing. I'm going up to worship God. And I want you to participate in this. I want you to remember the highest thing. Don't forget it. And so they forget, and they fall asleep. They forget, and they worship idols like in the story of Moses. So Christ has to come back down and has to wake them up. And that implies this idea of saying to wake up. Or it also implies a judgment. You could say, when Moses comes back down and he finds the people worshiping the golden calf. There is some judgment that's going to happen, that is that some people are going to get cut off and some activities are going to get cut off. So you can see the same with the team. It's like you have this team doing a bunch of stuff. You don't know what's going on. And so the leader goes up, or someone goes up, finds the purpose of what this team is for, then comes back down, first of all, says, wake up. This is what we're doing. And then looks at what everybody's doing and then decides, well, you know what? This is useless out. This is not pointing to the higher thing. This needs to go. This person doesn't have the skills needed to be part of this team. They need to go. And then maybe you're actually going to gather in more things that are more aligned with what you're. With what you're doing. So that's how it applies to everyday life, because it's basically the pattern of attention itself and the pattern of what we do in the world. So, yeah, hope that makes sense. So Andrew Blank says, I was reading an article on an orthodox blog about suffering and death. The article refers to death as intrinsically meaningless and how even the cross reveals this. As someone who's observed the death of my father and now stepfather, cliches like there's a purpose, reason for it seem misapplied. How do you think about suffering, death and its meaning or inherent lack of. And how does it differ from a Protestant view? So I kind of understand what this person is saying when they're saying that death is meaningless in the sense that, you know, when you ask someone, ask me if something is meaningless, and I said, what's meaningless is when it's the edge of a thing. The end, the place where the thing breaks down is. That's what meaningless is. And so there's a sense in which death is related to that, because it is. The place where your body breaks down is the place where the spirit and the body get separated, where things fall apart. And so it is meaninglessness manifesting itself in the world. Now, it's not the idea that you necessarily have to find the purpose or the reason for it, but there's. There is something about death which can be. Can be transformed into glory, that the breakdown which happens can actually become a kind of. Of. Of glory. I don't know how else to say it. And that's what you see on the cross, and that's what you see in a lot of the imagery related to the Cross, where meaninglessness becomes something like that which is outside of meaning, that which transcends meaning, or the place where meaning breaks down. There's a place where meaning breaks down below, but there's also a place where meaning kind of breaks down above. And that's the crown, or that's the crown of thorns. That's that this kind of explosion into something higher. And so I think that that's ultimately what death can become now. It's not always that and, but I think that that's what martyrdom is for sure. And I think that there's a sense in which, if you look at the idea of relics, that seems to have something to do with that, where it's like the death and then the cutting up of an actual human body becomes something like the crown, the jewel of the central holy place of a church or so that's how I see it, you know, but it's hard to talk about this stuff, talking about death, man. All right, so Roger Sterling asks. Hi, Jonathan. My question is regarding the cringe phenomena. Seems triggered by clumsy attempts at things like dancing, singing, telling jokes, or sexual. Or sexual seduction. Why is that? Activities which are potentially transcendent when done well are so humiliating when done poorly. I mean, it has to do with sin. Like sin in the technical sense, not necessarily in the moral sense, but it has to do with something like the reaction of watching somebody miss the mark, you know, like it's painful. It's like it's humanly painful to watch someone miss. To miss the mark and try really hard but miss it, or sometimes think they hit it but totally missed it, you know, and so it's like it's embarrassing to see someone sin. It's like you're, like you're seeing their nakedness, you know, in the biblical sense, where you. They're exposed, like their weakness, their. The place where heaven and earth doesn't match is like exposed to you and you're. And it's like it's painful to watch. Yeah. Yes. Norman Gode says Jainism. Yes, that's what I was referring to before in terms of the, the, let's say a religion that is extremely about self denial and, and fasting, like extreme fasting and stuff, and refusing earthly pleasures and, you know, not killing anything. So. All right, Manuel Monte. Can idolatry be further understood as a sort of abandonment of the logos and movement towards non being? And if this is the case, when everything that we do that isn't directed towards God be considered idolatrous, even the most trivial things, the Image of The ghost in C.S. lewis, the great Divorce keeps playing over in my head when I think about this. So it's. It's more. It's just about hierarchy. It really is just about hierarchy. That is all things are good in their place. They become idolatrous when they're not in their right place, when they are in the wrong. When you place them in the wrong position in the hierarchy, when you give them more attention that they should. That they should have. That's when they become idolatrous. So. So, yeah, so things can be indirectly directed towards God when they are in their proper place, you know, and when they're also done with, in a spirit of gratitude, you could say towards God. And so I think that's the best way to understand that. So would God exist? So, David Cookson in the chat, as would God exist without there being conscious beings? And I would say that that's just a bad question. I don't know what to tell you. That's not how it is. You know, God exists and conscious beings exist, and we can see God through. Through consciousness. And so, so it's a. It's. It's one of those questions which is not. I don't think you can actually ask because I don't even know what it means. Like, I don't know what that question means. It's. Yeah. So I hope that makes sense. All right. Annie Crawford asked. Your recent podcast on King David made me think of Hamlet, who also finds himself to be the true, true heir in trouble with a false king. Hamid also plays the jester, the fool, the trickster, as he tries to deal with the situation. Yeah, yeah, definitely. I never felt satisfied with the typical explications of Hamlet's character. Is he a failed King David trying to navigate the same space but unable to hold the tension long enough to succeed? Yeah, that's a good insight you've got there. Any insights on the symbolism of Hamlet are all welcome. And so there's definitely something of what you're saying going on in Hamlet. For sure. It's more like in Hamlet, there's something that's even more corrupt about the situation, which is what makes Hamlet such a tragic figure, which is that not only is the king, you know, the illegitimate, not only did the king kill his father, you know, the king also is sleeping with his mother, and they colluded, you know, to kill his father. And so it's. He's really in a bad situation if you think about, in terms of like, normal hierarchy. And so. Right. So he's. He's the one who's supposed to become king. But there's a manner in which he's stuck because he's going to succeed. Something which is illegitimate. And, and we also have to remember that, that Hamlet's father appears to him. And that is also what leads Hamlet in, in terms of trying to bring about some kind of. Of justice. But the story of Hamlet has to do with like the self devouring that happens when causality breaks apart. You know, where it's like his uncle, I think it's his uncle, right? His uncle is now his father, right? And his mother is his aunt. And then, you know, the, the man who's his father killed his real father. And so it's as if causality is breaking down. And then that ends with a kind of bloodbath where everybody dies, basically, where it's like, it just collapses. The, the system collapses because in trying to restore it, Hamlet ends up, you know, dying himself ends up. And the whole confusion of the swords and the poison and all this stuff, it's like, it just, it just, it just shows you how all of this is bringing about like such a confusion and causality that in the end everybody just. It's over, right? It just ends. The line you could say, devolves into total chaos. All right, so Nate Barker says, hey, Jonathan, what do you say to someone who is struggling with their faith due to the violence in the Old Testament that God seemingly commands? That is Canaanite conquest. And those who say God commands genocide, et cetera. And so I understand it's definitely a tough one. But I think you really, really do have to understand that the church fathers really took that symbolism and then tried to apply it to yourself. You know, all of a sudden then the, the, let's say the conquest that you see in the Psalms and just deliver me from my enemies and. And conquer my enemies, ends up being. Now the internal battle with passions and thoughts. And even the most horrible statement, that statement of we'll dash their children on the rocks, which is just a horrible statement. There's a sense in which the church fathers talk about the children of your enemies. If you read St. Gregory of NYSE, he does the work for us in bringing all that together. The children of your enemies is something like these thoughts, like all the little thoughts that come in your mind and that come from the outside and try to creep up on you. And so you have to stop them before they grow into adults or else they're going to take over. And so the analogy is perfect. The analogy is perfect. In the sense that if you were at war with another nation and then you're not careful with how you manage their children, then they're going to grow up and then they're going to come and attack you. Right. I mean, just very simple tribal symbolism. And so there's something obviously, which is kind of horrendous about that, but there's something which is also manifest, some aspect of reality. And so the way the church fathers kind of bring that into the person and then apply it at that level, which is the proper level to apply it, then I think it helps to reconcile that. But I understand, because it's. Yeah. All right, so Mid Ohamed Ali says, bonsoir, Jonathan. What is the symbolism of suicide? And so, I mean, the symbolism of suicide is. Is the symbolism of. It's the symbolism of. Of circular causality. You know, it has to do with the snake eating its tail. It's like you take a sword and you turn it back on you and then you stick it in yourself. That's what suicide is. It's just, it's. Yeah, it's a breakdown of normal causality. And so that's why it's so dark, at least in traditional Christianity. That's why suicide is something out of. Which is difficult to get out of the consequences of. Right. Because you're basically. You're ending yourself in this weird breakdown of causality. And so it's. So it's not a great. It's not the best thing for. It's not the best thing for moving over. Like crossing over, you could say, all right, so GR says, how do you respond to four backs accusation of Christianity worshiping the representation over the represented, the copy over the original? I was taken aback upon learning this as I agree on the problem of the map taking over the territory. But I see it as scientism, materialism and Protestantism being the main offenders. While Christ's incarnation being the solution. Is it a case of the accuser accusing others of its own misdeeds? Thank you. And so like worshiping the representation in the sense of Christ over God, Is that what I'm getting here? Because it's obvious in Christianity that we worship God through Christ and not. We don't worship Christ on his own. We worship Christ as he is the divine Logos and is the one that manifests God to us. And so it really is more of kind of solving the problem of representation and represented and creating a theory about reality in which the representation can participate in the represented, that is that the world lays itself out organically. And naturally, out of the one into the many. And that this is not a scandal. It's not something which is. Which cannot be resolved. That it can be resolved, but that it's ultimately all they turn towards the Father, you could say. And I think that, at least in orthodox Christianity, that's pretty clear. So. Yeah. So, Noe Palacios asked, what is the symbolism of the illness of Asad Jo Horam and Uzziah and Hezekiah, Kings of Judah, 2 Chronicles. It says that Asa got sick in his feet, Jehoram got sick in his bowels, Uzziah got leprosy on his forehead, and Hezekiah got sick to death. I don't know. I never thought about this at all. I mean, it's interesting, at least the way you say it. I'd have to reread it, but it's interesting because there's definitely like a. There's definitely like a moving up, where it's like, if you're just sick in your feet, it's not. Not that dangerous. Whereas if you're sick in your bowels, you know, it's more. It's higher up, and it's more dangerous. If you get leprosy on your forehead, then it affects your identity. You know, it affects the way people see you and the way you interact with others. Like, the others can be hidden, and you can have your. Your feet sick or your bowels sick, and nobody would know. It's like a hidden thing. But then when it's on your forehead, then everybody sees. And then obviously, Hezekiah got sick to his old being or his old being collapsed before the sickness, and so he died. And so there's, like, higher. There's a weird hierarchy of death there that's kind of interesting to think about. All right. Drew McMahon asks. Hi, Jonathan. Can you explain the symbolism of Moses leading the Israelites for 40 years, but at the very end himself not making it into the promised land? Thank you. Ultimately, I really do think that it has something to do with the transfer from one world to the other. You can really see that. It seems like for a world to end and then another world to begin, there has to be some aspect of the world before which goes up into heaven. And that is what kind of brings about the end of the world, you could say. But it also is what makes it possible for the next world to start. I mentioned this before. So it's related to the idea of Enoch going up before the Flood and then Moses going up before the entry into Israel. And then you also have Elijah Going up, you know, at the end of the. The. Of the Northern kingdom, and then Christ going up before the Holy spirit comes down, etc. Etc. And so that seems to be. And it also seems to be. I think I mentioned this before, which is that I always kind of really. I was never a big fan of the idea of the. Of the Rapture, you know, like, kind of the way that evangelicals talk about the Rapture and then mature, kind of mature, really caught me and said, you know, the Rapture is just another version of that symbolism that's there from the beginning. It's like before the end of the world, some aspect of the world has to go up. And so I don't know exactly what that means in terms of practice, but, yeah, it's just interesting to see that it's the. Basically the same pattern as what you see. And it's interesting because Moses in Scripture, it says it basically suggests that he dies, but then later in the gut. In. In the New Testament, it says that his body was taken up by St. Michael. So there's something about bodily ascension that. That. That is part of this transfer. You know, that's why you see Elijah go up and. And Enoch. So interesting stuff. And Christ go up bodily. All right. Sean Desmond says in order to construct the Tar Babel, the people use baked brick and slime instead of stone and mortar. Genesis 11, 3. This can be juxtaposed with uncut stones used to build the altar according to God's command. What's up with that? Is it slime or is it. Is it pitch? I think it's pitch. That's my understanding, is that it's. That it's something. It's pitch. So it's like the darks. The dark sticky stuff. We talked about oil. This like, dark sticky stuff, which is kind of at the bottom of the world. And so you have the stones, then in between the stones, you have this stuff that represents the bottom of reality, that connects the stones together, the sticky pitch. And so I think that that's mostly what's important. And then the big brick instead of stones has to do with civilization itself, right? The baked earth. And this idea of using technology to create the structure of your thing and then adding the gooey. The gooey pitch, like this residue stuff, this dark, sticky stuff on this. On the side. That's my. That's my kind of understanding with that, of that. So Scotty Torp asked, did Jesus laugh? And I say that laughing. How is laugh related to transgression? And so there's a tradition. St. John Chrysostom says Jesus didn't laugh. And I think that the reason why he says that is that it has something to do with the idea that laughing is a form of transgression. Not necessarily moral, but transgression in the sense that it is loss of control of yourself. That's what laughing is. And most of the time, laughing is something that happens to you. You see something that you didn't expect, and it's a reaction to what you see. You read something and it's a reaction to what you. You read. And so I think that that's. That's the sense and that Christ is not. Doesn't have unwield reaction, that his engagement at the world is always full and always complete, you could say. And so that, I think, is why there's that tradition. But I think we have to be careful not to take it too extreme, because I do think that laughter does have a kind of a function, you could say, in the world. And, and that it has to do with something like. Yeah, it has to do with that Sabbath. It has to do with something with the end, like the, the moment when. When, you know. And it also has to do with a kind of a reception of what's happening in a way that. And it also. There's a power in laughter, I think, especially at the end of, you know, laughing at something. If you look at the way laughter is used in scripture, for example, when Elijah laughs at the illegitimate, illegitimate prophets, there's a power in that which is really. And so you could see that Christ, maybe you could say Christ didn't laugh, but Christ for sure, mocked like you can see Christ mocking the. Not the Philistines, the Pharisees. All right, I'm getting tired, guys, especially because my back, I told you, my back went out a few days ago, and it's still kind of. Still kind of going. All right, so Norm Groene says last month you spoke about the idea of the remnant after the kingdom split, acting as that spark of renewal when the time was right. Are we in an age of biblical exile in the modern world? And as Christians, are we remnants of the kingdom? If so, what is our role? And how best do we navigate our way through the landscape of exile, both spiritually and physically in the world? I would say watch my video on King David in terms of, you know, how to avoid the Pharaoh, right? You know, what is it? Moses gets put in a basket with pitch and then on the water, and then, you know, going on the water is the way to avoid the Pharaoh. It's interesting because in the story of Moses, you see that there's like a voluntary desire to put Moses in the water in order to avoid the tyranny of the Pharaoh. Whereas in the flood story, it's almost like a natural procession of the story. But in Moses, it's like, you know, you. You're in this basket with pitch, and then you are floating on the water. And so. So I think that that's. That's something to think about. You know, I watch our video on David and see how we can avoid the tyranny in a moment of. In a moment where it's very present and very strong. So I would say, yes, we are, in a way, in a world of exile. More and more, it's going to be more and more true as we go, and it's going to get worse, that's for sure. So, yeah, we have to start thinking like a remnant. So, EB what's the deal with all the kings fighting in Genesis 14, right before Melchizedek appears? So what's the deal with all the kings fighting? I mean, you could understand it as a moment when everything is. All these things are falling apart, and then Melchizedek appears. And so Melchizedek is very important to understand. Melchizedek is a very strange figure because Melchizedek is both a king and a priest, which is not something which is normal. Usually you don't have figures that are both a king and a priest at the same time. And so Melchizedek seems to represent something which is kind of not in the world or is really kind of coming out from above, and then kind of participates in re. Establishing a new order by offering the sacrifice of bread and wine. And so he's a very fascinating figure. There aren't that many figures that are both priests and kings at the time. Same, same time. You see that, of course, Christ is obviously, that is both a priest and a king at the same time. And that's why it says that, you know, like in the Book of Hebrews, that Melchizedek is a. Is like. Is a king that has no generation that is, you know, that doesn't have a generation. He's the first. He's kind of like he represents this first. So it's hard to square that. You see that in different books, like Book of Jubilees, they try to square it like Melchizedek is one of Noah's sons that come from before the flood. Or is it character from before the flood in order to kind of say, that he transcends the whole thing, like the whole system. He precedes everything. And Melchizedek appearing and then kind of blessing Abraham is something like, let's say the. The highest point in the world is. Is giving its blessing to Abraham. It's almost like Christ is blessing Abraham in that story in a certain manner. Not directly, but let's say story ways, in story. Story form. So something which is above the king and the priest is coming down to transfer authority to Abraham. All right, so wavering, radiant. Can you explain what it means for art or anything for that matter, to be liturgical strictly? You could say that there's liturgical art which is something which is dedicated, let's say an object of life which is dedicated to God and therefore finds its highest purpose in being dedicated to God and serving its function, but within the worship of the highest. And so, you know, like whatever object is used in the. In the liturgy, whatever music, whatever building, all of this is kind of like the summit of reality where the. The art is dedicated to God and manifests its highest aspect. So at a lower level, you could understand it liturgical in the sense of just participative. So I've talked about this several times. The difference between art, which is participative, and art which is just, let's say, something like entertainment or something that. Just like passive entertainment. All right, so Joe Kelly Good says, has anyone done an audiobook version of Matthew's book? I'd love to be able to listen to it. No, I don't think that's going to happen just because Matthew's book is so much. Most of what you get from Matthew's book is from the diagrams, not from the text. The text are important, but, like, the real insights come from the diagram. So I don't see how he would. It would be weird to have it as an audiobook. All right, Dan D.B. says, are religious rituals and organized religion in general, including Christianity, another kind of garment of skin? And the answer is, yeah, to a certain extent. But it's also a garment of skin which can be kind of transformed into a garment of glory. But it definitely is a garment of skin. It's interesting. Like you. If you read Genesis, you'll see that there's the fall, and then people kind of leave the garden and move away from the garden. Then the descendants of Cain start to create things and technology and stuff. And then it says from that time is when people started to call upon the name of the Lord. And you think, like, wow, interesting. But didn't you realize that. Let's say the religious forms and the rituals and the need to call upon the name of the Lord means that you also have a certain distance from that. And so I think that's. And so a lot of the symbolism of the, of religious rituals have to do with that. It's like a memory. We remember that which is far away. And so we, we engage in these patterns in order to embody and remember that which transcends it. But then ultimately there's a sense in which we talked about this idea of like representing the represent, you know, let's say, worshiping the representation or the represented earlier when talking about, I think it was Feuerbach, there's a sense in which in Christianity, it kind of all comes together. And so that's why communion is something like perfect memory. Community is something like the place of true memory, where memory becomes participates fully in the thing that it remembers. And so that's what Christianity does to that. And so that's really when something like the garments of skin are transformed into, back into their earlier function, which are the garments of glory. So Chandler Turner says an often repeated phrase these days is believe science. Is this a symbolism happens moment where individuals who surely believe in the objective nature of science are reifying that trust is fundamental to empiricism. No, what they're doing is they're hiding their story behind science is what they're doing. Because when they're saying believe science, what they really mean is do what I'm saying. And what I'm saying is believing science, Right? So science is not prescriptive in any way. It doesn't prescribe anything. And so when people say something like follow the science or believe science, it's like what they're saying is. So you saw it. And during COVID it was the most egregious. It was so egregious. Everybody who was saying their thing, and I'm still hearing it now because I was forced, because of all the craziness in Canada to listen to parliamentary debates, which. Which I never do because it's so unbearable. But you're forced to. And you still. People say things like two people sitting across the aisle saying, will you follow the science and do what I'm saying? Right. I'm the one who's following the science. My political position is the one that's following the science. And it's just so embarrassing because you. Because you can't follow science. And. Yeah, all right, Stephen Bishop. I've been told that soldier saints should be depicted in civilian clothes when painted on the Iconostasis rather than in their armor and weapons. Is this because the violent nature of the soldier is somewhat monstrous and marginal, Therefore it cannot be too close to the center at the sanctuary, as if soldier saints was removing a garment of skin as he gets close to God. I guess. I mean, I don't know why I've never seen that. Especially because St. Michael is often represented in an armor, often represented wearing an armor on the icon of sauces. So I don't know, it's just weird. I've never seen that tradition. But that's probably what people would say. That's probably the reason why they would say that. But I think it's weird because there are plenty of images of St. Michael, especially on iconistas wearing armors. All right. Nicola Alexis asks, in some of the Psalms we hear prayers for God to punish the enemies of the faithful in very descriptive ways. How would you read this today? I feel very easy reading these verses, especially when I imagine my enemies of today that are political elite and what I would want them to go through as a consequence of their action. I don't want to be resentful, but these verses don't help. They rather magnify my problem. And so I've mentioned this before, which is that for sure, the Church Fathers, the way they interpret the Psalms is that it's an inner battle. And so the enemies, my enemies are not other people, but they are my thoughts, my passions, they are the desires that kind of creep up on me, you know, that's what my enemies are when you read the Psalms. And so it's taking, let's say, the world of combat and of fighting and then kind of bringing it in, bringing it inside, you know. And so that's usually, that's usually what the, the Psalms are talking about. But I, I think that it's not completely illegitimate. In a moment, let's say where a country is being attacked from the outside by barbarians, like let's say, you know, the Mongols are at the gates of the city. I do think that it's appropriate to re. Engage these psalms in a more. In a more kind of city at their city level or at the, at the higher level. I think that that's okay. I think we have to be careful with our own personal enemies because let's say the enemy of a city and people attacking a city is different from my personal enemy in the sense of someone that annoys me or someone that has done me wrong. But I think it is definitely possible to ask God to deliver us from our enemies when we are being attacked by foreign armies that are coming in to attack you. So I think that's totally fine. All right. And so I'll do just maybe a few in the chat here. So a pauper theologian asks, what is the roleplace of chance in a meaningful world? And so, yeah, the world place of chance is. That is the place where causality breaks down. It's the place where meaning kind of falls apart at the end. At the end of the day. That's why. That's why you play games of chance at the end of the day. Maitre talks about this quite well in his book about, you know, this. The imagery of the remainder and the imagery of the Sabbath and the imagery of the end, where that's where things like chance come about and, you know, where causality breaks down. That's what chance is. It's like. It's kind of like there's no. There's no clear causality, which is explaining to me why this is happening. It seems random, seems to not participate in meaning. And that's definitely part of the big, like, the big system. So Chris Buchalt says Jordan calls it slime in the biblical series. Oh, interesting. So, I don't know. I'm pretty sure it's pitch. I don't know. I may be wrong, but I think that it's the same word that's used to describe what they put in the ark. Am I wrong? And what's put in the. The basket of Moses. So I think I'm right, but I might be wrong. I have to check it out. Check it. I'll have to check on it when I'm done with this. And, and, and see if I'm wrong or right. So, so KH asks, hello, Jonathan. What is the symbolism of being below an oak tree? It often seems to mark the limit of and mediate what is pagan? Is there a lesson in there for us in the West? Thank you for your time. I'm not sure what you mean. Below an oak tree. I'm not sure what you mean. Never thought about that. All right, guys, I think we're done. So I was able to keep it under two hours this time. And so, so thanks, everybody for your attention and as usual, thanks for your support. Really appreciate it. I'm finally ramping back up the website. You know, I got really discouraged because everything kind of fell apart in terms of redesigning the website. And I presented to you guys with the. For those that are supporting me on Patreon, I put up a video that shows the new branding which is going. And now the reprogramming of the website is now officially started. And so I'm pretty happy. I wanted to also wait until some point. I was like, okay, I need to wait until the end of God's Dog before I do the website. But now we're going in full force and it seems like pretty sure anyways, it seems pretty sure that I'm going to write a book in this year and that it might actually like. It might be a popular fiction book. And so I'm kind of talking with a bunch of people about that and there's some exciting things on the horizon if it can. If it can come together. So. So thanks everybody for your attention. Thanks for showing up and. And I will see you. See you next month. Bye bye everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to. To get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
