{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":0.24,"end":6.56,"speaker":"Jonathan Pageau","text":"Let's say in the ways that the people watching this will totally understand. You can't completely just act as if God exists."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":6.64,"end":12.28,"speaker":"Michael Legaspi","text":"Yes, that's exactly, exactly as if is going to, like, you know, it's going to."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":12.28,"end":40.56,"speaker":"Jonathan Pageau","text":"It's going to. Yeah, it's going to act so. But that's why, like I tell people that ultimately the Psalms are the good example of this. That ultimately worship is the key to this, because worship places you in a mode where you are interacting, where you're acknowledging, where you're placing yourself in relationship to God. And then. And then that is the training, right? That's the training ground which helps you exist, you know, not just make it into a mental trick, but make it into something that you embody, that you participate in."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":40.88,"end":46.16,"speaker":"Michael Legaspi","text":"No, I think that's absolutely important. I think that's. That is the kind of real thing ultimately is worship. Right. And."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":57.2,"end":105.26,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everyone. I am very pleased to be here with Michael Legaspi, who is a professor of the old testament at St. Vladimir Seminary. As you know, many of you probably know, St. Vladimir Seminary is one of the main OCA seminaries in America. It has a very long and profound history all the theological developments of the Orthodox Church in the West. This transfer to local languages. St. Vladimir has been very much involved. And so I'm really happy to be able to collaborate with them and with Michael. Michael, thanks for talking to me."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":105.5,"end":118.65,"speaker":"Michael Legaspi","text":"No, it's a pleasure to be here, Jonathan. Thank you for having me on this wonderful show, which has been just a wonderful thing for so many of us out here in the. The Internet sphere, I suppose. So thank you very much for. For having me."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":118.81,"end":143.78,"speaker":"Jonathan Pageau","text":"It's great. So. So Michael had this wonderful idea to go into the Psalms and look at this idea that the Psalms are in some ways a way for us to experience our own personhood, our own subjectivity, and a kind of frame for. For us to experience that. And I thought it was a wonderful idea. So maybe, Michael, you can start us off and kind of give. Give us your main thesis about the function that the Psalms can play in this."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":144.34,"end":259.17,"speaker":"Michael Legaspi","text":"Right. So I guess just kind of in reflecting in my. On my own relationship with Scripture, I've sort of noticed that there are just kind of ways in which the Scriptures make sense to me and ways in which I feel like I'm hindered in my understanding of them and my progress toward them. And sort of, as I thought about it, I thought a lot of the issues that I was having just as an individual were tied up with kind of my notion of self and how I interact with God and with the world. And this sort of brought me to this idea of subjectivity, right? So this idea of what it means for me to experience life as me and what it means for you to experience life as you and sort of all the things that go into that, right? Sort of consciousness, emotion, perception, all of these things influence the way we experience the world, the way we interact with others, and the way we interact with God. And as I was thinking about it, like, we tend to, like, work with, like, a few options when it comes to subjectivity, right? So we think of our. Ourselves, our consciousness, our interaction with the world as sort of cognitive, right? Like, what do I think and what do I know? And that sort of makes me who I am, and that kind of orients me toward the world. So I have to come up with the right worldview. I have to come up with the right philosophy so that I can kind of consider my, you know, have the right relation to what I experience. Another way of thinking about subjectivity is an effective way, like thinking about emotions and attitudes, right? So obviously those things affect the way we experience the world. So fundamentally, what makes me me. Is it my personality? I don't know about you, but, like, I like those personality tests, you know, and I've taken a lot of them. And, you know, I find that really interesting. And maybe that is something that, like, determines our. Our subjectivity is like something effective about us. Or we could go materialist, right? And we could say that subjectivity is essentially a reflex of kind of our existence as physical beings, right?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":259.17,"end":265.33,"speaker":"Jonathan Pageau","text":"Like emergent property is what they like to say. Emergent properties. Emergent properties, Right, exactly."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":266.53,"end":311.82,"speaker":"Michael Legaspi","text":"But I think that any of those ways of, like, thinking about subjectivity sort of limit us when it comes to interacting with God or reading the Scripture. And I think it's the Psalms in particular that helps us recover, I guess, what we might call a kind of scriptural subjectivity. So by that, I mean that we don't, like, exclude the physical or the cognitive or the effective. Like, all those things are definitely part of the human experience. But I think what psalms show us is that subjectivity, human subjectivity, is fundamentally relational. That what makes us who we are as beings and what kind of is at the core of our interaction with the world is our capacity for relationality, specifically for relating to God, which I think in the Psalms is presented as, like, the fundamental relationship."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":312.62,"end":343,"speaker":"Jonathan Pageau","text":"So, and that's. I mean, I just want to mention one thing, because if you realize then that when Christ says that, you know, the. Let's say all the commandments are gathered in to love God and love your neighbor. What's being enunciated there in some ways is not just an ethical command. It's not just the way that you have to act, but the way we have to be. That it's a. It's enunciation of what it means to be a being in itself. That a being is. Has to be in relationship with. In relation to others. That's how it works, right?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":343.08,"end":511.11,"speaker":"Michael Legaspi","text":"So, like, how do we move from the kind of domain of the self to something outside the self, I guess is a question. And do we do it on the basis of, again, our emotions, our cognitive maneuvers or whatever? I think the psalms kind of anchor us in something deeper and kind of a deeper way to make that movement, that movement that is fundamentally a movement of love. I was helped in my reflections by this distinction that philosopher Charles Taylor makes between two models of the self. He talks about something called the porous self, which he associates with pre modern cultures where people didn't draw this hard line between themselves and the world outside, but saw the boundary as porous. Things that happen in the world essentially can be experienced in this sort of direct way. There isn't like a wall, so to speak. And so this, he says, goes along with experiencing the world in an enchanted way. Right? So that we see we're kind of porous to the spirits, we're porous to cosmic forces, we're porous to God. And that in this mode, you know, along with that, is actually a kind of vulnerability. Right? So you have people who are sort of feel vulnerable to spiritual forces. And so one of the things that Taylor's interested in is like, what it means for us to be modern people. Right? And he says that one of the hallmarks of modernity is a kind of shift from this idea of the poorest self, where we kind of feel ourselves as being connected to and vulnerable to that which is outside of us, to what he calls the buffered self. So when he speaks of the buffered self, he's sort of talking about a model of the self in which we have, like, complete control over the meanings we assign to the world. So we can kind of stand back, observe things and decide what they mean. And we have this sort of buffer then that. That insulates us from what happens to us. And so not only do we have sort of control over the meanings we assign to things in the world, but he says that people see this as liberative because it gives them freedom. Like, I can assign whatever meanings I want. I can kind of remake myself as I like. And I think of Richard Rorty in connection with this because, you know, he's the one who sort of celebrated our kind of Nietzschean potential to recreate ourselves. And, you know, he says, he has this quote. He says there's nothing deep down inside us except what we have put there ourselves. So it's a kind of buffered self. And behind the buffer is this container that's completely at our disposal. Yes. I think this kind of modern view of selfhood, and, you know, I have to say to a great degree is kind of the view that I walk around with, you know, as a function of, you know, living when and where I do. And it makes it hard to kind of relate to that which is on the other side of the buffer, if you know what I mean, if you're kind of experiencing yourself in this. In this particular way."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":511.99,"end":570.98,"speaker":"Jonathan Pageau","text":"But it's interesting that now, because that way of thinking, especially online, especially the fact that we're physically separated from each other and we interact through screens. We interact. It's as if there's an acceleration of this. A notion of the buffered self is manifesting itself in the world and accelerated even in the means by which we interact. Like you and I right now, interacting through this screen. And so the consequences of it are more visible. Right. If you think of avatar culture, like this idea of people self creating themselves online through their Personas that are extremely. That have become very strange and, you know, like they can even be aliens or furries or whatever. Like people will self create themselves in ways that have become so idiosyncratic, it's almost now impossible not to notice the side effects of this buffered self. Like, it's. It's fragmenting and splintering in ways that in some ways, I think is opening a call of the heart of people wanting something more, wanting a more connected reality."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":571.46,"end":721.89,"speaker":"Michael Legaspi","text":"No, I think that's an excellent point. I do think that digital stuff and screens are, in a way, a kind of buffer that's just the version of the buffer that we're working with today. Also, the thing about the digital is that it really has this idea of plasticity and infinite potential, and you can rearrange and reconfigure endlessly. This idea that the stuff that we work with behind the buffer is infinitely plastic is, I think, part of the. You could just reuse, you know, use and reuse cultural tropes and memes and, you know, this bit of song and this image. And you can just sort of put it all together and create whatever you want. But I think what the Psalms point to when it comes to subjectivity is this idea that it's not infinitely plastic. There is actually something there that. That is God given, that can only really be at rest and fulfilled when we come back into communion with God. So I think Rorty is wrong. There's more than down in there than what we put there. Namely, there is what God put there. And I think it's the Psalms that, in this really unique way, kind of tutor us. They kind of lead us in this sort of manner of living that reconnects us, I think, with a notion of the self that's not fragmented, to use your word, but actually kind of reintegrated. Thinking about the Psalms, I got a lot of help from Saint Athanasius, who wrote this letter which I encourage everyone to read. It's called the Letter to Marcellinus, and it's a text all about the Psalms. He says some amazing things about the Psalms that if you don't mind, I'd like to share. He says, in other books of Scripture, we read or hear the words of holy men as belonging only to those who spoke them, not at all as though they were our own. And in the same way, the doings there narrated are to us material for wonder and examples to be followed and. But not in any sense things we have done ourselves. With the Psalms, though, except for prophecies about the Savior, it is as though it were one's own words that one read. And anyone who hears them is moved at heart as though they voiced his deepest thoughts. I think we could think of the Psalms as given to us to make the depth of the self accessible to us. Under normal situations, it's not fully transparent to us. And we fail to understand the movements of the soul, I guess is another way of putting it. And that the Psalms kind of help us to see those movements of the soul in ourselves. So I."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":722.29,"end":753.39,"speaker":"Jonathan Pageau","text":"And it's. What's interesting, too, about the Psalms is that it's not only a kind of whitewashing, like you can imagine it that way. It's like. No, it's just. It's trying. It's moralizing. It's trying to make you into the right person. It's trying to force you to think certain ways. No, like the cries of despair and of anger and of wanting revenge. Like all of these are part of the experience of reading the Psalms. It's not at all a cleansed a cleansed version of human experience. It's a very rich and deep and sometimes very dark version of it."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":753.55,"end":769.47,"speaker":"Michael Legaspi","text":"I mean, to be honest, some of them are difficult to read, you know, especially the prayers for vengeance. And it's hard to know what to do. They're famously difficult for people to work with. You know, maybe we should just be thinking about the demons as our enemies, for example. And. But I don't know. I think some of the Psalms are about people and very."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":769.55,"end":782.86,"speaker":"Jonathan Pageau","text":"But I. But I think that it's. If you see it more as something that encompasses the fullness of human experience and tries to. So if you see just the Song for Vengeance as being isolated on its own, then of course it doesn't."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":782.86,"end":783.74,"speaker":"Michael Legaspi","text":"It doesn't hold."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":783.74,"end":802.06,"speaker":"Jonathan Pageau","text":"But if you understand it as this, let's say, part of a musical symphony where there's this moment of dark, you know, and of anger and of asking God to be your. Your hand just to get done what you want. But then there are other moments where it expands into. Into a loftier vision of what. What is. What is possible, you know."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":802.53,"end":815.61,"speaker":"Michael Legaspi","text":"No, I like that very much. I think. And I think that's a good counsel. So reading Psalms together, right, it's sort of like you can obviously take an individual one and do whatever you want with it, but, like, taking them together is, I think, the right move."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":815.61,"end":841.27,"speaker":"Jonathan Pageau","text":"Just, you know, interpret, which is actually for all scripture. That's what you need to do. Because if you just read the Book of Judges alone, you'll go crazy. But if you read, you know, the early books and you read the prophetic books and this call for all, you know, the spirit of God to be on all flesh, and you get this big story, then all of a sudden, even the harsher parts, they tend to. To look like, like little. Like little movements in a grand symphony, you know."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":841.27,"end":914.7,"speaker":"Michael Legaspi","text":"Right. Right. Now that's. Yeah. And Psalms is a kind of microcosm of Scripture. Right. Like, that's another thing you find in the Fathers a lot is this reference to the Psalms as being like a mini Bible unto itself. And, you know, it was divided into five books to mirror the five books of the Pentateuch. So it's. It really bears kind of reading in that holistic way. So if that's true of the Psalms, then what is our response? And I think that this is where we have this sort of wisdom in the church, which is to read the Psalms kind of in bulk. Because when they're brought down into the heart and there's a statement in the Philokalea when they're brought down into the heart, they take root in the soil of the heart and produce the flowers of the spiritual life. Right. The visions of incorporeal realities, the luminosity of corporeal realities, the judgments of God which are hard to understand. So I think, and I'm saying it's not as like an expert, basically, in doing this or in spirituality Psalms. This is, for me, kind of like getting my own self oriented toward the way in which the Psalms can teach us function. Yeah."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":914.7,"end":956.42,"speaker":"Jonathan Pageau","text":"So you have this. This. So one of the things you want us to look at, which I think is a great idea, is that there are certain psalms which are read at matins and. And are gathered together from the book of Psalms and have a. Let's say there's a through line and there's a certain aesthetic to them in which they deal with this idea of darkness and, you know, falling into the pit and calling up to the heaven. So maybe you can guide us a little bit about the practice, basically, because these would be. These would be sung, you know, if in a monastery, they would be sung at matins. Right. At every. Every matin service. Right. And so if you. If. I mean, I've done matins, I don't do it very often, but when I do, then I. Then I engage in this. In. In this as well."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":956.82,"end":1250.14,"speaker":"Michael Legaspi","text":"Yeah. So I. I think it's important to sort of like, see and benefit, understand the guidance of the church when it comes to the Psalms. And I think there's, like, amazing things that are done with the Psalms that sort of clue us into how they can be shaping our subjectivity. And for me, one of the most powerful examples is this group of psalms called the Six Psalms. So for those of you interested in looking at this, this is their Psalms 3, 38, 63, 88, 103, and 143. Or in the Greek numbering, 3, 37, 82, 87, 102 and 142. So they come from across the Psalter, and they're chosen out and put together. And this group is called the. The Six Psalms. So I think the matins context is important because matins is the morning prayer service. Right. So if you're thinking about waking up, you've just come through the night, the new day is beginning. And matins is like, right on that boundary between the night and the day. So symbolically, we might say, between death and our waking to a life after death. So. And in Russian tradition, vespers and matins are kind of done together as part of the vigil before, like, say, you know, on Saturday night, say, before Sunday, in which case the six Psalms are part of the matins and are prayed, like, exclusively at night. And so, in Russian tradition, the parish I was a part of, they put out all the candles in the church during the sixth Psalm. So it was, like, utterly dark. The reader had just one candle and would read the Psalms and read them in a low voice and in a very solemn way. Nobody is moving. I actually came across an ancient tipicon which specified how the six Psalms were to be read. And the instructions were really interesting. One instruction is, this is in a monastery context. No one may sneeze or spit or leave his place or move or enter from the narthex. If someone is bent over because of old age or ravaged by sickness and cannot avoid doing, we have just described, let him stay outside the church until the end of the hexasalmus. So there's this atmosphere. It's dark, it's static, and you're just standing at attention and you're listening to the Psalms. And, you know, having experienced this a number of times, my sense is that the Psalms, the six Psalms, kind of bring us through an experience of death. You know, I think, like, the philosophers talk about memento mori, and they talk about thinking about death as a kind of, like, way to lead the philosophical life. But what these Psalms do is, I think, actually bring us through. We actually experience death liturgically. So the very first of the six Psalms is Psalm 3, which contains the line, I laid me down and I slept. I awoke, for the Lord will help me. What kind of waking is it? So, again, there are a lot of traditions that associate the six Psalms with. With judgment, with this idea that they're kind of preparing us to stand before God in judgment after death. And so the first Psalm has this image of falling asleep and waking up, and we wake into God's presence, which is a kind of judgment. God's presence is always a judgment, right? And so from there, the Psalms take a really dark turn, and there's just a ton of imagery there that, to me sounds like us as sort of having passed to the other side of death, are now looking back on this process of dying and these images that seem to match, like, they seem to voice the body being lowered into the grave. My heart is troubled, My strength has failed me, and the light of mine eyes, even this is not with me. My friends and neighbors drew nigh over against me and stood, and my nearest of kin stood afar off. I picture people at a funeral standing Afar off from the body filled with evils is my soul. Soul my life under Hades have drawn nigh uncounted with them that go down into the pit. I'm become it as a man without help, free among the dead, like the bodies of the slain that sleep in the grave, whom thou remembers no more. And they're cut off from the hand. They laid me in the lowest pit, in darkness and in the shadow of death. Against me is thine anger made strong. And all thy billows has thou brought upon me that was removed my friends afar from me. They've made me an abomination unto themselves. I've been delivered up, have not come forth. Mine eyes are grown weak from poverty. I've come cried unto the O Lord, the whole day long I've stretched out my hands into the nay, for the dead will thou work wonders? Shall physicians raise them up? They may give thanks unto thee. Shall any in the grave tell of thy mercy and of thy truth and that destruction? Shall thy wonders be known in that darkness or thy righteousness in that land that is forgotten? But as for me, unto thee, O Lord, have I cried. In the morning shall my prayer come before thee. So you're kind of lowered into the grave. Your kin are standing afar off. Yeah."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1250.46,"end":1368.52,"speaker":"Jonathan Pageau","text":"There's a deep, like, it's such a deep coherence to the imagery that that is used. And it can help you. Like you said, you talk about how the Psalms are in some ways a mini version of Scripture, and I think they are. I think that the key to interpreting scripture is often in the Psalms, because it's a poem and because what the poet does. And you see that in Christian poets too. Like if you read St. Ephraim, that's what he does. The analogies that they create help you to understand what the Bible stories are about, right? And so what you see in the. In the psalmist is that there are several things going on. One is that he goes down, right? So imagine, you know, there's the mountain of God, and he's going down the mountain of God. And going down the mountain of God has images related to it going underwater, right? It talks about the ways the billows going over me. It talks about fragmentation, right? It's like I am far away from those that I love. They can't. They every. Everything is broken and. And fragmented. It talks about the enemies. It's like if I'm far away from God, then all the things from the outside assault me, like I'm assaulted by things from the outside. Then it relates, it to sleep relates it to darkness, but especially it relates it to forgetting. This idea that I. I have been forgotten by God. I have forgotten God. And you see that, like the image of forgetting. You see that in. In during the flood, when. When Noah is on the. On the waters, at some point it says, God remembered Noah. And when God remembers Noah, it's as if in this darkness, in this deep, there's this connection. You see it in the story of Jonah. Jonah goes down to the bottom. Then all these same images come, right? The deep, the darkness, you know, the death and sleep. And then. And then he says, I remembered the Lord. And he calls up, right? He calls up to the mountain, calls up to the. To the high place. And these images are all there, like all these. These songs. That is beautiful imagery to help us, like, understand."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1369.4,"end":1369.68,"speaker":"Michael Legaspi","text":"Like."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1369.68,"end":1397.43,"speaker":"Jonathan Pageau","text":"How can I say this? To help us understand how the story of the flood relates to you. Like you said, this is a key for our own experience. Like how the story of Moses through the desert, the Egypt, the Israelites being slaves in Israel and being forgotten by God, and then God remembering them. And what that means, it's like. It's just giving us a key to. And showing us that scripture is not even in scripture. It tells us that the other stories that use those images are about your experience."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1398.15,"end":1527.45,"speaker":"Michael Legaspi","text":"Right? Right. Yes. No, I think that's wonderful. And I think, right, the way they kind of interweave and overlap, and then, like, psalms is sort of like the cherry on top. It's sort of like, okay, nice. You've heard Jonah do it, and you've heard Hezekiah do it. And, you know, you've heard Noah do it. Now it's your turn, right? So it sort of puts us in the sequence in a way so that we make this. This prayer as well. And so I think, yes, I love this. I think you're right. I think there's such a commonality between the metaphors that. That come with death and, like, being away from God and all the things you mentioned. And, yes, this land of forgetfulness, right? So it's a kind of a place, right? It's. It's not just a psychic state. I mean, there's definitely this idea that it's a. It's a place. And as you said, you're far from family. You have no strength, you have no comfort. It's just utterly painful. And I think the six psalms take us right to that point. They really just drive us down. And then there's this unexpected turn in the six psalms, right? So when you get to the fifth psalm. It seems to come out of nowhere. All of a sudden you have Psalm 102. Bless the Lord, O my soul and all that is within me. Bless his holy name. Bless the Lord, O my soul. Forget not all that he hath done for thee, who is grac. Unto all thine iniquities, who healeth all thine infirmities, Redeem with thy life from corruption, which is this place we're talking about, who crowneth thee with mercy and compassion. As for man, his days are as the grass, As a flower of the field, so shall he blossom forth. For when the wind is passed over it, then it shall be gone, and no longer will it know the place thereof. But the mercy of the Lord is from eternity, even unto eternity, upon them that fear him. So there's, like, this moment, and I think, like you mentioned Jonah, right? He, too, like, remembers God and his temple. And it's like he's able to. To kind of move, to ascend in a way, even though he's still in the. In the belly of the fish and like this. So you sort of make that ascent by virtue of. Of remembrance. And so there's this, like. As dark as it is, the six Psalms. I just think this moment of, like, remembering that you are not forgotten is essential to the movement of the song."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1527.77,"end":1561.92,"speaker":"Jonathan Pageau","text":"And not only that, but it helps you understand. It just helps you understand so much about what we say. Like, why is it that we talk about memory when we talk about the deceased? You know, why do we say memory eternal? We have this sense in which we understand that. In that it is memory, like it is God remembering us, that makes even our death, keeps us connected to God, that in this memory is how everything holds together, you know? And so it's a key to understanding even how in the church, we treat the dead and how we. The way in which, liturgically, we talk about people that have passed."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1562.08,"end":1665.71,"speaker":"Michael Legaspi","text":"Wow, I never thought about that. You're right. Why we're always talking about memory. But, no, it makes perfect sense. And I mean. And now that you mention it, you know, you have this burst of, like, praise in the fifth Psalm, but the sixth Psalm, you're kind of back down again. So it does not end on a high note, it ends on a low note. But like, to your point, one of the themes in that, in the final Psalm of the 6 is memory, right? O Lord, hear my prayer. Give ear to my supplication. Hearken unto me. Enter not into judgment with thy servant, for in thy sight shall no man living Be justified. The enemy hath persecuted my soul. He humbled my life down to the pit. He sat me in darkness as those that have been long dead. My spirit within me has become despondent. My heart is troubled. And then this, like, what you're talking about memory. I remembered days of old. I meditated on all thy works. I pondered patience. So memory kind of keeps him, like, from succumbing to the darkness in a way. I stretch with my hands unto thee. So he moves. He does something. My soul thirsteth after the. Like a waterless land. Quickly, hear me, O Lord. My spirit had fainted away. So it's sort of from this dark place. We have this sort of flash of, like, hope, this burst of hope. But then we kind of come back to this place and realize really all that we have in this place, we're utterly kind of helpless is our capacity to cry to God for mercy. And that. That comes from, I think, the soul, which is this part of us that is like, God given. And it's. It's. We can ignore it, we can suppress it, but we can't get rid of it. And it's the part that. That helps us always to cry out to God. And so even in this forsaken place, like, you still have that capacity to cry out to God for mercy. And."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1665.71,"end":1698.58,"speaker":"Jonathan Pageau","text":"And so that's this whole image of the morning like this. The morning that's coming and it's cycled. It's as if it's not yet the morning. It's like, I see the morning, you know, I'll hear you in the morning. Like, I'll see you in the morning. You will, you know, that there'll be. There'll be this light that will come. And sometimes it's. It feels like he's saying that it's now, but then he keep. He goes back into the darkness. But so there's this sense, like, I know, I know, I trust, I hope, I know that, you know, that God will deliver me, even though at this moment I might not be. I might still be in this. This darkness, you know?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1698.58,"end":1698.9,"speaker":"Michael Legaspi","text":"Right."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1698.9,"end":1712.66,"speaker":"Jonathan Pageau","text":"It's both very realistic, but also trusting in this, trusting this absolutely knowing that the light, the light of God, the remembrance of God and God, like I said, God's mercy is the thing that will bring me back into the light ultimately."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1713.14,"end":1803.41,"speaker":"Michael Legaspi","text":"Now, I think that's a great point. I think if the six psalms ended on this sort of high note and everything sort of, you know, wraps up nicely, then, you know, that wouldn't quite be what. What it's like, I mean, you call them realistic. And I think that's right. I think it is this sort of. Like, I'm despondent and I'm in this sort of waterless land, but then I have hope. But then, like, oh, wait, but I have to sustain that hope, you know? And it's a struggle, right? It's always a kind of an agon, like a struggle. So that's the way the six psalms end. And then the lights come on in the church, and then the deacon goes into a litany, and it's like, okay, I'm back in the land of the living. I'm praying now for the patriarch, and I'm praying for other people. And like, okay, I'm back. But it's sort of like you are invited to take this journey. And I mean, we have mountains every day at St. Vlad's which is a blessing. And you really get to see how the psalms can tutor you. And so I think this experience of going through death every day by virtue of the six psalms is one that helps you realize how important it is. Like you were saying, memory, to cultivate memory and remembrance and also to kind of open the self in such a way that its main. The central feature of its subjectivity is essentially this kind of relation to God by which we beseech his mercy, which is essentially the Jesus prayer. Right. Like, that's what the Jesus prayer is doing. But I think."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1803.41,"end":1849.19,"speaker":"Jonathan Pageau","text":"And then in the. I mean, in the philokalia, the idea of the memory of God, like, it's so present. It's so important to understand that in some ways, that is the way that we are connected to God is just. It's just through attention and memory. Like, if we. If we can live in that. In that memory, then, I mean, would you even sin? Like, if you could just live in the memory of God? Like, how could you? You know, it's always by forgetting. It's always by forgetting my connection to this higher. To the higher things that I fall into my own idiosyncrasy. And I think that I can get away with this, or I think that. That I'm isolated, like this buffered self, and that my thoughts don't matter, that my, you know, my actions don't matter. But if I remember God, then how can I. Yeah. How can I fall into these. Into these. These other types of patterns?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1849.59,"end":1852.23,"speaker":"Michael Legaspi","text":"Yeah, no, exactly. If only, right?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1852.31,"end":1881.9,"speaker":"Jonathan Pageau","text":"If only. Exactly. I'm saying, is it as if I can do that? But it's like whatever moment that I have where I'm Able to live in that memory. And, you know, and. And with the Jesus prayer, let's say, feeds me and I can. It becomes a pattern for me. Then I. Then I know that it's. It makes everything bright. Like, it just happens that, you know, this. This image of the morning and the light and the things that. That have the light of God that shines on them. Shine on them. That's what. That's what happens."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1882.3,"end":1926.52,"speaker":"Michael Legaspi","text":"I mean, so this possibility of sort of keeping one's attention fixed on God at all times is obviously, you know, difficult. But, like, I think that is the Psalms, right? It's like, as you were saying, it's every situation in life, how to fix your attention to God when you're. When you're angry, when you're just sort of filled with joy in the temple worshiping God. I mean, there are psalms that go there. There are psalms that have to do with conflict with other people. Right. And there are psalms that have to do with sitting by a brook and you see a deer come and drink the water. And, you know, it's just every kind of experience, there is one in which it is possible to fix one's attention on God. So in a way, like, the psalms bears witness to something that we can do but. But. But don't. Unfortunately."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1926.92,"end":1945.64,"speaker":"Jonathan Pageau","text":"Yeah. No, unfortunately. But it. But it's interesting because at least, like, because we have the liturgy and because we can at least have these moments where, you know, in some ways. How can I say this? Not that we're forced to do it, but that the external situation is kind of leading us into it, then we can have little glimpses of that. Of that possibility."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1946.28,"end":1958.04,"speaker":"Michael Legaspi","text":"Yeah, no, I think that's, you know, I think of the. I think the liturgy is sort of, obviously, the primary place where this happens for us. But, you know, you can always. You always got this. You can always, you know."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1959.08,"end":1963.04,"speaker":"Jonathan Pageau","text":"Yeah, just read. Read the Psalter and kind of go through the Psalter, like."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":1963.04,"end":2101.54,"speaker":"Michael Legaspi","text":"So there's this. The feature of the Psalms, I think that's also interesting is that the word soul comes up a lot. And so this is the, you know, the Hebrew word nefesh, which has a lot of different meanings. Nefesh can actually refer to your throat or your neck. So when I think it's Psalm 69, the waters have come up to my nephesh probably means the waters have come up to my neck. You know, they're high. But the word occurs in a lot of, you know, a lot of different places in the Psalms. And I think in other Places, you know, it has. There's something else going on with this word, in other words, what I'm saying. So when the soul is mentioned, the soul is always interested in doing particular things. And the soul, above all, is always interested in connecting with God. To you, oh Lord, I lift up my soul as the dear pants for the flowing stream. So my pants, my soul for you, oh God. My soul thirsts for God, for the living God, for God alone. My soul waits in silence. For him comes my salvation. Oh God, you are my God. Earnestly I seek you. My soul thirsts for you. Which is not the same as saying earnestly I see. You know I thirst for you. Right. I wait in silence. You could argue grammatically that maybe some. That's basically what it amounts to. But I do think the language is important here. And one of my former teachers, James Kugel, who's like, you know, really knows this, the biblical poetry world very well, he had this funny term for the soul in the Psalms. He said, the Psalms is a kind of double agent that in the Psalms, the soul is this sort of thing that's in you that belongs to you, but God put it there and it belongs to God, so it's ultimately loyal to God. And it's this part of you that's loyal to God and is only kind of happy, let's say, when it went, when in contact with God. Right. So you can kind of be at odds with yourself in the sense that your soul, which longs to be in contact with God isn't, you know, perhaps the things you're doing. It isn't, you know, I mean, like the things that we do. And so you have this sort of paradox where the part of you that you consider to be, like, most interior, your soul is actually only at rest, only at peace, only fulfilled when it goes beyond the boundary of the self to. To God. So we definitely don't want a buffer that's impenetrable."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2101.54,"end":2101.9,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2102.38,"end":2200.58,"speaker":"Michael Legaspi","text":"The soul needs to move beyond that buffer to God. And like, the more porous that is, the easier it is for the soul to come to God and back again, the more integrated the person. You also have these other verses in the Psalms where the psalmist addresses his soul. Why are you downcast, O my soul? Why are you in turmoil within me? Bless the Lord, O my soul, all that is within me. Return, O my soul, to your rest, for the Lord has dealt bountifully with you. You have this phenomenon of talking to your soul, not just like speaking, but like talking to it, you know, And I think this is different from when we talk to ourselves, you know, where we're just kind of verbalizing. Talking to one's soul is to kind of face up to a part of you like, that is you, but again, like, not completely, because it belongs to God. So you're facing up to a part of you that is. That is loyal to God, that will not rest until it sees God, like, just going back to subjectivity for a minute. Like, I think that is something we experience is sort of this being at odds with the self, you know, being unhappy, being fragmented, being conflicted, let's say. And I don't know, I think sometimes we don't. We kind of misdiagnose it. You know, we're like, oh, I'm just bored. I'm just unhappy. I'm just restless. I'm just sort of dissatisfied. And it could be that the conflict that's making you unhappy has to do with this, you know, this soul that rests in God and all of us who, you know, seize on various distractions in the world and prevent that from happening. So. I don't know. I know."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2200.74,"end":2209.22,"speaker":"Jonathan Pageau","text":"Do you think there's a connection between this term and the way that the, say, the Orthodox fathers talk about the noose, for example?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2209.38,"end":2243.9,"speaker":"Michael Legaspi","text":"Yes, yeah, I do. I do. So, yeah. Noose isn't normally, you know, a translation of nefesh, but. But it's like, as I was thinking about it, it reminded me a lot about. About noose language and like, the part of us that's. That can perceive and apprehend and relate to God and wants to, and is continually wanting to. So, like, there's this core feature of the self that, you know, in modern life, Right. In the confines of the buffered self, tend not to even acknowledge. And I think this is where a lot of our own kind of unhappiness comes from. Yeah."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2244.14,"end":2383.2,"speaker":"Jonathan Pageau","text":"There's also a way in which, you know, this idea of the soul for people or this idea of the way you described this. This category, which is like, in between. In between in the sense that it's the hook between. It's the place where God and you connect. You could say, right, the top of the mountain, like, however you want to describe it. You know, the holy of holies. There are many. There are different reflection of that, of that place or that reality in scripture from the individual. But then also, you know, when Moses goes to the top of the mountain, and then in that. In that place is where he receives, you know, the glory of God and the same thing in the tabernacle you know, in this whole. This place in St. Gregory of Nyssa really seems to join all of these together and say basically they're just the images of the same thing at different levels of. Of reality. But it's also, I think that for secular people listening to this, this is actually a necessary aspect of how reality works. That is, for things to exist, they necessarily have to have an aspect of their existence which transcends it, which links it to higher participations, right? This is. This is absolutely necessary for anything to. To exist. And so you can't. You can't find the purpose of things in the thing. It's always. It's always kind of in between. In between the thing itself and its telos, you could say. And so the fact that this exists for a cup or for anything is. Is just. That's just how it works. And so the. The notion that we have that should not surprise people. Like, it should not surprise people that humans also have an aspect of themselves which has to necessarily transcend their multiplicity, like this. This connector for us to be able to exist with each other, but then also for us to be able to exist toward that which is above us. And in this case, of course, we're talking about the very source of reality itself, right? The. The God of love. So, So I, I think that it's not a. It's something which can be posited almost technically for people, you know, and that the, The. The imagistic language need not make you think that this is some kind of magical, floating. You know, this is how people sadly imagine the soul. Like. Right? It's like, where is the soul? As if it's. It's a physical. Physical thing where. This is not what we're talking about here."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2383.99,"end":2430.05,"speaker":"Michael Legaspi","text":"No, it's. It's. It's. So I. There's a kind of paradox there, right? It's sort of you. If you. If you enclose the object, enclose the thing in such a way that it has to kind of be a kind of thing unto itself with a kind of inherent meaning, right? Not only does he lose the meaning, you lose the object, right? So, yeah, and so, like, I think the Psalms kind of. With this continual opening of the self is just. It's actually not a kind of escape from subjectivity, but a kind of fulfillment of it, a kind of like joining it with the world, adjoining it with God, adjoining with reality that makes the self not diminished, but, like, embedded and thereby kind of enhanced and more real."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2430.53,"end":2457.02,"speaker":"Jonathan Pageau","text":"And if you understand it that way, then what you talked about at the beginning makes so much sense when you said, you know, the mo, the mode of being, the mode of subjectivity is relationship. That is the mo. And so. But for that to happen, there has to be an aspect of me which is calling out, which is almost like escaping my. My closed self in order to be able to connect with God, to connect with others. This is. This is absolutely necessary."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2457.5,"end":2532.4,"speaker":"Michael Legaspi","text":"Yes. And, you know, I have to say I've had some influence from, you know, existentialist thinkers in the past, you know, who kind of know that this is true, actually. They know that this is part of what it means to, like, they're good phenomenologists. They know that this is how the mind works. But, like, for them, it's good enough that you just posit it. It doesn't really matter what's on the other side. It's like in the act of positing that, you can get the same effect. But. But can you? Yeah, but can you. I mean, is. Or do you know that you posited it in a way that kind of undermines its ability to anchor you? And I think the psalmist is always coming up against God in a way that's like, God is not manipulable. God is not yielding to him. You know, he's saying, listen, listen, listen, help me out. But God is. Is doing it on God's terms. Right. And so there's a kind of like, now we can talk about objectivity in a certain sense. Like, there's a certain, you know, aspect to. To God that is like, not you. It's other than you. And so you cannot fake. There's a kind of reality to that that can't. It can be, like, approximated maybe, but it can't ultimately be. Be reproduced. It can't. You know, it can be counterfeited, but it can't be, you know, it can't be reproduced in some."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2532.4,"end":2539.24,"speaker":"Jonathan Pageau","text":"Yeah, let's just say in the ways that the people watching this will totally understand. You can't completely just act as if God exists."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2539.32,"end":2545,"speaker":"Michael Legaspi","text":"Yes, exactly. Exactly. As if it's going to, like, you know, it's gonna."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2545,"end":2573.79,"speaker":"Jonathan Pageau","text":"It's gonna. Yeah, it's gonna act. So. But that's why, like, I tell people that. That ultimately the psalms are the good example. This is that ultimately worship is the key to this. Like, worse, it's like, it. Because worship places you in a mode where you are interacting, where you're acknowledging where you're placing yourself in relationship to God. And then. And then that is the training. Right. That's the training ground, which helps you, you know, not just make it into a mental trick, but make it into something that you embody, that you participate in."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2574.11,"end":2653.19,"speaker":"Michael Legaspi","text":"No, I think that's absolutely important. I think that's. That is the kind of real thing, ultimately, is worship. Right. And. And, you know, I am. You know, I just. I just love how in the church, you know, it's. It's that. That kind of worship is so full. It's. It's how you stand, right? It's where you're looking. It's what you're seeing iconographically, it's what you're hearing musically. And, you know, it's. It's. It's a kind of full bringing of the self into God's presence and a learning to stand in God's presence in a way that is. In a way, it's sort of like teaching you, but in a way, it's also the thing itself. And so there's a completeness to our experience as human beings in worship that isn't available when we're, you know, being consumers or we're, you know, distracting ourselves in various ways. And it's not, you know, I say this as, like. Not as, like, some great liturgical athlete, like, oh, I'm super. I'm like, no, I struggle, and it's hard for me because of the ways that I've grown up in my own kind of mind. But I am grateful that everything is there in place to kind of. To prepare us, not to create the relic, but to prepare us to experience it fully. So I do think liturgy and participation in services is kind of the main thing. But when you're not. You could be reading psalms."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2653.75,"end":2680.66,"speaker":"Jonathan Pageau","text":"Yeah, yeah. But just. Even the Jesus prayer, like you said, the Jesus prayers is a form of memory. It's a form of. Of just constant participation. And so it's. It's always accessible to us, even if it's just for 30 seconds, like just that moment when you're in between things, just that moment when you're distracted, when you're nervous, when you're anxious. It's like the Jesus prayer is such an amazing thing. We can. We can reach out to. To kind of put ourselves in that mode of attention, you know?"}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2681.06,"end":2738.06,"speaker":"Michael Legaspi","text":"So I think, you know, just. Just talking about the soul and, like, there being some part of us that is, like, constantly, like, trying to go up, you know, you use the. The of axial imagery, you know, and I think that's true. The soul is like the part that's trying to go up all the Time and the flesh is the part that's trying to, like, sink down all the time. But so if, like, there is this part of us, then a Jesus prayer is a kind of like, stepping out of, like, attention to one thing onto attention of the soul to God. That's also real. I mean, I think that I'm just being, like, thinking about criticism. Oh, the Jesus prayer, that's just like a nervous tick or like, oh, that's just something, you know, you're saying, or that's just like, something you're saying, like, therapeutically just to make yourself feel better. But no, it's not. You are actually. It's like there's an electrical current there, you know, with the soul to God, and you're kind of plugging in, you know, and then, you know, maybe you can't plug in for. For a long time, but you can plug in for a few minutes, and then that. That changes you. Right. Like, there's an energy there."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2738.14,"end":2783.88,"speaker":"Jonathan Pageau","text":"Yeah, but that. But it's all. Once you understand the role of memory and attention and the way in which we exist in relationship to others, but also, I mean, just even in terms of our relationship, like, memory and attention is how you stay connected to your friends, to your family, to all the people that. That are around you. And so this idea that it's. That it would be arbitrary that you would have these. You would try to have memory and attention in your. In your life, in your daily life towards God. Like, just like you said, just connect, even for just 30 seconds, one minute, you know, like waiting. Waiting outside for someone or whatever to just kind of go into the Jesus prayer. That's ridiculous. It's like, it's actually. It will create a. A basic strata of what you are. Like, it'll create a basic strata of what's most important to you."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2784.6,"end":2792.76,"speaker":"Michael Legaspi","text":"Yeah. I. I was just reminded of something I heard a while ago about how kind of the currency and the digital economy is attention. Right. Like, that's what."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2792.76,"end":2793.84,"speaker":"Jonathan Pageau","text":"Right. And."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2793.84,"end":2816.09,"speaker":"Michael Legaspi","text":"And it's sort of like when. When. When you kind of realize that, and then you kind of pair that with, you know, I think the truth that you're. You're articulating here about attention being kind of what we have, it sort of raises the stakes in our daily lives. Right. Like, we think, oh, it's an innocent thing that I'm doing this, and I'm diffusing my attention in here and there. But. And it's easier than ever to diffuse one's attention."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2816.09,"end":2822.57,"speaker":"Jonathan Pageau","text":"But, yeah, our world is made to scatter Us, like, everything about it is like it's made to rip us apart."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2822.57,"end":2822.84,"speaker":"Michael Legaspi","text":"So."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2822.91,"end":2864.88,"speaker":"Jonathan Pageau","text":"So, yeah, it's difficult, but, you know, in some ways it's like, it's. It's weird because it's difficult, but at least at this moment we have the capacity to see it. Because the fact that online, the cycles of attention are so accelerated and the scattering of attention is so immediate, we can realize to what extent attention is the mode. It is the mode of connection. Like, that's what it is. So you're like, wait a minute. It's. So I think that in some ways it is opening up the possibility of people to understand that and to re. Enter into, at least reenter into that space where it's like, yeah, well, yeah, where I put my attention is probably one of the most important things that I can decide what I'm doing."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2865.44,"end":2872,"speaker":"Michael Legaspi","text":"Okay. So I think we have to add that to, like, an understanding of subjectivity, not just cognitive or effective, but, like, attentive. Like. Yeah, yeah."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2872.08,"end":2879.8,"speaker":"Jonathan Pageau","text":"So we hear it in the. In the liturgy all the time. It's like, attend. That's it. Just attend. You know, stand up, attend. You know, that's. And that's."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2879.8,"end":2880.12,"speaker":"Michael Legaspi","text":"That's."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2880.12,"end":2881.6,"speaker":"Jonathan Pageau","text":"That's a good start, you know."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2882.48,"end":2925.12,"speaker":"Michael Legaspi","text":"Yeah. And they're kind of timed in a certain way, like. Oh, yeah, okay, right. They kind of like bring you back. So. No, that's good. I didn't make that connection. But. No, that's. I don't know. How do we. Yeah, attention. Yeah. I think that's the psalmist is. Is. He might be, like. He might be impatient or he might be angry, or he might, you know, he might be any number of things at any given moment, or even pretty dark, almost despairing, but, like, always attentive. That's the kind of baseline of it. It's like, God, I'm looking to you, I'm attending to you. Are you going to help me or are you going to save me? Or thank you so much, or I'm going to praise you, and I'll praise you as long as I live, you know, but whatever, wherever he is on that in his life at the moment, that's certainly what's there."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2925.6,"end":2936.4,"speaker":"Jonathan Pageau","text":"Definitely. Michael, this has been a great conversation. Thanks for having it. And I'm looking forward. I'm going to be at St. Vladimir's in April, and so I hope that I can meet you. That would be wonderful."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2937.12,"end":2944.64,"speaker":"Michael Legaspi","text":"Oh, that's exciting. Okay. I'll look forward to welcoming you on campus. And thanks for having me. The show I did, I enjoyed it a lot. I appreciate the time."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2944.96,"end":2951.2,"speaker":"Jonathan Pageau","text":"All right, so we'll see how people react to this. You know, we always look forward to your comments and who knows, maybe we'll have another discussion."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2951.44,"end":2952.48,"speaker":"Michael Legaspi","text":"Very good. Excellent."}
{"episode_id":"SW - #275 - 2023-02-23 - Michael Legaspi - Subjectivity and the Psalms","start":2952.72,"end":3015.77,"speaker":"Jonathan Pageau","text":"Thanks. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
