{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":0.72,"end":82.16,"speaker":"Jonathan Pageau","text":"Hello everybody. I am here with Mario Bagas. Mario is a scholar in Sydney. He teaches at Saint Andrews Greek Theological College. He sent me a book in which he wrote about the symbolism of the foundation of Constantinople, but also based on ancient civilizations as well. I found it very interesting his understanding Constantinople and kind of its place in world history and mythical history, which you. If you watch my last conversation with Richard Rowland, you will see that we're kind of going in that direction. So I was hoping to talk to Mario a little bit and explore the kind of the foundation of Constantinople, its place in how the ancients viewed the world and kind of its mythical position. Let's say. This is Jonathan Peugeot. Welcome to the symbolic world. So Mario, tell us a little bit about your own background, you know, how you kind of came to this subject and tell us a little bit about the impetus for your book."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":83.36,"end":482.31,"speaker":"Mario Bagas","text":"Jonathan, I thank you for having me on. It's surreal. A blessing and a privilege. You're much loved here in Sydney, especially in the milieu's that I, that I move in. So when I mentioned to some faculty and students that I would be speaking with you, the responses were, oh, the symbolism guy. And also, oh, he spoke to Jordan Peterson. I'm like, yeah, that's him. So it's a real honor. The impetus for my book, well, it goes back almost a decade to when I started my PhD and I was kind of being geared up to teach history at the college that you mentioned, where I'm teaching now in the discipline of twistics. And so I was interested in symbolism, which you know more than I do about symbolism. But I was interested in looking at how architectural symbolism imaged a particular civilization's image of the cosmos, their view of the cosmos, and you know, honing in specifically on an orthodox Christian vision of the cosmos as well. So how did Constantinople reflect an orthodox Christian vision of the universe? And that was a broad topic, too broad for my purposes. So we basically had to, had to look at the founding of Constantinople, which took place in the 4th century, of course, in 330 A.D. founded by Constantine the Great. The issue was that at the time I wasn't really content with the sort of bricks and mortar approach that we were taking to the topic. It was like an analysis of the raw material of how the city was constructed. And so I moved over to Sydney University to the Department of Religious Studies where I was able to undertake an interdisciplinary approach that I took into consideration the role of religious symbolism in the city and how these symbols facilitate participation into, into the realities that they pointed to. But then I realized that, you know, when you're discussing the founding of a city like Constantinople, you have to look at the antecedents, because these antecedents were actively, let's say, built upon by Constantine. And in fact, it was inescapable for him. He had to found a city in such a way as to reflect the cosmos in the way that his predecessors had, going all the way back to rulers in Mesopotamia. You know, that's kind of how cities were built back then, with a religious structure in the center, whether it was a pagan temple or later a Christian church. So I kind of. I went back to city building in ancient history and went all the way back to ancient Samaria, where the first cities emerged. And that's where the kind of book comes out of. Because if you look at it, the beginnings of city building, that's what I start with in ancient Mesopotamia. And then it goes through ancient Egypt, where things become more emphatic in terms of the way that the cosmos is recapitulated within their temple structures. Ancient Egyptian temples, of course, reflecting the cosmogony of various ancient Egyptian cities, their respective cosmogonies, so how their visions of the universe function, how the universe came to be in their midst. And then I looked at Greece and Rome, and Greece and Rome are very relevant for Constantinople because Constantine is going to do things like move the palladion or palladium from. From ancient Greece and put it in the forum in his city. What does that mean? What's the symbolism behind that? You know, he's modeling Constantinople as a new Rome based on the old Rome. So I had to look at the old Rome and see how that was established. It was founded on seven hills. Constantinople is going to be founded on seven hills later. But then perhaps the most important aspect is the Christian dimension because Constantine is founding his city up upon, let's say, that ancient kind of pedigree of city founding, and that involves pagan symbolism. But he's also building churches in the city. He's Christianizing the topography of Rome and Judea and other places. So that was all very interesting. You know, how is this transitionary figure, St. Constantine the Great, managing to found this city in a manner that's consistent with ancient civilizations going all the way back to ancient Mesopotamia, which the Egyptian connection at least, is very clear because you have obelisks in the city. So in case that wasn't clear and, you know, and then also doing it in such a way as to incorporate his, I think, is an undeniable commitment to Christianity, which will become paradigmatic for this city for the next thousand years and will kind of set up the foundations for this bastion of Orthodox Christian civilization. So you get that in this book, I guess, to the best of my ability, I spent 10 or more years putting it together. And the kind of. The more specific, let's say, themes that I address, if we get into the nitty gritty of it, is how cities in the ancient world. So ancient pagan cities up to the beginning of Byzantine Christendom. So that's the span, and it's a big one. And I realize that there are deficiencies in that, but. But I did my best to make it work. How they can be seen as axis mundi, centers of the world, imagines mundi, or images of the world. And axis mundi and imago mundi were heuristic concepts put forward by Mirceliade, the great Romanian historian of religions in the 20th century. And also I tried to link that to the way that rulers represented themselves, kings represent themselves, because all of these cities were being founded by kings. In making these cities images and centers of the world, and by image and center of the world, we're including, of course, the heavenly dimension, the terrestrial, and the subterranean, which is the, let's say, threefold manner, generally speaking, that reality was conceived of at that time. How these rulers were imitating their gods in shaping the cities in this particular way, because somehow, at least in Mesopotamia, but also in Egypt, the city embodies the cosmogony. Yeah. The creation of the world."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":482.39,"end":499.87,"speaker":"Jonathan Pageau","text":"And I think for a lot of people, some people who are watching this will think, okay, this is a pagan thing. This is not, you know, this is just a pagan thing that entered into Christianity. But we have to remember that, first of all, the temple and Jerusalem in the Old Testament had a. Had an exact same approach to reality."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":499.87,"end":500.23,"speaker":"Mario Bagas","text":"The."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":501.46,"end":544.19,"speaker":"Jonathan Pageau","text":"When Moses goes up the mountain and receives the plan of the tabernacle, he's receiving a cosmic image. And then that cosmic image, which is, you know, the Garden of Eden and how the world lays itself out, then becomes the way in which Jerusalem is built and finds its final reflection in the. In the heavenly Jerusalem, which ends up being kind of a final cosmic image of the city as cosmogony. And, you know, with. With everything there, even the idea that the. The outside or the ocean itself is dried up in the sense that it's as if the temple or the disordered cosmos fills up the entirety of every possibility. And so it's not just a pagan thing. It's very much a Christian. Christian Jewish and Christian reality as well."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":544.59,"end":589.59,"speaker":"Mario Bagas","text":"100%. 100%. I address that in the book as well. We look at Israel and how the temple becomes a recapitulation of, of precisely that. Eden. Of Eden. And this feeds into the whole Christian narrative. And Constantine, you know, I mean, he's undeniably a Christian, undeniably in his founding of the city in this way. What is he doing with this sort of pagan symbolism that is utilizing this? Trying to communicate an underlying message of the city as a cosmic center. And that becomes replaced by emphatically Christian imagery as time goes on, exemplified in images like Christ, Van de Grador, the master of all in the center of domes. But even that, and that's guided providentially, I believe, has its anticipants in how cities are first founded. So it's all, it's all kind of. Yeah."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":589.99,"end":602.47,"speaker":"Jonathan Pageau","text":"So tell us a little bit about, let's say in the founding of the city. What are some of the, let's say, decisions that Constantine makes in order to, to create this, this cosmic, this cosmic city."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":602.87,"end":652.29,"speaker":"Mario Bagas","text":"Well, I mean, Constantine the Great is one of those characters where depending on how you arrange and look at the sources, you end up with a different representation of Constantine. So I'm committed to the Church's vision of Constantine, Saint Constantine the Great. And I think that when we look at Constantine, we can trust tradition to a large extent. But if we're looking at some of the primary sources that address the founding of the city of Constantinople, we're looking at figures like Eusebius of Caesarea, of course, Socrates of Constantinople, who's continuing Eusebius is the first church historian. Socrates is continuing Eusebius history over a century after Eusebius had completed it in the 450s. So if Constantine's reign is, let's say."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":652.29,"end":652.69,"speaker":"Jonathan Pageau","text":"From."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":654.77,"end":938.13,"speaker":"Mario Bagas","text":"As emperor of Byzantium, I mean 300 to 337, let's say he founds Constantinople in 330 as Emperor of Rome, sorry, 300 to 337. Eusebius is a contemporary, so he's writing around Constantine's time. And later we're looking at Socrates over 100 years after that, in the 450s. We've got Sozoman of Bedhelia, we've got Philostorges as well, who's an Arian historian. So all of these figures write about the founding of Constantinople and they all agree, whether the orthodox sources like Socrates and Sozoman, the semi Aryan ones like Eusebius, or the emphatically Aryan ones like Philostorges. That the city was founded according to God's providence. Eusebius is not really keen to talk about Constantinople much. He's more of a fan of the old Rome. So all he says about it is that he says in the Life of Constantine that the emperor consecrated the city to the martyrs God. And that is indeed true. The city was founded on the feast day of St. Makios, who is a martyr of the city of Byzantium, which is the old name, Constantinople, the name of the old city. He was a martyr of Byzantium under Diocletian, Constantine's predecessor and the initiator of the great persecution against the Christians. So that's all he says. Then you have the next, chronologically speaking, is to the Sturges. And he speaks about the providential founding of the city thusly. He says that Constantine began his construction on the city at the place where the porphyry column stands. And that porphyry column was in the center of his forum in the city. And it was bestrided by a statue of the God Apollo, made to resemble Constantine. It also had Christian relics embedded in its base, including the flask containing the myrrh from the that anointed the feet of Christ, some of the loaves that the Lord had multiplied, and so on and so forth. Also parts of the true cross discovered by St. Constantine's mother, St. Helen were embedded in this column. So he says that Constantine started there and that he was with his retinue and they were marking out the boundaries of the city. And he was walking ahead of his retinue with a spear in his hand, almost like an augurs lituis, you know, kind of designating the sacred boundaries of the city. And he's walking, he's walking. They're all getting. So someone who had, let's say, who was in a position to speak to him freely is what Philost says. So somebody in the inner, inner circle, right, runs up to him and says, how much, Father Lord? And he goes until the one who is in front of me stops. So he was following an angel, marking up the boundaries of the city. And then when the apparition vanished, he put the spear in the ground. He said, this far. And that was the point at which the gate of Constantine in his land walls was built. Of course, Constantinople is a promontory, so it's surrounded by three bodies of water with land walls on the western side. So that's what Philostorges says. He also calls it a new Jerusalem, which is an emphatic motif. It comes back later on in Saints Lives in the life of St Daniel, the starlight. St Daniel is on his way to the Holy Land and he encounters an angelic figure. It's a monk who's later revealed to be an angelic figure who informs him that, why do you go all the way there? There are robbers on the roads these days, and it's not safe. If you go to Constantinople, you will find a set in Jerusalem. So this is a motif that you can see must be kind of accruing to the city by the mid-400s, early-400s, when Philostorgius is writing because of the construction of churches, incorporation of saints, relics, and so on and so forth. Socrates and Sozomen, they also discuss the founding of the city. They speak about, well, some of the practicalities, some of the great fountains that Constantine has built in the city, the racing circuit, the very famous hippodrome, and some of the spolia that will go into the hippodrome, like the tripods from Delphi. And all of this has underlying symbolism about what Constantine wants to communicate about his new capital, the tripods from Delphi, the fact that he's put a Senate in his city to match the Senate of the old Rome. And that's generally what they say about the founding of the city, that it's a providential, let's say, act."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":938.69,"end":1009.53,"speaker":"Jonathan Pageau","text":"Yeah. And one of the things people need to remember or notice is that in a way, Constantinople is the first Christian city that was founded, you know, in the. In the conversion of Rome. And so despite some ambiguous symbolism, as you mentioned, the fact that he has himself displayed, you know, portrayed as the God Apollo. So there is a transition period. There is a kind of strange moment where I'm sure it's also that Constantine himself is figuring out what this means. You know, he has this kind of conversion moment or this conversion movement, but he maybe doesn't completely understand all the implications of what this conversion is. But nonetheless, you see him founding what turns out to be the first Christian city and what will end up being, let's say, the glory of Christendom for a thousand years. That is the image of the city, even in the west of the holy city will be this vision of Constantinople and also the refounding of Jerusalem by Saint Helen as well. Those kind of two acts at the same time seem to be this, this. This marker of this new beginning or this. This new kind of Christian civilization."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1010.57,"end":1149.81,"speaker":"Mario Bagas","text":"That's right. That's right. And he's doing something similar as well in ancient. In the ancient Rome, the Old Rome, I mean, it's both providential and also a mark of incredible, let's say, shrewdness that St. Constantine built Martyria or Marty churches, shrines above the tombs of the martyrs who were, because of the prescriptions regarding performing executions within the city itself. And the fact that cemeteries were outside of the city, in the various necropolis outside of Rome, and that he built these materia in a circle. And I won't take credit for this. It was once remarked to me by Professor Moore is his name that it's like. Because I had discussed it, you know, he's built St. Agnes, St. Sebastian, St. Lawrence, St. Paul outside the walls, St. Peter's on the Vatican hill, He's ringed Roman churches, and he's built maybe one or two within Rome itself. Not many within the city, but that's, that's fine. And so it's like a new sacred boundary for Rome where if you're coming into Rome through one of its main, let's say arterial roads, you know, all roads lead to Rome. After all, you encounter, you'll encounter one of these basilicas because that's what he would have been building, these rectangular sort of churches. The first, very first monumental Christian architecture. So, I mean, we have a lot to be grateful for in relation to Constantine's reign. But could you imagine a conversation between, you know, I don't know. I've always thought of it like a couple of pagan soldiers riding into the city. What's that new building and what's that image on top of it, you know? Oh, yeah, that's what the Christians believe in that, you know, and if they inquire further, they'll discover the name of the saint that it's dedicated to and the saints, the narrative of the saint's life. And so it's an incredible testimony and witness that takes place in Rome, in the Holy Land, as you said, on the places of Christ's crucifixion and resurrection and his birth. And also in Constantinople, in Constantinople, it's towards the end of his reign. So what we're seeing there is the beginnings of Christianization that he didn't really get to see to its, let's say, zenith. The zenith is Justinian. It's a couple of centuries later."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1149.81,"end":1150.13,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1150.13,"end":1182.48,"speaker":"Mario Bagas","text":"But he started it off. He built Holy Apostles in Constantinople, which was the mausoleum church where all future emperors would be interred, again refurbished by Justinian, because Saint Justinian, he basically rebuilt all of Constantine's edifices in the city. So Holy Apostles and at least Holy Peace were built by Constantine, he began work on holy wisdom, but it wasn't completed until the reign of his son. And he built new churches outside the city. So, you know, all of this is."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1182.48,"end":1185.44,"speaker":"Jonathan Pageau","text":"How many things can you do in one lifetime as well?"}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1186.88,"end":1196.32,"speaker":"Mario Bagas","text":"And they'll still accuse him of being a pagan or something like that. For one statue that looks like Apollo. I mean, come on. It's ridiculous, but, yeah, he did a lot. He did a lot."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1196.32,"end":1245.01,"speaker":"Jonathan Pageau","text":"And the image that you had. I wonder. There may not be any sources of that, but the image that you described of Constantine carrying this lance out and planting it in the ground really brings up that image of Constantine's lance, which supposedly found itself in Western Europe in the hands of King Otto. And how it became kind of this image of the holy lance, because that lance, supposedly, that King Otto had was Constantine's lance and had supposedly relics of, like, the nails of Christ which were embedded inside this lance. And so, you know, and just like when you said that image, I just had this vision of this relic that we've seen, you know, this kind of this holy lance that we've seen in all kinds of fictional stories as well."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1245.33,"end":1247.97,"speaker":"Mario Bagas","text":"Yes, Spear of Destiny and all that kind of stuff."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1247.97,"end":1320.53,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly. Well, supposedly that's where. That's the origin of it. King Otto had gotten it from. It had belonged to Constantine in the past. And so, like, this whole. And then it goes into Germany, and then it has a whole history in Germany as well. So it's like one of the things I want to bring up. I guess the reason why I'm talking about that is just how different events were than the way that we think of it. Like the way that we think of founding a city. We don't think of augurs. We don't think of taking a lance out and following an angel in order to plant the lance. But this is really how ancients understood reality. And this is really also. I mean, not just even before Christian times, you know, there really was this sense of the. Of using augurs and using a spiritual intuition in order to act. It wasn't just this kind of cold, cynical political action. There was something. There was something underlying it. Let's say there was a vision underlying what they were doing. And that's what also that, say, created the stability of the city for so long. You know, we moderns, we are so smart, but we haven't yet made anything that's going to last a thousand years. You know, let's see how history treats us. You know, it's not that simple."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1322.29,"end":1440.74,"speaker":"Mario Bagas","text":"I agree with you. 100%. And look, I mean, there's something about this cosmos chaos dialectic that was really directly experienced by ancient and medieval people, persons that translated itself into this sort of city building and the need to. To cosmosize the space, to bring heaven down to earth in the space, to respond to manifestations of the sacred in such a way that you dwelt near them. Well, these are the things that people like Eliade addressed in relation to religion diachronically, or religions diachronically. But it can also be seen in relation to. To Christianity, to orthodox Christianity. No, we build our churches upon the places where the martyrs are killed. If we can, we incorporate sacred relics into our churches. Eliade spoke about higher off in these manifestations of the sacred in a very vague and general sense. But we can speak about theophanies which we see in the Old Testament, you know, the disclosure of the trinitarian God to prophets in the Old Testament, to. To saints throughout the history of the church. And we honor that by wanting to dwell near that or to kind of, you know, be as close to it as possible, to honor the spot, to adorn it, to recreate the circumstances in which that initial theophany took place so that we can partake of its blessing. You know, this is something that absolutely conditioned cities in ancient times. And in medieval times, the modern city tried to incorporate some of that, I think, with neoclassicism and everything else. But ultimately, as Lewis Mumford, a great historian of cities, said, the fate of the modern city was to become a backdrop for advertising because, you know, our contemporary discourse is all about economy now. Instead of temples or churches in the centers of cities, what we have are central business districts."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1440.74,"end":1446.68,"speaker":"Jonathan Pageau","text":"And that, yeah, Times Square is the holy place of, you know, of New York 100%."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1446.84,"end":1510.85,"speaker":"Mario Bagas","text":"And, you know, ironically, in Times Square, I mean, I happened to visit the US in 2013, and there's that statue honoring a Catholic priest, I think it is, with a Celtic cross behind him. And I thought of the symbolism of that. You know, it's entirely dwarfed by Coca Cola signs and, you know, all of that other stuff, which on an existential level as well, is problematic. What's good about Constantinople and medieval cities is the iconography, and you're the expert on this. The saints giving the blessing of peace, engendering dispassion. And Constantinople was full of images like this, not only in churches, but in the public space, in the thoroughfares. All medieval cities were. All medieval Christian cities were. But especially Constantinople was the paragon. But today, the opposite takes place. In fact, because of the need to market products to us, our passions are exacerbated. You know, they associate the product with a semi naked person or something like that. It's very different. It's not. We've lost that wisdom, Jonathan."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1510.85,"end":1511.21,"speaker":"Jonathan Pageau","text":"I think."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1512.17,"end":1512.73,"speaker":"Mario Bagas","text":"Indeed."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1513.77,"end":1563.01,"speaker":"Jonathan Pageau","text":"And so maybe you can tell us a little bit about. Because one of the problems of our historical perception is that the west has almost completely effaced the memory of Constantinople. And this is of course, a strange delusion that has come about and I sometimes struggle to see where it started. But definitely by the time we reach the modern age, most people don't understand how important Constantinople was, how important it was in terms of meaning, not just in terms of commerce, which it was, not just in terms of politics, which it was, but also as this vision of a holy city, of a Christian city. And so you were telling me a little bit offline about some of the perception that you had of how important Constantinople was in the Middle Ages. And maybe you can expound on that a little bit for us."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1563.41,"end":1873.81,"speaker":"Mario Bagas","text":"Well, I mean, you have the historical, let's say, impressions that we get out of the emissary sent by the Kievan Rus to Constantinople, when they reported back to Prince Vladimir, they said something like after they had entered Hagia Sophia and experienced the Holy Liturgy, we knew not whether we were in heaven or on earth. I mean, it was really considered to be some kind of a mystical place. Constantinople could be said to be mystical for several reasons. The grandeur of its buildings. I mean, and this links back to what you said about the west not taking Constantinople seriously. Obviously, in the discourse in Western academia, at least since the 1700s with the Enlightenment, there's this, let's say, trajectory whereby, you know, tradition, religion, all of these sorts of things have to be either ignored or mocked when it comes to studying them in their past and their past manifestations. So this is part of the reason why historians like, let's say Edward Gibbon and before him the French thinkers, Voltaire and others ignored Byzantium, mocked it, decried it, all these sorts of things. And so that affected the scholarship because when people were going back and studying past civilizations, it was all about the glory of ancient Greece and Rome. But then they didn't want to acknowledge that Rome continued in the East. And with the continuation of Rome in the east, what you also have is the continuation of engineering practices. You have the continuation of artisans and their trades. You have the scholarship, historiography, playwriting, all these sorts of philosophy. And all of that fed into Constantinople. There's a map at the back of Warren Treadgold's the Early Byzantine Historians, I believe the book is called, which shows all of these. It's all the sources that we basically have about the Byzantine period, historiographical sources, where these people were born, these great historians and thinkers, and where they all ended up in Constantinople. It's all these kind of lines heading towards Constantinople, right? So it was the place to go in Justinian's time. The kind of, let's say, monumental architecture was unsurpassed. Hagia Sophia was the largest building in the world at the time. After he had finished construction in 332 AD, you know, he had said something like, solomon, I have surpassed thee. It's bigger than the temple in Jerusalem, right? So he built maybe 50 churches in the city. 50 churches in the city, Justinian, to accommodate the population. So we have that practical monumental Christian architecture, all of which is reflecting the Christian vision of the cosmos. Cruciform churches to participate in Christ's death on the cross. The beginnings of domed structures in the 4th century are perfected by Justinian with his dome in Hagia Sophia. By the time you get to the 9th century, in spite of the Islamic incursions in places like Palestine and Egypt and Syria, Constantinople is still the jewel of the world. The Muslims want to capture it because they know that it's full of treasures and riches and bounty and everything else. The west wants to kind of. Well, you know, it's. At least in those centuries, it's kind of like Charlemagne's trying to marry Empress Irene in order to. You know, it's like, well, we want to be part of this somehow. It's the envy of the world. We also despise. They despise the Byzantines too. It was this back and forth. Eventually, what you have in 1204 is the Fourth Crusade, which sacked the city and leveled it. But all of these testimonies speak about a place which was unparalleled in terms of art, architecture and spirituality. If you read Constantine Porfiro Yenitos Book of Ceremonies, this book describes all of the public services and rituals that the emperor had to participate in. And there were many. I think there were 17 that he had to be part of. And it describes them in detail. And it's almost like if you have this. This concrete space which is reflecting heaven on earth, and in the public space you have images of Christ and his saints, the Panaya, the Mother of God, everywhere, everywhere, right? And the actualization of that symbolism with the rituals and the processions and the. And the public worship, you know, it's. It almost like, seems like something out of a dream. And I think that part of the reason why this city inevitably fell a thousand years later, because, you know, it bounced back after the Fourth Crusade, it also kind of, in those last centuries, was able to do things in terms of spiritual achievements that are. They have no parallel, I believe, because you have the. The most, let's say, deft refinements in hesychasm, hesychastic practice in those last centuries. So that spirituality you have, and you're the expert again here, the best iconography produced."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1873.97,"end":1882.69,"speaker":"Jonathan Pageau","text":"Yeah, you reach the apex that so many people recognize. Iconography happens at the twilight of its political power."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1883.89,"end":1918.71,"speaker":"Mario Bagas","text":"Why is all of this happening? I mean, it has to do with a certain mentality, a certain disposition. Of course, that mentality and disposition has been facilitated by centuries of church building and public processions and veneration of relics and. And the commissioning of art and all these sorts of things. Theological controversies, theological debates, iconoclasm, the victory and triumph over iconoclasm. And then you reach the end of this civilization, and, you know, you get stories like, oh, yeah, the Emperor Andronicus, Palaiologos was in the senate meeting, and St. Gregory Palomas's father was ecstatic. So they didn't want to bother him."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1922.47,"end":1936.85,"speaker":"Jonathan Pageau","text":"Exactly. It's like it's. It's still. Yeah, like you said, it's. It's the holiness and the admiration of the saints and this kind of possibility of just saying that. It's like, oh, he was in an ecstatic state, so we didn't want to bother him."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":1937.41,"end":2065.68,"speaker":"Mario Bagas","text":"Well, I mean, we have that from the sources, and I don't remember which one, but it tells you a lot. It tells you that both the saints was, in that moment, speaking directly with Christ, and it tells you that the emperor recognized it, and so did the other senators. So something very special is happening. It's why the world fell in on that city in the end, I believe. And one of the reasons why, at least, was for the preservation of Orthodoxy, because part of the problem that was always there for the Byzantines, I mean, the Church within that framework, both responded to challenges that the imperial court in Constantinople kind of exerted itself against the Church because there's always that risk that because of all this material wealth and everything else that would lead to pride, and that this city was, in fact, God's kingdom on earth. It reflected that kingdom. It initiated participation into that kingdom, which is what happens every time we go to liturgy. But it wasn't that kingdom, Christ's kingdom is ultimately beyond the world, manifested within the world, through his churches. Right. So that hubris was there. And the Byzantines were, let's say, pedagogically humble throughout their long history because of this hubris. And what we see at the very apex of the empire is the Church reaching its destination, let's say, and transmitting to the Orthodox Church throughout the next centuries, up until today, the treasures of Orthodoxy establishments finally dissolving heroically with the last emperor, Constantine Paleologos. He's one of those. We're talking just before the recording. He's one of those last emperors, you know, the marble king who will come back and. And all that kind of stuff. You know, all of this stuff has its antecedents in Constantinople. All of these myths about great final kings who will finally and decisively, let's say, become victorious over the enemies of God's people or of a particular nation, and then will transfer their kingdom to the king of all kings, Christ. That's all there in Byzantium. It goes all the way back to the apocalypse of Pseudo Methodius that you mentioned before."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2065.76,"end":2090.33,"speaker":"Jonathan Pageau","text":"Yeah, it's something that we. That we're right now kind of bringing back to the fore, I hope, with people. And people kind of understand that. Also this eschatology and this universal history which was there in Constantinople and this vision of the world. One of the things you told me before was your. One of the things that helped you see how important Constantinople was, was how you found it in Scandinavian writing."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2092.73,"end":2156.41,"speaker":"Mario Bagas","text":"Yeah. And it's just. I mean, what's it doing there? You know, I thought there's no way that. When was Snorri Sturluson, 13th century Scandinavian jarl and chronicler. Why would he have anything to do with Troy? You know, I never thought. Or Constantinople. So he's writing in his prose, Edda, about the beginnings of civilization. There's some Genesis there, you know, creation narrative. And he's mixed up Scandinavian, let's say, pagan mythology with. With emphatically, let's say, biblical motifs. And then he ends up speaking about Troy as the earliest, let's say, city where many of the heroes came from. And then Constantinople. What was the name of Constantinople in Scandinavian? Micklegard or something like that? I don't remember. But, you know, I mean, that. That kind of shocked me so that the influence of this city extended all the way up until to Scandinavia, which is not surprising given the Varangian presence in."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2157.37,"end":2174.97,"speaker":"Jonathan Pageau","text":"Yeah, exactly. That exchange that would have been happening between the. Between the prince of Kiev, the Varangians and then the Scandinavians. There would be this exchange of stories and information that would be happening amongst them. The medieval world was not as closed off as people want to portray it as at all."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2175.67,"end":2182.95,"speaker":"Mario Bagas","text":"Absolutely not. Absolutely not. And this connection with Troy is very interesting. I'm not sure if you're interested in exploring."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2182.95,"end":2241.82,"speaker":"Jonathan Pageau","text":"Oh, yeah, definitely. This is actually, this is where I was going to go next in our discussion because one of the elements that's important in terms of understanding Constantine is almost like this mythical figure is how he leaves Britain, which in legendarium was founded by a descendant of the Trojans. You know, these descendants of the Trojans is a Roman who are also descendants of the Trojans and then goes all the way with his mother Helen, all the way to Troy, basically. I mean, Constantinople isn't actually Troy, but it's basically Troy. Like where it is, it's in Anatolia, it's right where Troy would have. People would have understood Troy to have been a very long time ago. And so it kind of bridges all these worlds together, creates this Christian city which is the resolution of the whole Trojan arc from the time of Troy into this city which joins both the Christian and the pagan story together in this kind of amazing synthesis. So, I mean, that's kind of how I see it, but I don't know if you have some insight on that."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2242.3,"end":2375.88,"speaker":"Mario Bagas","text":"No, I think I never considered it in this reflexive manner. And that just puts it all together wonderfully. Jonathan. I mean, certainly we have. And I don't remember if it's Sozom and Socrates. It's One of those mid 5th century Byzantine historians, they say that Constantine considered Troy as the location of the founding of the city, but was told by God in a dream not to build a Troy. And that also in another scenario, considered one of those cities that made up the Troad, nexus of cities where Ajax killed himself, one of the heroes again from the Trojan Epic, but again, the association with suicide, he didn't want that, so he went to Byzantium. So that's picked up in the historiography of the time. But what Constantine does do, he links Constantinople to Troy via the Palladion Palladium, which according to Apollodorus, we know from his library, it was a statue of the goddess Pallas, who died in a kind of fight with Athena. Zeus, apparently, you know, as the myth goes, intervened. He imposed his aegis, his great shield, as the girls were fighting and Athena struck Pallas dead. And she didn't mean to. So being grieved for her she created a statue of Pallas, tied Zeus shield to it and venerated her. But then Zeus, at the time of Electra's violation, it says in the text, has to do with the myth concerning Electra, takes the Palladium and throws it to Earth. And it lands, according to this myth, on the place where Elis, son of Troas, will build Troy in honor of his father. So that's the myth concerning the Palladium in relation to the Greek context, that it lands on what will become the city of Troy. And of course, Ilium is a name of Troy, Troas is the dad, Ilus is the son, and you can call it either Troy or Ilium. It lands on this spot and Elus builds a city around this spot. And scholars have theorized it could have been a meteorite or something like that, that he built a temple around it."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2375.88,"end":2378.32,"speaker":"Jonathan Pageau","text":"And then so, you know, I hate scholars so much."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2380.24,"end":2382,"speaker":"Mario Bagas","text":"Sorry, it's besides the point. Right?"}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2382.16,"end":2384.4,"speaker":"Jonathan Pageau","text":"Yeah, exactly. My goodness. All right. Sorry."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2384.64,"end":2426.52,"speaker":"Mario Bagas","text":"No, no, no, no, not at all. And so, you know, I agree. But what happens next is that the. It becomes associated with the destiny of Troy when the city falls to the. To the Greeks, that Odysseus and Diomedes, they take the palladium out of the city and that's why it falls. So it's a stabilizing object and it's taken by them. By them or by Aeneas. It depends on the source to lavinium. Lavinium becomes the, let's say, antecedents for latium. Latium becomes eventually the background for Rome, and Rome is found in."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2426.52,"end":2437.2,"speaker":"Jonathan Pageau","text":"Wait, so the tradition of Aeneas taking the palladium, is that in the Greek sources or is that in the Latin source? Is that in the. In Virgil or was that even there before?"}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2437.84,"end":2512,"speaker":"Mario Bagas","text":"That's in Latin sources. Oh, yeah. I don't remember if it's in Virgil, but you'll find Cicero and others refer to it. Okay, so it's scattered in references regarding the description of the Palladium, because when it's taken to Rome, it is housed in the temple of the Vestal Virgins where the perennial fire is kept that symbolized Rome's permanence. So it's associated as an object that was meant to facilitate stability. Because it was that talismanic object in Troy, it's now helping to facilitate the stability of Rome, being placed right next to the perennial fire. And the sources again, various to what happens next. It's either lost where the temple burns. Is it the second century A.D. i'm not quite 191 A.D. i think it burns then. Was it lost then, wasn't it? We don't know. But it turns up again at Constantine's forum in Constantinople. And again the sources vary. Procopius says, oh, he was digging at the spot and there it was. You know, others say that he moved it there. He probably had one constructed, you know, purpose built for the occasion."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2512,"end":2515.96,"speaker":"Jonathan Pageau","text":"So this would actually have been like a big shield. Is that what did it look like?"}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2516.52,"end":2591.99,"speaker":"Mario Bagas","text":"So this is what it morphs into eventually. A statue of Athena holding a shield. Yeah. Okay. And you can see it. There's one in Athens, outside one of the museums in Athens. You can see like a modern replica. So it's basically a statue of Athena holding a shield and, and Pallas. Athena is one of the epithets, Pallas, one of the epithets of Athena, because after she kills Pallas, she takes on the name. So that's at the base of Constantine's Forum where that statue of him in the guise of Apollo is at the very base, the column is still there, of course, in modern day Istanbul. You can go and see it. So it was placed at the base of the forum. Again, stabilizing cosmic imagery, not necessarily for worship or for veneration. It's making a point. The point is Constantinople. If Rome was considered the successor of Troy, and that was part of, let's say, the Emperor Augustus's narrative for Rome, that we have this ancient pedigree going back to Troy and we're the descendants of heroes and we're better than the Greeks, basically. That's what Augustus was trying to say. Constantine is saying, well, I'm going to take it one up a notch. And it's Constantinople that is now the successor of both Rome and, and Troy. So you have this lineage. Yeah."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2592.23,"end":2709.36,"speaker":"Jonathan Pageau","text":"And one of, I mean people are struggling with that symbolism I can understand, but that type of symbolism continues on in the church, in this, in the, let's say, the architecture of the narthex or the understanding of the narthex or the place of the secular and the understanding of continuity within the church as being part of, let's say, the universality of the church. And so if we understand Christianity, this is something I keep harping on with people, that Christianity is ultimately non dual in its proposition that if we understand the man in which Christianity can encompass all things, then we need to have a hierarchy in how that happens. And the idea of using, for example, Spolia, of this idea of having of recap, of taking even these old statues of The Greek gods and having them kind of out in gardens and having them in the Forum, let's say, rather than in the church, can be understood also as this manifestation of this hierarchy of how everything is kind of contained together. But there is a clear hierarchy in what it is. Like you said, those statues weren't there to be venerated, to worship. They were there as a reminder and as a memory of how we are still a continuation of the past. Just like in churches, you'll find, often find the Greek philosophers that are represented in the narthex. It's a little, let's say it was refined with time like you would never in the church today find, like an image of a Greek God, let's say, in the narthex. But the idea of this kind of fully containing reality, where things are organized hierarchically, seems to be, at least this seems to me to be what Constantine was kind of aiming for. You know, he wouldn't have put his, his column of himself as Apollo in a church. He put it out in the Forum, which is a very different space in terms of understanding what its function is. And it connects into the people and to the history and to the past and all that."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2710.08,"end":2866.22,"speaker":"Mario Bagas","text":"I agree 100%. And look, I mean, nothing happens in a vacuum. Constantine was founding a new city. And an additional reason why the Apollo imagery was used is that city founding was tied up with solar worship going all the way back to Mesopotamia. That doesn't make Constantine and adept of the Sun God, he dropped solar imagery from all of his nomismata, his coins. By the 320s, it's all gone. But he can't found a city otherwise. It has to be done according to these prescriptions. It would have compromised his whole project if he had not, let's say, undertaken this, this kind of measure. And it has to be seen in relationship to everything else he's doing. And everything else he's doing is pro church. I mean, legislation, the councils, church building that we discussed. So. But, you know, I mean, there's no reason to be scandalized by it, I don't think. And I, I think what we see with Constantinople in, in particular, and I mention it in the book, is the beginnings of a museum like culture where these. Well, you still have pagans in the city, but you have Christians in the city as well. Constantine is a Christian, so he's bringing over this statuary. It's part of the Greco Roman inheritance. The statuary stays until the end of the empire when it becomes emphatically orthodox. It's looted by the Crusaders in 1204, Crusaders are ripping down Elizabeth statue of Hercules, a bronze one, and cutting it to pieces, which means it was there the 12, 900 years, and no one had a problem with it. You know, pagan texts were being taught in the curriculum, but not for their paganism, for their stories, for their artwork. You know, these texts were being read in a Christian way. They were being psychologized by, even by saints of the Church. We know that with St. Basil the Great in his address to the youth. So, you know, all of these things have their place in a taxonomy, in a hierarchy. You're 100% correct. They are part of the inheritance of this civilization. They can be used pedagogically. But within churches, what you have are images of Christ and his saints and whatever motifs look similar to pagan motifs within churches, because things were borrowed, their meaning is changed. You know, it's like the form might be similar, but the content is revolutionized in light of the Christ experience. It becomes very different. So this is something that in Orthodoxy at least, can be traced very easily because of this emphatic emphasis on explicit Christian imagery, iconography within the ecclesiastical space."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2866.46,"end":2943.47,"speaker":"Jonathan Pageau","text":"Yeah, and it's interesting because you have two narratives. Let's say there's the Protestant narrative, which wants to represent Orthodox Christianity, whether Catholic or Eastern Orthodox, as just being a massive syncretic effort where they just basically took the Roman gods and replace them with saints or whatever, and they just had all these Roman gods and everything. So you have this one narrative, then you have the other narrative, which is like the scholarly, the kind of weird, the more scholarly narrative, which is that Christians destroyed the temples, they burnt down everything. They wanted to destroy the ancient world and kind of get rid of it. So you have these weird two narratives that kind of coexist. The truth is that it's neither of those, and that's why these two can exist, is because it was more of a organic. This kind of organic hierarchy, like we're talking about. Where the ancient world was still. There was still, let's say, remembered at the level that it should be remembered, appreciated at the level that it could. And then. But then everything was kind of placed in a hierarchy where we would, you know, at the summit would always be Christ and his saints and, you know, the body. The body of Christ. And, you know, lower down, in the gardens and in the. In the parks, we could have these. These old statues that remind us of where we're from. And, you know, and it's kind of the old beauties of the ancient world that's right."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":2943.47,"end":3082.93,"speaker":"Mario Bagas","text":"And Christ the Pandocrator is the exemplification of that because he's the master of all, represented in domes that are meant to symbolize the cosmos. Within most churches in Constantinople, throughout the Orthodox world, that is our highest aspiration and yearning. That is what we believe, that Christ is the master of the universe. And his saints participate in that mastery of the universe by being endowed with his grace, by being able to do what he does by grace, and so on and so forth. And that's why they're represented in close proximity to him, first and foremost being his Holy Mother. That's where Byzantium ends up very early. Constantine sets up the parameters and they're filled in very quickly thereafter. I mean, in the 400s, you have Saint Bucheria building churches to the Mother of God everywhere. By the 450s, after the Third Ecumenical Council, you know, which debated the issue of the Theotokos, there are churches dedicated to popping up everywhere and again understood that she is the main intercessor to Christ our God. With every new controversy, new churches pop up, giving witness to the Christian worldview that Christ is at the center of it all. But that didn't mean that they couldn't appreciate a piece of literature or the art from the past. It was literally outside in the thoroughfares. So you'd walk down your colonnaded streets and there were your orators from ancient Greece, the statues. There were some of your heroes, like Hercules and others. But once he got to the imperial palace, you had the Halki Gate. And what was on top of the Halki gate, the bronze gate, Christ Bando Grato high above everything else, even the arrangement of the symbolism. You would never have a statue above a saint. You know, even in the public space, they would never do that. It was all kind of spatially arranged in such a way as to give preeminence to what their main meta narrative was, which is the Christian one, and to enjoy, honor, respect, whatever the stories of the past, which they also read for. I presume they read for enjoyment the way that we do, and also for moral benefit, even spiritual benefit. They're written from a Christian point of view. No problem with any of that."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3082.93,"end":3134.63,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And one of the things people always. This is also a strange deformation that has happened where people have this strange idea that all the traditional, the ancient Greek texts were preserved by the Muslims and that this was the main source of traditional texts back into the West. It's like, what a weird way of seeing where this is really like the Blind spot of Constantinople, obviously. Most of the texts, all the texts of Aristotle that were lost in the west, some of the texts of Plato and then other philosophers, they all came from Constantinople. That's where it's actually when Constantinople fell or during the darker times that the scholars were leaving the city, bringing the text with them in order to save them. And that's most of those texts, that's how they ended up in the West. Not coming from Spain, where some of them did come from Spain, but most of them came from Constantinople."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3134.95,"end":3171.59,"speaker":"Mario Bagas","text":"It's the big blind spot, as you say, it's the big blind spot. And this is something I harp on about because people are like, you know, you still get it again and again in the academy. You know, you Christians destroyed culture. No, we preserved it from the barbarian hordes coming from Germany and Scandinavia. It was preserved by Christian monks and copyists and scribes. This is demonstrable evidence. It's come out in the past century or so. It's no longer just a matter of conjecture or Christian apology. It's fact. Plato, Aristotle, Thucydides, Latin texts, they were all there in Byzantium."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3171.59,"end":3175.79,"speaker":"Jonathan Pageau","text":"Yeah. And the tragedies, all the tragedies, all the plays, they were all preserved in."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3175.79,"end":3208.88,"speaker":"Mario Bagas","text":"Constantinople to the point where some of the. In the middle Byzantine period, some authors are doing very strange things like writing weird plays based on these ancient texts. Like, you get the pontification of Claudius by Seneca influencing a text in Constantinople called the timarion in the 1100s, which is like the strangest text you'll ever read. Right. About this guy who dies at the festival of Saint Demetrios and Thessaloniki and goes to hell. Have you heard of this text?"}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3208.96,"end":3210.04,"speaker":"Jonathan Pageau","text":"No, I've never heard of this."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3210.04,"end":3211.2,"speaker":"Mario Bagas","text":"It's the most bizarre thing."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3211.2,"end":3211.92,"speaker":"Jonathan Pageau","text":"And you're reading it."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3212.68,"end":3230.68,"speaker":"Mario Bagas","text":"Where would they have gotten. Because it's a. I mean, if there's a syncretistic text, it's this one, Right? You had that element of Byzantium, but that element, that element was not the overarching narrative. That was on the level of subculture. So, you know, people were doing, you know, using occult texts and all these sorts of things. But that was always."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3230.68,"end":3260.05,"speaker":"Jonathan Pageau","text":"Yeah, well, the Hermetic texts were preserved in Constantinople, like a lot of people. It's just weird. Like, even some modern orthodox text are super like that. They're super aggressive against the occult. Like, I get it. You know, I get it. But they have this idea that the occult comes from the West. The cult doesn't come from the West. Those texts came from Constantinople. Jonathan and then they were translated. And that's what gave, you know, the, like 13th, 14th, and then Renaissance occultism came from Constantinople."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3260.05,"end":3346.61,"speaker":"Mario Bagas","text":"Guys, look, you're right. And I'll tell you what, it's almost as if the Byzantines were sitting on a powder keg that when it was transferred to the west in the Renaissance, because that's. Look, I mean, the Byzantines, not only did they play a large part in the Renaissance in the west, they basically sparked it. It was people like Plethon, all of these, they were neo pagans towards the end of the Empire. So before we spoke about the fact, and again, we should emphasize this fact, is that towards the end of the Byzantine Empire, Constantinople was preoccupied with orthodox spirituality and saw refinements in that spirituality, had more monks and soldiers and more nuns than married women to produce children. And that's why the empire fell. But, you know, all these people participated in God's kingdom. So, you know, it's this kind of tragic glory. That's, that's mainly what's happening. But you had renegades amongst them, and they were not really respected as intellectuals, but they weren't really seen as representative of the Byzantine mentality, the Orthodox Roman mentality. They went to the west, they were hired by the Medici and taught in their schools. And one of those figures is Python. He took his library with him. And that's how all of this strange Renaissance occultism began. It's because that powder keg which the Byzantines knew how to handle, they didn't know how to handle it in Italy and West at the time."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3347.17,"end":3400.63,"speaker":"Jonathan Pageau","text":"Yeah, but it was that kind of organic hierarchy that was there where, you know, because people have this idea that Christians, you know, immediately will just stamp out anything which is a little odd or a little on the margins, but rather, if you have a stable hierarchy, intellectual hierarchy, then you're actually able to tolerate some weird stuff on the edge, as long as it stays on the edge, like, as long as that weirdo doesn't, like, stand up at the altar and start reading his weirdo stuff, then it's like, okay, you do your thing. Like, just don't, don't come and bother the actual normal hierarchy of being that we're participating in. If you want to be on the fringe and do your fringe thing, go ahead, but don't bother us. But like you said, when it arrived in the west, as if there was already a revolutionary thing that was set up, there was already a revolutionary thinking that had kind of been fomenting, and so it fed it in a different way. Let's say."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3400.87,"end":3516.42,"speaker":"Mario Bagas","text":"Yes, I think that's a good way of putting it, and I heard it once from Marc or I read it somewhere that in relation to witches, you know, the Byzantines had their foolish old women that they just kind of ignored. The west had its devil worshipping witches that it burnt at the stake. Very different approach, very different kind of. But you're 100% right that the Byzantines, you know, unless that person was a Johnny Talos or a Michael Psellos trying to shape the minds of the people in such a way that was anti Christian, anti Christic would compromise the salvation of people, then they were kind of tolerated to exist on the margins, on the, on the periphery. And this is not. While discussing this with you, we're not legitimizing these texts at all that are in them. We're just talking about a reality, a reality that points towards the soberness of the Orthodox Christian Byzantines centered in that city. You know, another thing, and this goes back, I hope you don't mind, I'm jumping back to our conversation about Christian and pagan imagery in the public space. This is something that persists to this day, this hierarchy and this, let's say, division between, you know, it's in Orthodox countries today, in, within the churches, icons are venerated. Outside of the churches they will build statues of saints, but you don't see them in the churches, you know, and statues of, let's say heroic figures that are venerated, nationalistically tied up, that nation's, let's say, defense of the faith. You see this in Russia, you see it in Romania, you see it in Greece. You know, you'll get your statue of Constantine Pallogos outside of the church, but not within the church. Within the church. That's where we know that the, the God revealed art form of iconography is. And that we legitimately venerate. Yeah, that space outside, you know, they depict all sorts of things."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3516.42,"end":3554.08,"speaker":"Jonathan Pageau","text":"And there's, there's an interesting, in Russia there's an interesting almost natural hierarchy which is setting itself up right now into this renewal of Orthodoxy. Exactly what you're saying, where we're not going to totally reject the romantic. All of these movements where, which you know, did lead towards the end or the breakdown of Orthodox. We're not going to reject them, we're just going to have them in their place. So in the church we have, like you said, we have these icons, but then the statues, we have romantic and a neorealistic statues outside and it creates this kind of powerful, this more natural Hierarchy of being that that was probably similar in Constantinople."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3554.08,"end":3595.32,"speaker":"Mario Bagas","text":"Well, it's very similar to what was in Constantinople. I mean, you see it in Greece. You see it in Russia. My wife is Russian, so we've been. A few times. We've seen it there. It's a Byzantine thing. You know, it's throughout the Balkans, Romania, Bulgaria, Serbia, they do this. They. They will kind of keep the good from the past outside, you know, there might be military heroes, it might be, you know, mythical figures or motifs, but it's just not in the church. The church is a different space. It's. It's the sacred space. And that transition between the secular and the sacred is made clear the moment you enter into the narthex, you know, which is that liminal space, let's say, before you. You go into the night."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3595.72,"end":3620.67,"speaker":"Jonathan Pageau","text":"All right, look, look, we've been going for a while. I really enjoying this conversation. And so, everybody, I will. I will recommend that you check out Mario's book. Let me put it up so you can see it. You can find it on Amazon. You know, it's. It's available. And so thank you so much for, for your time. I hope this will spark people's interest and their fascination with Constantinople as this mythical Christian city."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3621.23,"end":3624.39,"speaker":"Mario Bagas","text":"My gratitude to you, Jonathan. Christ is risen. Thank you so much."}
{"episode_id":"SW - #164 - 2021-07-02 - Dr. Mario Baghos - The Mythical Constantinople","start":3624.39,"end":3695.98,"speaker":"Jonathan Pageau","text":"Indeed, he has risen. All right, everybody, so. So thanks for your attention, and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
