{"episode_id":"SW - #045 - 2019-07-24 - Christmas as the Anchor of Reality","start":0.64,"end":94.09,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I will be playing for you a discussion on the Nativity icon that is the icon of Christmas. I know that it is very strange to post this in the middle of the year, but as you might have noticed, I am trying to catch up with the videos that I've done in this podcast form. And hopefully within a few months, we will reach a point where the videos and the podcast will be coming out at the same time so that we don't have this lag, but not, nonetheless, the discussion on the birth of Christ and on Nativity is one which doesn't only have importance around the time of Christmas, but is really important to understand how reality works, how the Logos manifests itself in the world and ultimately in the person of Christ. And so this discussion was given at St. George Antiochian Church in Montreal. If you would like to get an image of the Nativity icon, you can always Google that. But then you can also check out the video on YouTube itself so that you can see the image as well. As, you know, this podcast and everything I'm doing online is really done. Thanks to all your support through crowdfunding. And so please check out the symbolicworld.com for ways that you can support my efforts online. And so I hope you enjoy this. Thanks a lot. This is Jonathan Pageau. Welcome to the Symbolic World."}
{"episode_id":"SW - #045 - 2019-07-24 - Christmas as the Anchor of Reality","start":104.49,"end":1974.28,"speaker":"Jonathan Pageau","text":"So tonight, for those who don't know, maybe who I am, my job, I'm an icon carver, which is a bit strange for some people. There aren't that many icon covers actually. Probably. There's probably in America, like one. I think maybe two. Maybe there may be two. There are more in Greece. There are more in Russia, obviously. But it's not something that is very useful. Very. I hope it's useful. Not something that's very usual. Hope that wasn't a little Freudian slip there. It's not very usual. And as I discovered traditional art and Orthodox art, you know, learning my own skill, but also exploring the icons themselves and their symbolism and the relationships between the icons and scripture and the liturgy and the architecture, and really discovering this beautiful pattern that we have in our faith that's been passed down and kept for thousands of years now, it's something that I find a lot of joy in. And so one of the things I'm also doing is I'm. I'm on making YouTube videos, and I talk about some of this stuff. I talk about iconography, but also how the traditional symbolism that we have in our liturgy and our icons in scripture, how it actually connects to everyday life and especially how. This is what I'm going to try to show you tonight, that the icon of the Nativity, it's not just an image of a moment in history when a young child was born, but it's actually an image of reality. It's an image which shows us how reality lays itself out for us. And so hopefully we'll be able to go through the icon and I'll be able to show you how profound our faith is and how profound these images are. These images. Obviously, the problem with a lot of these images is that we come to take them for granted. Obviously, we've seen them so much that they kind of go into the background of our minds, but it's always good to go back into them and, let's say, reawaken our sensitivity to see what's really going on in some of these images. Now, I wanted to start with this, just because this is where we're going. Everybody knows it's November. We're going towards this. Going towards this. This kind of crazy excess of everything for the holidays. This. This. This celebration. The. The bells, the velvet, the. The gold and all of that. And we're used to it. We see it happen every year. But we, as Orthodox Christians, we have this fast here. It's. It's obviously quite a contrast as we're watching everybody partying around us, that we have this fast. It's. I have to admit that it's a much harder fast to follow than Lent because it's just a lot harder because there's so much going on, everybody celebrating. But I think we can at least look at. Why would we have a fast? What is it that we're preparing for? Because that's the point of the fast, that's the point of Lent, and that's also the point of this fast. What is it that we're preparing for? What's the. Why is it such a big deal for this notion of the Nativity or the Incarnation? You know, we always have, as Christians, most of us, we always have this trope where we say, like, what's the real. You know, we have Christmas, we celebrate, we give gifts, we have all that. We have Santa, we have everything. We ask, like, what's the real reason for Christmas? And we all have the answer, right? It's the birth of Christ. That's the answer. But we need to go more into it. What's. Why is it such a big deal? And in the icon of the Nativity, we can see with our eyes the way that the icon is made why that's such a big deal, how it shows us this. So. So I put in. I put in one, one of the icons that I've carved, just so you can see for those who haven't seen my work, But. So everybody knows the icon of the Nativity. Does everybody understand what's happening? Maybe I'll go through the elements of the icon just so that people kind of understand what. What's going on first. Because it is a complicated icon for a feast. So we have the mother of God in the center who's lying down on a mat. She's resting after having given birth. We have, of course, Christ, the. The Christ child who's laying down in the manger. Surrounding him is the ass and the ox. By the way, the ass and the ox is one of the oldest elements of the Nativity. It doesn't say in Scripture that there's an ass and an ox specifically, but it is one of the oldest elements. In the first images we have where we see Christ in a manger, we see the ass and the ox. There's some images from the 3rd century where you just see a manger with Christ and an ass and an ox on each side. We'll get to why that's important. It's very important. We have the three wise men who are coming to encounter Christ. Here we have a shepherd who is blowing his horn, celebrating at the top, we have the three angels that are announcing the birth of Christ. Here that you can see it in this one. Can you see what it is? Everybody see? Right? That's a star. And above the star is a glory. So different ways of showing it, but it's a glory which shows us in a symbolic manner, the presence of God. Now down below, we have two scenes. We have. We'll start here. We have the washing of the Christ child, and we have St. Joseph who is being tempted by a shepherd devil. So those are the canonical images, the canonical elements of the icon is there. Before I start explaining some of the elements, are there some things that you've never seen or that you're surprised to hear of? Like when I said Joseph being tempted by a devil, I saw a few people sneering in the audience. Is that possible? Does everybody know that story? Okay, so in the tradition, there is a story which talks about it comes from the proto evangelium of James, which is the book out of which most of our traditions for the Mother of God and for the Nativity come from outside of the Bible. And in that book, you have this scene where Joseph is Not permitted to be there when. When the mother of God gives birth. Imagine we're so used to our modern way of thinking with the dad, you know, in the hospital with the. With the doctor. But that is not the traditional way that a woman would have given birth. A woman would give birth with. What's the word in English? Midwives. There you go. Sorry, my French is going to come back. So, with midwives. And so Joseph was told to. To leave the place where Christ is born. And so then he's mulling over in his mind, and he's thinking, like, is this really possible? Is this for real? He knows he's not the father, and so he's wondering, is this the real deal? Is this really the birth from a virgin? And it's this devil figure who is tempting him and who's saying, like, who's asking him questions, getting him to wonder whether or not this is actually possible. And then the midwives are the ones who are here washing the Christ child. So those are the basic elements. As for the ass and the ox, that is also a very, very ancient tradition. Also, the other tradition, which is quite old, is the fact that Christ was born in a cave. Now that in scripture is. It doesn't say that. The only thing it says in scripture is that Christ was laid in a manger, which means that Christ was laid in a food trough for animals. That's what a manger is. Sometimes we forget a manger is basically a food trough for animals. And so it doesn't say that he was born in a stable or born. Like, we know we have these little images of nativities with Christ in the little stable. But the tradition from very early, from the first century, we have in St. Justin Martyr that talks about how Christ was born in a cave, okay? So those are the basic elements of the icon. And the way they're laid out, first of all, can help us understand something about iconography, which is. Icons are not snapshots. They're not just someone who would come on an event and just take a picture of something that's going on. Because all of these events are happening at different times. The. The. And different places, right? The wise men were in the east when they saw the star. And when they arrived at the place where Christ was, it was like a year later, Several. Several months later, okay? And then here's the mother of God giving birth. But then here's Christ here, and then here's Christ here again being washed. And so what the icon does is it compresses things together. It takes These different elements of the story, and it brings them into one place where you can see things in their meaning. You could say how all these elements in the story come together and participate in the meaning. And so it can give us a different sense of what these things mean and how they come together. So what you see, for example, in the icon, you. You see it quite clearly. You see this joining of these kind of, you could say these wild opposites. You have these angels up above, right? You have this kind of demonic figure there below. You have these wise men who are from very, very far away and who are probably an elite nobles. In the west, they were considered kings, we say the three wise Kings. And so they're the elite, but they're also from far away. And then you have these homely shepherds who are just the guys next door who are participating in this event. And so look at how the icon is actually brought together, right? The whole thing is like a bullseye, right? It's this concentric, this concentric structure. You have something going on in the middle which brings together everything from everything that's around it. And that already starts to tell us a little bit of the mystery of what it is that's happening in that moment, what it is that's going on. What is this Christ child? What is he for us? And the first thing that we can see is that he's bringing together all these opposites. You could say something like he's gathering together, you know, all of creation, all of everything, gathering it together into himself. And once you start to see that, then you start to understand. Also, when I told you about the ass and the ox, this is a little bit more kind of esoteric, but just bear with me, you'll see how it makes sense. The ass and the ox relate to Old Testament laws. So there were foods in the Old Testament which people could eat. Today, Jews call it kosher food. And there are some foods that people couldn't eat. They were impure foods. Now the ox is a pure food, and the ass or the donkey is an impure food. You're not allowed to eat donkeys. So because of that, the donkey becomes. Becomes in the symbolism, an image for us, actually most of us. I don't know if. Are there any Jews here? Maybe not, but for all the. All the nations, let's say all those that aren't Jewish. And you read in the church fathers, they talk about this ass and this ox as. And there's a law in the Old Testament which says you cannot yoke an ass and an Ox together if you're going to plow. So it's like, that's a very strange law for people. You know, especially for kind of atheist types. They always like that. They want to make fun of the Bible. They'll say, here's this crazy law which says that you can't yoke an ass and an ox together. But what it meant is, exactly, is what I told you is that you cannot bring together the outside and the inside. You cannot join with the foreigners. You. You cannot mix the pure and the impure. But Christ brings us a different vision of the world, brings us a different reality, where in fact, he does. I would say Christ is the only one who's allowed to break that law because he does, in fact, bring the ass and the ox together. And he does it, and we see it happen in this icon. And so the ass and the ox become this image of how the Jews and the Gentiles are going to join together. And the church will be born out of that, out of that union. And I'm not making this stuff up, by the way. You can read. I don't have the quotes, but in the church Fathers, they explicitly talk about this symbolism. Now, the other kind of, let's say, strange element or important element is the cave. So why does Christ have to be born in a cave? One of the secrets to kind of understanding why Christ has to be born in a cave is if you look at the manger. So look at the manger. What does it look like? Sorry, yes, that's exactly what it looks like. And so the manger is already a tomb. And so this descent into the cave, this image of Christ being born in a cave is already showing us what the whole story is about. What the whole story is about, which is it is already this descent into death. And the descent into death appears, you know, we symbolize the imagery of the. Of the manger as a tomb, but the manger itself is already an image of that. This idea of descending down into animality, descending down into the place of animals. That is the state of the fall itself. Right? When Adam and Eve fell in the garden, God gave them these garments of animal skins to cover them. And so this idea of descending into the place of the animal is this descent into death. And the early Christians knew that very, very well. They would actually create images which would link all of those things together. A good example here in the. These are images taken from the catacombs. So these are images taken from, literally from the graves of Christians. And so what do they represent in the space of death. They represent something which is akin to what we saw. That is these three images. This is. Can anybody guess what that image of is of up there? Yeah, it's Noah's Ark. It's very strange. Noah's Ark, but that's Noah's Ark. You can tell because you see he's got a bird and he's got this giant box floating in water. Who can guess what this one is? Yes, Jonah. And then this one you can read. His name is written. So it's not that hard. So there's Daniel in the lion's den. So there are three images, three images from the Old Testament which help us see what it is that's going on. This descent into death, this descent into a cave, this descent into the place of animals, into. Into the animal existence, you could say, which is that existence of death. And so the image of Christ, it's. You know, and I. And I talk about that, and I feel like maybe I'm actually ruining Christmas for you because. Because Christmas, whenever we celebrate. And it's fine. We should celebrate Christmas. We should. But in our icon, we have a reminder of something which is far more austere, something which is far more serious than just this kind of celebration of the birth of a child. There are other images of Christ, other icons of Christ which happen underground, you would say. And we've got two of them. One is this one. Everybody know what this is, right? The baptism of Christ. And the other. I'll show. I'll show it later. The other is the anastasis, which is Christ descending into death. Those two images happened underground. And those two images are also images of. Of Christ descending into death. So you have this, like, repeated pattern from the nativity of Christ descending into death. And then the. The. The. The. The baptism of Christ and the anastasis here. In this version of the anastasis of the. Of the baptism, he's actually standing on the doors of death, just like in the icon of the Resurrection. So in the icon of the Resurrection, here's another one of my carvings, if you want to know. Another one of the Resurrection. In the icon of the Resurrection, you see Christ standing on the doors of death. All right, so why is it. I'm telling you that this is an image of reality? This icon is actually a picture of how the world works. Why is that so? Well, there are a few things. This idea of the Christ child, God told. Gabriel told Saint Gabriel told the mother of God to name her child Emmanuel. And what does Emmanuel mean? Yes, God with us or God in us. Right? So it is, it is both. This descent of Christ into the cave is, of course, this descent of the origin of the universe is into the world. And in a way, it's like this, this, this story obviously is a total scandal. You can understand why people rejected it. It is a crazy story. It is a crazy story to say that God, that the Logos, that the divine Logos which created the world, would become a person, would enter into the world and reveal himself in this specific moment, you know, in history. And you think it is an insanely crazy story, but at the same time, it's not a scandal because what it's showing us, it's showing us how reality actually works. It's showing us the mystery that St. Paul announced. St. Paul talked to us about. What is this mystery of the Incarnation? And he says that Christ has revealed to us the mystery that was hidden from for all ages and generation, but is now revealed to his saints. And what is this mystery? It is Christ in you. The hope of glory. We say as orthodox people, and we repeat it all the time, we say God became man so that man could become God. That is, Christ is revealing us the manner in which the world actually exists. Everything in the world. And when I say. And when you say Christ in you, it's not just Christ in you, but Christ in everything. Christ in the world. God is hidden in the world, just like Christ is born hidden in this cave. God is. Of course, there are difference of levels here. We have to be careful. I'm not saying that the whole world is the Incarnation, but the Incarnation is showing us how God is hiding in the world and is hiding behind phenomena. And in fact, without, without this divine spark or this child, this invisible thing which is hidden inside all phenomena, the world doesn't exist. And I'm saying this like I'm saying this very technically. I'm not saying it in a way that, that is just. I'm not just pouting this off. The world is actually. The world is made of too much stuff. Everything in the world scatters into details. Why is it that this microphone. How is it that you say that it's a microphone? Why don't you see all its parts without, without seeing that it's one thing. There's something about the world, the way the world works, which, which makes the world come together into unity. And that's for anything, any object, anything in the world. Everything has multiple, multiple, multiple parts, an indefinite infinite amount of parts. Why, how is it that we can say that some things exist and you hear like, people kind of talking. The people say that, like, it's all just a quantum flux, right? It's all just flux. Nothing is actually real. If you take the microphone, you could say, this is a wire and it's a mesh of steel and it's black paint and it's white paint. And I could keep going and keep going and keep going. I could describe the microphone forever without ever saying that it's a microphone. How is it that I can see that it is something. And it's a mystery. We can't totally know exactly how it works. But what we do know is that that is the ontology that we are living in. That is the worldview that the orthodox Christian lives in. Saint Maximus the Confessor talks about this explicitly. He talks about how hidden in the world are these purposes, these hidden kernels that bring things together, that make us. Make us actually make the world exist. And so when we see Christ coming down into this cave, hidden in the world, it is an image of how the world exists. And when we see St. Joseph there, doubting and asking himself, is this. Is this possible? Is this possible that someone can be born of a virgin? What is he asking? He's asking a huge question. He's asking the question. He's asking, how is it possible for there for something to come out of nothing? How is it possible for this union between the spiritual and the physical to happen? How is it possible that we. That the world exists? Ultimately, that is what he's asking. When we talk of the Mother of God, we use certain terms which are very, very strong to help us understand this mystery. We say that Christ, that she. That she. How do we say it? That her womb contained that him who the world could not contain or the cosmos cannot contain. And so she contained in her womb the that which could not be contained. And it is a pointing right. It is a pointing to the mystery right there. Even from the beginning of Scripture. It is linking us to that beginning of scripture of this primordial. Primordial earth. And then you see the Word come down and the word of God which manifests the world out of this primordial waters. This image is helping us see what the mystery is about. And you see that ray of light coming down, that star that comes down. It's not arbitrary that they showed it like this ray of light which comes down and points and points to this hidden kernel, this hidden reason why the world exists, this hidden reason why things exist. So I think what's important. I mean, what's important is there are a Few things that are important. One is to understand what it is that we're celebrating and to understand especially that we have, we've been, in a certain ways, we've been ruined by the modern world. We've been told that as Christians, we believe these things and these things are arbitrary, that here it is, you know, I. There are these things that I believe and they're somewhat arbitrary, and here it is that I believe them. But that is not the case. What we believe our faith is real. It is the things that we, that it talks about, the things that it manifests to us. It manifests what's really the mysteries of how the world exists. Because the question that, that, that St. Joseph is asking himself, that's the question that the atheist asks himself too, about the entire cosmos. How is it possible? Why is there something rather than nothing? And you, you can hear, you can hear. The physicians, the physicists ask that today. It's like they say the Big Bang. It's like, why is there something, how did something come out of nothing? Those questions, those questions are being asked today. And the incarnation is obviously to be careful. I'm not saying that this is all the same thing, right? I'm trying to help you show that the Incarnation of Christ brings us into the very manner in which the world exists and anchors us to a way that we can understand, but not just understand, but participate in how the world exists. And so what I would like to suggest is that that is what we are preparing for. And you know, it's not totally arbitrary. The fact that Christmas Nativity comes at around the time of the solstice. You know, I don't think that it's purposeful in the sense that a lot of people think that somehow Christians just took over the pagan holidays. Actually, I don't think that that's how it happened. But it isn't also arbitrary because that's the, that's this in the time of the solstice is what happens this secret mystery too. You can imagine it's hard now because we live in the city and we have lights and everything, but we can imagine the sun going down and down and down and down. And, and there's this darkness which is rising and rising and rising. And you think, and you wonder, you think, how far is it going to go? Is the sun going to vanish? Is the sun going to go away? Is it going to end? Is this going to finish? And then in that secret place, as the sun is at his lowest point, in that secret place is where the sun is born again. And we don't see it right away. Right? It's a mystery. We don't see it until mid January. We don't realize that the days are getting longer. And again, that image, it's the same image as what we're seeing here. Here's the light which comes down and manifests itself in the secret place, in this hidden spark which is there and which will grow and start to reveal itself. And then. And then, you know, and we'll go all the way into to Pascha, to the final kind of glorious manifestation of what was already started here. It was already intimated in the very story of the birth of our Lord. So that is what I want to encourage you today, mostly to kind of understand how important it is. And also in the Orthodox faith, we have kept what I believe to be the most complete and the most profound understanding and version of this. In our hymns, in our icons, in our liturgy, and in the writings of the Fathers, we have kept the most profound version of this. And so we do have an answer to, you know, the crazy commodification of Christmas. And this is our answer. And we know how deep it goes. It goes to the bottom of the world. So thank you very much."}
{"episode_id":"SW - #045 - 2019-07-24 - Christmas as the Anchor of Reality","start":1980.6,"end":2036.5,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageau videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat. And I try to have a more connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
