{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":0.32,"end":46.99,"speaker":"Fr Bogdan Bucur","text":"Post factum, after the moment of grasping Christ, they said, weren't our hearts burning within us? He was speaking to us on the road, opening the Scriptures to us. Just as he opened the eyes, he opened the Scriptures. But this tells us that something has been happening all along and he's been working on them, unbeknownst to them. To me, this is absolutely fascinating because you have to assume that if Christ is in that state of intense luminosity, imperceptible to their eyes, that this working in them, this fire burning in them, is of the same kind. And this is in fact, how the early Christian tradition reads it."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":58.43,"end":59.95,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":60.35,"end":62.09,"speaker":"Announcer","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":72.09,"end":115.92,"speaker":"Jonathan Pageau","text":"So, hello, everyone. Christ is risen. We are still in bright week, and we thought it would be a wonderful moment to look at the story of the road to Emmaus. And I'm very pleased to be with Father Bogdan. Father Bogdan Bukur. I'm not sure if that's how you pronounce your last name. I'm sorry. And Father Bogdan teaches patristics at St. Vladimir's Seminary, and he really suggested that we might look at the story of the road to Emmaus to help us understand, you know, understand or turn around the mystery of the resurrected Christ, kind of understand how the church fathers, especially St. Ephrem the Syrian and fathers like him, interpret scripture and what it means for us today as we encounter the world around us. So, Father Bogdan, thanks for talking to me. I'm happy to meet you."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":116.53,"end":119.01,"speaker":"Fr Bogdan Bucur","text":"Thank you very much for having me. Very excited about this."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":119.17,"end":166.44,"speaker":"Jonathan Pageau","text":"And so the story of the road to Emmaus is one of the very strange stories in Scripture. And I've pointed it often, I pointed at it often with people who kind of asked me, you know, what does the Resurrection look like? When someone says, when someone kind of takes for granted that the resurrection is just a dead body sitting up in the grave and walking out, I say, well, there's stories in Scripture that tend to want to imply that there's much more going on. And the story of the disciples meeting Christ, of the road to Emmaus is definitely one of them, because they don't recognize him. Then he kind of. Then they recognize him, and then it's communion and it's all these things kind of coming together in the story. So tell us a little bit about your own thoughts on this very particular story in Scripture."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":167,"end":360.89,"speaker":"Fr Bogdan Bucur","text":"Well, I'm fascinated by it. Like all of us, this is one of the stories that we read cyclically at matins, at the morning service, on Sundays, in The Orthodox Church. And we all read it Orthodox and non Orthodox Christians or non Christians, as we read Scripture. And it always fails to be, how should I put it? Open to interpret. I mean, it is open interpretation, but fails to be cracked. That always remains mysterious, as you said, as the two disciples are leaving and you have to wonder, why are they leaving? Why are they leaving? And the others are staying behind. So I suppose they've had it. They can't deal with this anymore. They're grieving. And at the same time they must have been very disappointed because at some point they explain that they thought this might be a prophet. They thought he might even be the Messiah. And clearly they no longer do. These are disciples who leave the community, who leave the disciples. They leave the center Jerusalem and move away. And it's suddenly they're there with Jesus himself. And they have no idea that. The first thing is, how is it that they walk and talk with Jesus for some three hours from Jerusalem, walking to Emmaus, and not only do they have no idea that it is Jesus, they even lecture Jesus about Jesus later. You don't know what happened. And they talk down to him. You're the only stranger who has no clue about all these things that have happened. Even they even give him a sort of primer on Christology, which is a faulty Christology. Basically, he could have been the Messiah, but it wasn't. And so that's the first thing. How is it that they don't. They don't understand. Secondly, how is it that after talking down to him for a while, they start to listen and then they become so fascinated, let's say, by him that they don't want to part. And they ask him and urge him to stay with them, and they defer to him. He is the one who actually presides at the meal that they want to have with him. And somehow suddenly their eyes are opened, whatever that means. Because earlier it said their eyes were held from recognizing him. That's also mysterious. You know who was holding their eyes? Their own weakness. God, Satan, Something else. And suddenly now their eyes are opened in the breaking of the bread, as he performs this, their eyes are open, fine, but then he disappears. And so now, again, mysterious, why does he vanish? And does he go away? Does he not go away? Does he go away from their sight? Or does he remove himself? What does that mean? And they return. Why do they return now with much greater energy and with the proclamation of the resurrection? So this entire story, I find, even though I don't think we're going to Understand it fully. Maybe that's the whole point. These are things. I mean, the resurrection is something that is somehow already, but not yet."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":361.29,"end":361.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":361.93,"end":368.41,"speaker":"Fr Bogdan Bucur","text":"This interim, this tension is itself what we. Where we are. That's why I like it."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":368.65,"end":467.79,"speaker":"Jonathan Pageau","text":"Yeah. And there's something, I think that in order to understand it, the way that I would tend to approach it would be to look at the other stories that are parallel to this one. And so you have the story, of course, of St. Mary Magdalene, who has a similar interaction with the risen Christ. But then I think this also goes all the way to Pentecost in terms of a pattern, which is the pattern of the disciples that don't know what's going on, that are. That are sad, that are, you know, they're hiding. There's something. And then there's a revelation. They receive a revelation which makes them understand what this was all about, let's say, from. From the outset. And I think that, you know, I think you also see that in the story of doubting Thomas as well. There's something of that as well, where Thomas doubts he doesn't know. And then there's a revelation which reveals the risen Christ to him. So it seems that the pattern is there. The road to Emmaus is very striking because of the way it's patterned, but it seems to be all going. All. All of this goes together. And the talking to strangers, I think, is important because it's there also in the story of Pentecost that is moving away from the center, kind of forgetting or not knowing the reason anymore, not understanding the reason for why we were together, what we were doing, and suddenly discovering it as a surprise in the strange world. Like the fish. The story of the fish in Scripture has something to do with that. Or St. Peter finding the gold coin in the fish's mouth, like moving out towards the ocean and suddenly being surprised by revelation. There seems to be all of that kind of going on in this particular story."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":468.03,"end":579.76,"speaker":"Fr Bogdan Bucur","text":"This is just a frame of. The story is a story of conversion, literally, of turning around because they move away and then they return. They. And then the community of disciples, and they return as disciples, in fact, as better disciples than the ones who had not left. Perhaps these are more honest disciples. Honest. Honest with their. With their doubts, with their grief. So when they return, they return as bearing good news to the. To the ones that remain. That's a wonderful story also, in which you can see how Christ deals with these people because he doesn't mind going in the wrong direction, apparently away from Jerusalem in order to gain them in order to be able to return them. So it's a large, long loop, really, that he doesn't mind taking with them. And incidentally, another story, let's say, that connects with this is in the Gospel of Mark. Specialists call it long longer ending of Mark. It's an addition to the Gospel of Mark in which somebody who must have had access to the Gospel of Luke says two of them were walking in the countryside and they met him. He walked with them in another form. And this is one, perhaps the earliest attempt to interpret all these mysteries or give some kind of a key what this, what this in another form might mean perhaps remain. I mean, I suppose it's to do with a connection between the resurrection appearance of Christ and what Saint Luca told us about the transfiguration, because he's the only one who speaks about a different appearance, a different form. It is very mysterious."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":580.48,"end":631.27,"speaker":"Jonathan Pageau","text":"Yeah, that's an interesting. It's an interesting idea. There's something also which is fascinating when I think about it iconographically, the idea of encountering Christ in a different form. It's something that to a certain extent this is going to sound strange because we take it so much for granted that it's actually going to be hard to think about. But the way that we represent Christ in icons is actually as a Roman nobleman. That's how we represent Christ. We don't represent Christ as a first century rabbi or teacher. There is something even in our iconographic representation of Christ which is something of the stranger that is there is in the way we show it. Show him that he is. That he is something of that stranger that you encounter the surprise of the encounter of something which is not. Which is not in its original form. And so we're so used to it that we don't think about it. But."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":631.27,"end":633.43,"speaker":"Fr Bogdan Bucur","text":"Yeah. Do you mind if I show you an image?"}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":633.59,"end":634.31,"speaker":"Jonathan Pageau","text":"Yes, go ahead."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":634.31,"end":661.79,"speaker":"Fr Bogdan Bucur","text":"What you thought over it? This is an image that I actually saw on Mount Athos in Caries. So this is this image of Christ in another form. As you can see, he doesn't look like the Christ we know in most icons, I think. And the whole point, I mean, I don't find anything peculiar except that it doesn't look like him. But maybe that's the entire point."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":662.99,"end":665.87,"speaker":"Jonathan Pageau","text":"What is the context of this image? Where is it?"}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":666.67,"end":755.93,"speaker":"Fr Bogdan Bucur","text":"In the prothesis over the table of oblation, where the gifts are prepared in church. And it doesn't have any kind of prominence there. I was fascinated to find it there. This is not my photograph. I found a better one online Stole it from there. But this is the only image I know of in which you would have something special. Otherwise, I've seen Christ and the two disciples on the road, and there's nothing but peculiar about it. But since you mentioned Mary Magdalene in the garden, how about this one? Because it seems to me, leaving aside the iconographic technique or the painting technique, you can tell us something about this. But as far as I can see, one obvious element, interpretive element here is that even though we are not told, not in the story of Emmaus, not in the story of Mary Magdalene meeting Christ in the garden, not we were not told that Christ is luminous, or if he's luminous, it's not the kind of luminosity that would have been perceived by them. I can say a few things about that in a moment. But in the icon he is rendered. Or this isn't really an icon anymore, this is an in between, right? Yeah, Renaissance painting. But here he is luminous. And in fact, that's what strikes me. How should we paint this? How should we render it?"}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":756.65,"end":800.28,"speaker":"Jonathan Pageau","text":"And I think there seems to be definitely a reference to the transfiguration in the way that Christ is represented here, because this is usually the way that we think of Christ and the transfiguration as being luminous. And so relating the resurrection to the transfiguration is obviously not a very big leap. It's not something that is. It's something that intuitively seems to connect quite easily. And so it seems that that's. And. But there's also something so mysterious about that moment when Christ, what is he saying? And he's saying, don't touch me, because not yet. It's like, not yet. I'm not yet. And it's not totally clear what that implies."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":800.92,"end":887.14,"speaker":"Fr Bogdan Bucur","text":"Well, on the road to Emmaus, it's different because he allows himself to be. To be interacted with. And yet there is a veil. St. Luke says their eyes were held so that they would not recognize him. And some have suggested, well, maybe their own problems, their own sinfulness may be Satan. But usually this way of phrasing things in Scripture is hinting at an act of God. God holding their eyes so that they would not be overwhelmed. Maybe they are not in a position in a state that would allow them to understand more than they do. And it takes a journey, and it takes Christ. It says that he's interpreting to them in all the Scriptures, but we're not told which scriptures or the Scriptures or the things about himself. That remains also somewhat ambiguous. And their eyes are not open then. But it takes the completion of the journey, the meal, the breaking of the bread. And then everything suddenly comes together and then their eyes were opened again. It's in this passive that hints at God opening their eyes just as God had kept them from recognizing him and they knew Him. But they cannot sustain this vision. Just as a parallel. I think you and I must have the same experience that Pascha is."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":887.68,"end":888.08,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":888.48,"end":891.76,"speaker":"Fr Bogdan Bucur","text":"Climax. And then, and then you're. You can't sustain."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":891.92,"end":951.89,"speaker":"Jonathan Pageau","text":"Hold on to it. It's not just Pasca, it's every time you take communion, it's like, you know, you go up and you take communion and you, you have this moment of, you know, where you enter into the mystery and then a few days later, you know, you're thinking about your taxes or your whatever, you're fighting with your wife. You know, it's like, wow. None of this is not holding, but, but maybe that's this. Actually, I think that the idea of understanding this as an initiation is possibly one of the ways to see it, which is that it seems to parallel the actual structure of the liturgy itself, which is, you know, the liturgy where we actually have the Epistle and the Gospel and then we have, we move towards communion. And that also seems to mark the way that catechumens were brought into the church as well, taught the scripture at first and then revealed the mystery where they would enter into communion in the end after they were baptized. And so I'm wondering if there isn't, there isn't an initiatory suggestion in the story as well."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":952.93,"end":960.69,"speaker":"Fr Bogdan Bucur","text":"Certainly I can bring in Saint Ephraim. A little bit of help from Saint Ephraim. My two."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":961.73,"end":962.85,"speaker":"Jonathan Pageau","text":"He's always helpful."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":963.09,"end":1185.53,"speaker":"Fr Bogdan Bucur","text":"Yes. And by the way, this is the book where I'm taking it from. It's well, well, well, well worth purchasing St. Ephrem's hymns on Paradise. And he has a few references there. You might wonder what does paradise have to do with all of this? But if you're thinking a bit, we say we have no way of approaching paradise, just as we have no way of approaching the risen state in which Christ finds himself and the resurrection towards which we are being called. We can only speak with the language of ritual, I suppose. Let me show you. I'll share screen again to show you a couple of texts from Saint Ephrem. Alright, so first he says that when Moses speaks about the structure of the Tent of Meeting and later to be the temple, same structure, he marks a difference between these two rooms, the Holy place and the Holy of Holies. The way we have in our churches the nave and then the altar area. And the Tree of knowledge is placed as a gate by which one would have access to the holy of holies, to the altar area. And God did not permit Adam to enter into that tabernacle. Not because the tree of knowledge would be bad or the fruit of it would be bad. God does not make bad things. But first he has other things to do, he has to taste of the other things, he has to prove himself a well functioning priest because Adam is a sort of priest there, he's sensing, etc. He has to taste of the other trees of virtues presumably. And this then he says, this then doesn't work properly because Adam learned that the Tree of Knowledge served as a veil for the sanctuary and realized that its fruit was the key of justice that would open the eyes of the bold. And he makes bold and partakes. And he and Eve have their eyes opened, but at the same time closed so as not to see the glory of the inner tabernacle. Now Saint Ephrem then connects this with the disciples on the road to Emmaus and says that when there, when the disciples eyes were closed, bread was the key. Now when we say that bread was the key, it's obvious that St. Ephrem and many, many others in our tradition in fact understand that meal at Emmaus to have been a eucharistic meal. And bread is the key that opens their eyes. And now their eyes behold a vision of joy and are filled with happiness. And so there's this ambiguity. If properly received, it grants access, it fills one with joy. It is what God intends for us. But if improperly partaken of in disobedience and, and definitely from the wrong provider. You know, if you think of Adam and Eve, then their eyes are saddened. Adam is called the accursed one. It's not at all as it should be. So to recap, in a way the Emmaus meal is, how should I put it, in an antithetical parallelism with the partaking of the fruit in paradise. And resurrection is the undoing of the fall into mortality in paradise. For Saint Ephrem this is nothing novel. In fact, he's not, these hymns are not trying to say anything new. He's giving poetic expression to something that is the common tradition."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1185.61,"end":1218.37,"speaker":"Jonathan Pageau","text":"Yeah, and there's something even in the way that Sen. Ephraim presents it which almost suggests that in a certain manner the Eucharist is the way to access the tree of knowledge properly, that this is actually a return to the garden and A partaking of the fruit, even the fruit that was forbidden, but done in a way which is not through this kind of arrogant boldness, but through humility and receiving and through sacrifice. Because that is how Christ brought that meal to us, through self sacrifice."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1218.91,"end":1565.34,"speaker":"Fr Bogdan Bucur","text":"And the disciples. In fact, if we read the story of the disciples as a story of, as a pattern of any Christian's discipleship, it is a road that leads from arrogance to humility. They start by lecturing Jesus. They accuse him of not knowing what had happened, when in fact, who is it that doesn't know it's them? They don't know who they're talking to. They don't know who Christ is. They don't know that the women had indeed spoken the truth. They don't know anything. But gradually this arrogance is diluted more and more and they listen more and more. And I suppose this is part of what leads, what enables them to see, even for a fraction of a second. But that is enough. That moment is, is so, so powerful, so overwhelming that it is indeed fully transformative. Same with us. By the way, what do we say after we receive communion? We have seen the true light. And I don't know about you, but I can't say that I actually have seen it with my eyes or in any other way. Though I do believe we have seen it because we wouldn't, we wouldn't say such things, even though they're quite a bit more than our experience allows us to grasp. It is a reality that we do receive light invisible to us. I have something I'd like to show you about the Emmaus story. This is the thing that actually, I think connects the Gospel account with its environment. First century Judaism. There is in first century Judaism a way of understanding what happened to Moses. Moses is also luminous when he comes from Sinai, when he comes down from the mountain. Well, what we read in Scripture is that Moses was so overwhelmingly luminous that his fellow Israelites were afraid of him. He was luminous, the scripture says, because he had been speaking with God and God's luminosity had been rubbing off on him, as it were. Well, it so happens that there is, we have a text from roughly 1st century Palestine in which this episode is retold. It's a sort of rewritten Bible. It's a genre of writing that, as the name says, it retells biblical events. But this is how we know how people would have understood those things. The way in which we retell something colors it well. In one of these retellings, which is in a book called The Book of Biblical Antiquities from the first century. As I said, this episode is rendered in the following. Moses came down from Sinai having been bathed with light, invisible. The light of his face surpassed the splendor of the sun and the moon, but he was unaware of it. So far, it's pretty much what the Bible says, just in different words. But then when he came to the children of Israel, when they saw him, they did not recognize him. They did not know him. But when he spoke to them, then they recognized him. And so the strange thing is it doesn't say that they perceived him as being luminous. They did not see him luminous. They had no clue it was him, Moses. And they were afraid. And they recognized him when he spoke to them, just as in the episode of Mary Magdalene. Yeah, say that he's luminous, as we've seen in the. In the painting by Giotto. But it says that she does not recognize him until he speaks to her. Then he. Then she recognizes him. And in the same Book of Biblical Antiquities, the same episode, the same notion, let's put it, of not being able to recognize somebody occurs in the case of David, the other great figure in the Hebrew Bible. David is about to slay Goliath. I mean, the king knows who David is. He sends him out. It's unlikely that he's going to accomplish anything. What is he going to do, this little boy? He goes, you know the story. And when he's about to cut off Goliath's head, the Book of Biblical Antiquities says he pauses for a moment and tells Goliath, look up and see who it is that slays you. And Goliath looks up and says that he sees his face like the face of a Son of God. And in other words, this is unfair because he's not been fighting some Israelite, but there is something with him. He's being assisted, as it were. He gets some kind of heavenly assistance. He slays him and then comes back to the troops. And nobody recognizes who David is. Once again, say he's luminous as Goliath had said he saw him luminous. But they don't recognize him until he speaks to them, and then suddenly they do recognize him. So I suppose that when St. Luke tells us about not recognizing Christ, he's using this kind of tradition that assumes that in this state in which Christ finds himself and the disciples do not. The state of the resurrection, similarly to the transfiguration, he is in a different aspect, but this is not perceived by people who are not capable of that. Our ascetical tradition would Say not worthy. But it is effective, this presence, this light is effective in creating this kind of confusion. Or people who are not compatible with that state."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1565.87,"end":1566.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1566.19,"end":1575.55,"speaker":"Fr Bogdan Bucur","text":"Would not benefit from it. In fact, would be harmed. Are held from. From recognizing this person. So there's a strange kind of."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1575.79,"end":1645.18,"speaker":"Jonathan Pageau","text":"Yeah, but I think the tradition makes sense in terms of just phenomenologically, even the. Because we think that people's faces are obvious or just recognizing someone isn't. Is an obvious thing, but it's actually. It's not as obvious as you might think. There. We have a. We have a story, we have a connection. We have a part of us which recognizes the familiar. And it is actually possible. It's happened to me where this is on the opposite side of the glorious one, which is that I've forgotten who someone is. I haven't seen them in several years. And then I encounter them and I don't recognize them until they speak. And when they speak, suddenly their face changes in front of me. Their physical attributes actually transform because my mind is putting them back together to the person that I know. And I can see this person I recognize in them. And so this is, of course, has nothing to do with transfiguration, but this, you could understand that a being that is. Is in this elated state, that is in a very high spiritual state, that. That they would be transcending their particular face, you could say, and that it would. It would be difficult to recognize them. So it doesn't seem that weird for me that that would happen."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1645.42,"end":1747.42,"speaker":"Fr Bogdan Bucur","text":"I suppose it's not so much. Or not only. Not only the stories that we have, but perhaps broadly in the case of Christ and the disciples, the gestures, the breaking of the bread, the familiarity of that meal, the first meal that begins all these meals that the risen Christ has with the disciples, which we continue in our liturgy, these are our meals. But also what came before the putting together, they put it very nicely. You put together all these elements that make the face that you recognize, recomposing, as it were, the portrait, the icon of the Messiah from all those elements that he finds in Scripture. And he interpreted all the things about himself in all the Scriptures. And suddenly they recognize the scriptural Christ and that gets superimposed upon the figure of the stranger that is with them, who becomes to them not a stranger, but a teacher, not a teacher, but a friend. And then everything gets put in focus suddenly in that moment of epiphany at the meal. It's the structure that we have also, as you said, it's initiatory it is gradual, it is liturgical. And this is how we, in fact do it. We read the Scriptures, we interpret the Scriptures, we pray, and we partake and then say we have seen the true light. I think this is the pattern, indeed, that we still have and are capable of benefiting from if we so want to. Yeah."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1747.42,"end":1769.63,"speaker":"Jonathan Pageau","text":"And there's something fractally true about that structure, which is that it reaches its height in the liturgy. And it is like the liturgical and the, the. The sacramental version of this, of this pattern is the. Is, in a way, the. The source of all the pattern. But it's also the way that you pretty much learn about anything."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1769.63,"end":1769.91,"speaker":"Fr Bogdan Bucur","text":"Right?"}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1769.91,"end":1818.85,"speaker":"Jonathan Pageau","text":"It's the way that you learn about anything, you know. Yet first you, you, you, you look at things, everything looks disparate. You don't see the pattern. You don't see how things connect. You know, if you're learning about history, at first it's all facts. Nothing seems to kind of come together. If you're learning about any skill, even that, you want to learn it all. At first it's confusing. You don't understand it. Then you start to tame it. Things start to accumulate and accumulate. Finally, it snaps together, things snap, and then you can see the higher form coming back down to govern it, you could say. And so I think that it's actually the experience of learning anything, learning to cook, learning to. But that Christ reveals that pattern in its highest form as how creation itself exists, how the world itself exists through this initiatory pattern."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1818.85,"end":1894.95,"speaker":"Fr Bogdan Bucur","text":"We could say, but one needs a guide. I mean, the disciples have to have a teacher. They do, but they also have to recognize themselves as disciples and to function as such. This is the beauty, I think, of this story. It's also the story of shaping them back into being disciples. And this is, I think, how it also connects with Genesis, because some elements there are certainly deliberate, that you have a state of not knowing followed by a state of knowing. It can be the wrong kind of knowing. Adam and Eve knew that they were naked or empty. Jewish and Christian tradition would say that they were naked of the garment of glory that they had had previously. In other words, they don't realize they had been naked all along. And now they're ashamed of it, though this is the text on its surface, but nobody reads the text on its surface, not in Judaism, not in Christianity, in traditional Christianity, that is. But the understanding would have been, and is that they were clothed in a garment of glory."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1897.03,"end":1900.23,"speaker":"Jonathan Pageau","text":"Irradiating light from inside out."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1900.23,"end":1984.54,"speaker":"Fr Bogdan Bucur","text":"In that sense, they're clothed with it. And they know themselves naked of it, suddenly. Whereas with the disciples, it's the exact opposite. They knew Christ and they have just received the Eucharist. He is there, and they have also partaken of him. They have also partaken of him in the exegesis of Scripture, which is a self exegesis, Christ interpreted things of himself, Scriptures. So there is this parallel, the opening of the eyes, which is exactly the same. Adam and Eve, eyes are opened. Cleopas and his companion, their eyes are opened. So that's why I call it an antithetical parallelism. And the main difference is that they are very bad disciples in paradise, right? I mean, they listen to the wrong kind of teacher who says, God told you. No, I'll give you the shortcut, right? The Cliffs Notes to doing this, cheating on the exam, basically. Whereas these disciples learn how to. How to trust, how to listen, how to part, how to commune with Christ. And therefore. So that's my point, is that everything you said, plus this relationship of discipleship, which is an absolute must."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":1984.86,"end":2023.33,"speaker":"Jonathan Pageau","text":"Yeah, and it's. And it really is. If you see it as this antithetical pattern, it really is a return to paradise, if that's what they're experiencing at that moment. You know, it's. There are many places in Scripture where Christ operates that pattern of a return to paradise, but this is one which is very powerful and clear and links it to how the Church will then continue that tradition. Like you said, in terms of discipleship, in terms of sacramental participation, in terms of catechumenate, all of this is continued on in the tradition of the Church. And the story of the disciples going to Emmaus is the narrative version of what we now do liturgically all the time. Basically."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2024.9,"end":2045.82,"speaker":"Fr Bogdan Bucur","text":"There's also the strange element that the disciples seem to get all kinds of things retrospectively, that is, after Christ vanishes from their sight. And I think we should emphasize the fact that he doesn't go away to vanish does not mean that he left them. He vanishes from their sight."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2045.82,"end":2047.1,"speaker":"Jonathan Pageau","text":"Now they can't see him anymore."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2047.1,"end":2125.44,"speaker":"Fr Bogdan Bucur","text":"Yes, exactly. So just as in liturgy, we have seen the true light, where we might not have grasped it, but it was there and it is there. So also with the disciple, he vanishes from their sight, is present, but invisibly present. But after that, they have another little chat among themselves. This time it's not about the crushing trauma that they had experienced with the crucifixion. This time it's about their experience on the road. On the road. It doesn't say in the text that they would have experienced anything special. I mean, they don't to reflect then, but post factum, after the moment of grasping Christ, they said, weren't our hearts burning within us? He was speaking to us on the road, opening the Scriptures to us. Just as he opened the eyes, he opened the Scriptures. But this tells us that something has been happening all along and he's been working on them unbeknownst to them. Yeah, to me this is absolutely fascinating because you have to assume if Christ is in that state of intense luminosity, imperceptible to their eyes, that this working in them, this fire burning in them is of the same kind. And this is in fact how are. How the early Christian tradition reads it."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2126.24,"end":2175.84,"speaker":"Jonathan Pageau","text":"And there's something. There are so many. I have all these versions of that story that are just kind of rushing into me. Because you see, in the story of the Ethiopian eunuch, you see a similar situation where the Ethiopian eunuch is reading Scripture, doesn't understand it, he's confused, he has no idea. And then, you know, Philip comes and shows him, you know, which leads to sacrament, which leads to now, not to the communal meal, but to the baptism. And after the baptism, he vanishes too. It's like he brings him into the sacrament that he vanishes and, and the, and the, you know, the eunuch is left in that state, you could say of a transformed state. So it's interesting to see that this is definitely something which, which is part of the resurrected and the body, of how the body of Christ works, let's say, after the resurrection."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2175.84,"end":2205.5,"speaker":"Fr Bogdan Bucur","text":"And it also shows in the same way this discipleship, chain of command. Because the eunuch reads, he just doesn't know what it means, who he's reading about in Isaiah 53, how to put things together. And it takes the guidance of Philip. But Philip himself doesn't know about this until he's prompted by. It's not very clear there. It's this holy Spirit or it's an angel or that's another person maybe, but."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2205.5,"end":2207.46,"speaker":"Jonathan Pageau","text":"He'S receiving from above, let's say."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2207.46,"end":2259.77,"speaker":"Fr Bogdan Bucur","text":"Yes, exactly. Yes, that's right. So he's receiving from above the impulse to go and do this. And Philip could have said, not now, later, not this way, not the Ethiopian, whatever the kind of things that you have plenty of in Scripture, like Moses go, but what if Pharaoh. But what if the Israelites send somebody else? It doesn't always work so easily with Philip, who is a disciple. It works easily, go, he goes, tell him, he tells him. And the Ethiopian eunuch benefits from it. It's a kind of a chain of command, if you want. But it's not to lord it over God lording it over Philip, Philip lording it over the eunuch. It's to serve and to empower and to help achieve God's goal in all these folks. And indeed, this is how it works."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2260.49,"end":2315.05,"speaker":"Jonathan Pageau","text":"Yeah, the light is carried down, and Moses is the same thing. Moses goes up the mountain, he receives from God, and then he comes down and then brings to the level that each person is able to receive it down the mountain, all the way to the bottom. And you see this idea in Saint Maximus that all things participate in the glory of God to the extent that they can in their being. And that appears as this chain, this grand chain of light that comes from down and fills the world ultimately. And like you said, the Christian version of that has something to do with gift and sacrifice and self sacrifice, giving ourselves down to that which is below, the Father that gives himself for his children and for his wife. Rather than the way that authority is understood in a more kind of brutal pagan way, where it's just a basic control of people that are below. It's a different form of hierarchy."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2315.2,"end":2660.01,"speaker":"Fr Bogdan Bucur","text":"When we're told how God's authority works, it works by washing the feet of the disciples. I want to show these texts about how the Fathers understood well, this burning of the heart. This burning heart, because it really goes to the heart of our, especially the ascetical tradition, though that ascetical tradition is the common inheritance of all, regardless of how much of it one practices with one monastic or monastic or. But the fascinating thing is that it seems to be. It seems to be. How should I put it, a unanimous way of reading. So I have three authors, and they're all important. One is Origen, great teacher. Yes, some heresies and some problematic things, but also the one author that everybody reads and benefits from after him, St. Basil the Great, who read Origen, of course, corrected him too, but benefited from him and the Makarian homilies, the 50s homilies. So Origen says that like earthly fire with its double action, burning and giving light, spiritual fire is also double in nature. It is the light that enlightens every man, but it is also the eternal fire prepared for the devil and his angels. And so there isn't really an essential difference between, say, the light of paradise and the fires of Gehenna. The difference is simply in the way in which we relate to the presence of God. But it is the presence of God. It was, he says it was the same Christ that burned the hearts of the disciples on the road to Emmaus and enlightened them by the opening to them, by opening to them the Scriptures. Now, why are their eyes held? Because they're not capable yet of sustaining that vision in a way that is safe for them. So they're slowly being purified, burned in the hearts, as it were, to make that heart less sclerotic. In fact, this is what Christ says, your hearts are dull, your hearts are slow. You're slow of heart. And St. Basil then starts to find these references in scripture. Of what sort is this fire which purges sins? Ada ben Abihu, the sons of Aaron, the brother of Moses, were burned up, having used an alien fire. But the seraph took a live coal from the holy fire that was on the Noeti, the spiritual altar of the true whole burn offerings. In the Old Testament, Isaiah, the prophet receives from the seraphim this kind of purification enable him to stand in the presence of God, because he says, when he sees God. You can read this in Isaiah, chapter 6. He sees God and he's horrified. Woe is me. I'm a man of unclean lips and I'm here. Well, the seraph takes a live coal and purifies him. Akin to this fire was also the fire of the thorn bush that Moses saw and then the heart of Cleopas. And Simon was burning with such a fire when the Lord was expounding to them the Scriptures. And he gives other examples as well. So the point is, this is not some metaphor of some emotion, you know, stirring up, stirring them up. It's not some kind of conceptual light bulb that goes on. It is something that is God's very presence. God's very presence. Transformative. And finally, this is the. I think that the most impressive text, Sin Makaris, or Pseudo Makaris, is not really Macarius. It's some anonymous author given the name in tradition of macarius. But the 50 spiritual homilies say, basically put together all script references that you have to fire and so forth. I've selected a few. Our God is a consuming fire. And this fire exerted its power over the apostles when they spoke with tongues of fire at Pentecost. This fire surrounded Paul in the voice that enlightened his mind while blinding his senses. When Paul meets the risen Christ on the road to Damascus, this fire appeared to Moses in the bush. This fire caught up Elijah when he is taken up from the earth. And this fire inflamed the heart of Cleopas and His companion when the Savior spoke to them. After the Resurrection, this fire burns up the beam of the interior eyes. This fire drives up demons and has the power of the resurrection. And this is really this passage here, the last one that I've read travels as such in the. In the tradition, the Hesychast tradition, the tradition of prayer that purifies and leads to the vision of God as light. And it becomes. It becomes a set text that travels in the manuscripts. And the point is that our little verse there about Lucas and Cleopas, or Cleopas and his unnamed companion, is a witness to this experience. And so when we're reading a story that is somewhat ambiguous and mysterious and fascinating at the same time, but it is not a story that is inaccessible to us in its reality. That reality is not only accessible to us, but definitely for us. We must, in other words, at least embark with the disciples. I guess the same road."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2660.81,"end":2692.82,"speaker":"Jonathan Pageau","text":"Yeah, I think that's wonderful. And, you know, I think that, you know, I think that that's actually probably a good place for us to finish the conversation as an encouragement for people to understand the light of the Resurrection as something which is really the presence of God, which is accessible to us through. Through the Church of the sacraments, through. Through also this encounter with Christ that we can all have access to, you know, in our heart, which is a good way to describe it. And so, Father Bogdan, thank you so much for your wisdom and your thoughts."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2692.82,"end":2700.86,"speaker":"Fr Bogdan Bucur","text":"On this, much for your time, and I'm very much looking forward to maybe receiving your thoughts privately about the iconography of this."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2701.18,"end":2703.46,"speaker":"Jonathan Pageau","text":"All right, definitely. We can. We can definitely do that."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2703.46,"end":2705.5,"speaker":"Fr Bogdan Bucur","text":"All right, thank you. Christ has risen."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2705.96,"end":2707,"speaker":"Jonathan Pageau","text":"Indeed, he's risen."}
{"episode_id":"SW - #232 - 2022-05-11 - Fr. Bogdan Bucur - Encountering the Risen Christ","start":2707.4,"end":2769.49,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism. That is. It's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon, the Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
