{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":0.24,"end":29.69,"speaker":"Jordan Hall","text":"Right. This new AI thing is even like, more sort of, whoa. We're talking about intelligence itself, man. We're talking about something that is every day, like you said, in three months. It's just. And so that feeling interior of, wow, we're not prepared to deal with this. You have to have symmetry between wisdom and power at a minimum. And if we're looking at a magnitude of power over here, let's just call it X. Then what does it look like to constitute something that has a magnitude of wisdom at least slightly more than X? Right. Let's just hold that as the problematic."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":30.01,"end":112.03,"speaker":"Jonathan Pageau","text":"In the Bible, there's literally a story like the story of Solomon is about that. The story of Solomon is about God asks him what he wants. God acts as a genie in this situation. God says, what is your wish, Solomon? What do you want? One thing. Tell me what you want, I'll give it to you. And then Solomon says, I want wisdom. Then what does he do? He builds the temple. He makes a technical space. But. But he does it after he's asked for wisdom. So because of it, it's sacred. It's a sacred space. Now we're in the opposite direction. Like, now we're. We basically made a deal with the devil. We've got all these. These things that are massively powerful. And now we're like, oh, we should have asked for wisdom. It's too late. Like, what do we do now? It'. This is Jonathan Pedro. Welcome to the symbolic world. All right. Yeah. And so sorry also for last time. I'm really bad. I have an assistant now. But realize that having an assistant also means that you have to communicate with them."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":112.42,"end":117.86,"speaker":"Jordan Hall","text":"It's a. It's a. It's acquired skill. I remember that I had an assistant for, gosh, about six years."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":118.02,"end":118.46,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":118.46,"end":123.18,"speaker":"Jordan Hall","text":"And it took a solid year before we got into sync. Once we did. Wow. It was working so well."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":123.18,"end":142.36,"speaker":"Jonathan Pageau","text":"Great. Yeah. You kind of have to. Yeah, you have to figure out, like, you know, you realize if you haven't communicated something, then you find yourself. Yeah. You find yourself in chaos. And so it can be worse if you don't communicate than not having one. Right. That's the thing. It's like, that's why you have to. Yeah, I have to focus, take it seriously. But I'm doing better. I'm doing better."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":143.08,"end":151.96,"speaker":"Jordan Hall","text":"And I gather also from what I've seen from the outside world, that your level of. Call it logistical activity is becoming quite high."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":152.28,"end":178.25,"speaker":"Jonathan Pageau","text":"Yeah. It's also because when Covid ended, I went crazy and I just kind of Said yes to everything. And that was the big mistake. Yeah. And so I'm paying for that. But hopefully, hopefully we're. Hopefully that'll end soon. I'm saying no to most things now, but when Covid ended, I was just like, yeah, yeah, you want to come here? Sure, sure, sure. And so just basically been traveling non stop. And so how about you? So what are you working on these days?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":178.65,"end":199.45,"speaker":"Jordan Hall","text":"Well, a lot of my energy is now turning into the AI space. Yeah, you know, my, my sort of basic mode has been sitting at sort of at a high point watching, I guess you could call it kind of global systemic risk or something like that, which includes the way our individual and collective mentality thinks about such things."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":199.53,"end":200.01,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":201.21,"end":246.98,"speaker":"Jordan Hall","text":"And all the different institutions and organizations and paradigms and models that we use to think about such things. You can think about all those and just keeping an eye on it. So like, when Covid came, I sort of rotated to the whiteboard and said, oh, global pandemic expected in this time window. Check, here it is. Now let's start watching how it plays out. And so my attention sort of moves from a highly diffuse, nothing particularly pressing going on, and go back to the big picture to the, oh, one of the big things is happening. So with LLMs popping last year and then in particular over the last six months, a large number of people that I have collaborated with in the past have come in and said, hey, let's focus on this problem of AI. And so that's become quite dominant amount of time and attention over the past few months."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":247.14,"end":304.57,"speaker":"Jonathan Pageau","text":"Yeah. And so, and so for those that are watching this, that's the reason why Jordan and I decided to, to talk was to talk about the question of agency, transpersonal agency, the relationship with AI and all that. So it's so, so it's, it's definitely an important thing. It's weird. I'm in a weird spot because I've been talking about this problem for a few years now, like the problem of, of AI and how it's related to whatever, to something like transpersonal agency. And so now that it's exploding and everybody's talking about it, I've actually kind of, I've actually stopped talking about it. But I think this is the right, this is the right time to restart the conversation. And so what is your diagnostic like? What do you see as the situation? Because I don't know if you watched. I mean, you talked to John Revaeke. He clearly has now made his position pretty clear. And so I'd definitely like to hear yours yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":304.57,"end":309.25,"speaker":"Jordan Hall","text":"When he and I have talked about that, I actually had an opportunity to meet with him over Easter."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":309.49,"end":309.97,"speaker":"Jonathan Pageau","text":"Nice."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":310.45,"end":327.49,"speaker":"Jordan Hall","text":"Particularly good timing just before he created that video and we had a good conversation about it. So I have sort of intimate clarity on what he's thinking about. Not radically intimate. I don't know that well, once, but still. Well, let me put it, let me put it this way."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":335.63,"end":508.41,"speaker":"Jonathan Pageau","text":"Jonathan. I'm Jonathan Peugeot and I'm inviting you to participate with us in our retelling and our celebration of one of the most iconic fairy tales of all. Snow White. A beautifully illustrated storybook, Snow White and the Widow Queen places our iconic character at the beginning of eight upcoming fairy tales which will speak to each other and harmonize in surprising ways. Snow White and the Widow Queen rekindles an adventure which will make you remember, rediscover, but also marvel and wonder at our rich heritage of stories. A heritage that still has secrets to reveal even after centuries of being passed down to us. In the past few decades, we have watched many of our stories, our fairy tales, our myths, become completely exhausted by efforts to deconstruct them, to reinvent them, and sometimes to even invert their original meaning. It has come to a point where we've almost forgotten why we cared about these stories in the first place. I firmly believe that for this reason, it is now time to retell and redisrupt our original fairy tales. In a spirit of celebration, of admiration and unashamed joy, I've spent the past two decades meditating on the strange narrative elements of Snow White and other fairy tales. After much thinking, and now bringing this story to our common hearth, we find in the fire of time ready to present hidden treasures most of us have never noticed. To accomplish this, I have paired up with Heather Paulington, a world class artist and designer who has worked on some of the most beloved film franchises of our time. Her work mirrors my writing in a collaboration that has produced a powerful synthesis of medieval style with the best of 19th and 20th century illustration. I love the Kickstarter model because we can make the book more and more beautiful with every stretch goal we can offer art prints, a limited edition drawing by Heather, and even a Snow White illustration of my own. Finally, we're planning a super exclusive leather bound edition which pulls out all the stops. A storybook mantelpiece for sure. The profits of this crowdfunder will be used to start a new publishing company, Symbolic World Press, whose christening publication will be this very fairy tale series. Each book illustrated by world class artists. Jack and the Beanstalk Cinderella, the valiant little tailor, and several more are next in line for publication. All existing in the same world and all fitting together like a puzzle moving towards the final, surprising resolution. After all that, there's no limit to what we can do. It's time to reset the clock to retell our stories. So please join us in this celebration and creative venture."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":514.25,"end":542.47,"speaker":"Jordan Hall","text":"Golly. How's it go? My basic mode is actually, I think I've come to discover it's somewhat unusual. I don't yet know what my perspective is. I sort of have an approach where I allow myself to really explore very large space somewhat lightly. And then what I do is I start to pull that in and see what shows up as strong or well supported or even rich."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":542.63,"end":543.11,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":543.11,"end":554.92,"speaker":"Jordan Hall","text":"And the initial move tends to be, would you call it. Not radical, but. Well, I guess liminal is the right term. So, for example, the reason I reached out to you a while back, maybe a couple, Maybe a month ago."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":554.92,"end":555.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":555.72,"end":623.6,"speaker":"Jordan Hall","text":"Was I was increasingly getting the sense that, let's just put it this way, the proper way of actually contemplating this question, at least meaningfully, like a meaningful portion of it is theological. Yeah, this is a theological question. And you can notice that with some of the words that people use. And people say we are like, we're becoming gods or we're creating God or something like that. And you're like, well, you're using that word, but you're using it in a very. We call it unprecise, naive, and highly disconnected from, you know, thousands of years of people really committed, thinking about it robustly. Yeah, maybe we should do something other than being naive and hubristic. Maybe this is actually a theological question. Let's dive into it. And so now you popped into my mind as a. Somebody I've spoken to in the past where I found a. A combination of we can communicate, like it's not hard for us to communicate. And my sense is that you've got a. Both a. I'd say a spiritual commitment to that side of things and actually a level of life commitment to exploring in that modality. So hopefully we can have a generative conversation."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":623.84,"end":875.32,"speaker":"Jonathan Pageau","text":"I hope so. I think so. You know, it's the thing that's been interesting in terms of thinking about this for me has been like, for example, like when we saw that discussion with, I know you, probably the discussion between Elon Musk and Tucker Carlson where he, he basically, you know, brought up that term and said that the head of Google had literally told him that they're building a God, like that this was this is what. That. This is the way they're conceiving of it. So the idea that we're conspiracy conspiracizing about how the people even involved in this space are discussing this, it seems we're not. Like, this is. This seems to be the mode of language, like you said, that is being used even by the actors that are involved in the process. Probably not all the actors, but at least some of the important ones. And so one of the difficulties that happens is in terms of when you have materialists, people that don't understand something like vertical causality or don't totally conceive of it, what they end up with is a confusion between something like authority and power, you could say, or intelligence and power, right? And I see that that's a confusion. That is, that. That has been really pervasive, is that just because something is very powerful doesn't make it a God. The notion of God, or a God even in a pagan sense, is related to principality. That is, it is something like. More like a king. It's something that gives form or manages form, manages cohesion, right? Gives. It's like the top of a pattern that you notice, right? So it's like you see war. You see that war has certain patterns and it has a kind of agency that you can't avoid, right? It's like once the agency takes grip of you, you can't just say, oh, well, we could. When you hear people say really ridiculous things like that, like, why don't we just all stop fighting? Like if we just all stop fighting, then war would end. It's like, yeah, that's. I mean, that's obviously ridiculous. You know, once the, Once the pattern sets in, it's like the same with the arms race. Like, why don't we just stop the arms race? Let's just stop it. Oh, great, let's us, whoever that is, stop it. You know, there are ways in which patterns, when they take. Get a grip on you, they play out. And so when we notice that, then we see that there's a. A way of, like it reveals itself to us, you know, and that's where the, A lot of the old gods, that's what they are, right? They, they. They are an agency that appears from above and that manages a certain amount of quantity, like a pattern of behavior, a certain space, a certain cohesion of people, like a local God. Or sometimes it's just the ancestors, right? The ancestor is still there and, and acts on us through his. Through the fact that we're have a common connection. To them and that he gives us identity. So people confuse that with just a lot of power. Like, and this is what I think. I hope that confusion is true. Because if people say God the way that the ancients thought of it as a kind of principality that manages patterns over us and that we're kind of like, for good or ill, like we're the puppet things of the gods or we're the food of the gods. Right. If they see it that way, then I'm frightened beyond belief. Like, if someone would say that we're building a God in the sense that we're building something that will rule over us, that is just. That's the scariest thing ever. And so I'm hoping that there's this confusion, but we have to be able to dispel the difference between something which manages from above and something which offers you. So the difference between a God and a genie, for example, Right. So the genie in the bottle, what it does is it offers you infinite potential for you to give intelligence to it. And so you. It asks you a question, what do you want? You tell it to. You tell it what you want, and then it offers infinite potential to realize it. And because of that, that's why you get the side effects too, because it offers too much power for your wish. Like, if your wish is something secondary, like I want a bunch of money, then it's like, okay, I'll give you infinite power to do that, and then all the side effects of it play themselves out. Right? So that's something. I just want to put that out there and see how you react to that."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":876.2,"end":918.16,"speaker":"Jordan Hall","text":"Well, I mean, the first response is something like, yes. So I can say with high degree of confidence that some portion of the people who are working in the category of AI are talking about gods in the principality sense. Right. And so your fears, part of why we're talking, some part are talking about it in the sense of, as you say, like a genie. And oddly enough, like the genie metaphor, you know, Eliezer Yudkowski's, you know, one of his primary concerns is that we are in fact accidentally creating a extremely powerful genie. And we're about to accidentally ask it to give us, you know, X. Not recognizing that when we ask for X, we're going to get a whole lot of other stuff that we didn't actually understand we were going to get."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":918.31,"end":919.99,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, the paperclips problem."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":920.23,"end":921.51,"speaker":"Jordan Hall","text":"Paperclips to the sky."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":921.83,"end":922.23,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":923.51,"end":947.22,"speaker":"Jordan Hall","text":"And then the third piece, and this is, I think, make a point of quite sensitive possibility. You've Heard, I think we've even spoken about the notion of Egregore or the specific Moloch. Right. Moloch lives, I would say right now at the. At the upper edges is sort of the frontier of thinking of the people who are coming from the materialist perspective up."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":947.46,"end":951.22,"speaker":"Jonathan Pageau","text":"Yeah. They're noticing. They're noticing this agency now, like, exactly."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":951.22,"end":998.12,"speaker":"Jordan Hall","text":"And beginning to speak about it as such. Right. And so there's like a dawning awareness of. Wait a minute, this is a whole category that we may need. May need to be thinking about. What do we do now? Right. And so I think you've got. I would call it almost like, again, sort of spiritually naive and in some sense, even psychologically damaged projection towards principality. You've got the. How would I say this one, like, perspective limited. And I'm being. I'm trying to be somewhat precise there around the notion of the genie. Right. You've kind of got two groups that are engaging in a reciprocal conflict. The effective accelerationist types who say, let's get to the genie as fast as possible because it can only ultimately deliver good things."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":998.38,"end":998.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":998.94,"end":1049.5,"speaker":"Jordan Hall","text":"And the sort of the. The care, you know, crew who are saying, let's stop everything, like literally unplug all electricity if necessary because the genie will kill us all. Perfectly. Right. Something like that. And what's interesting is that that dynamic is a dynamic that's driven by a sort of a reciprocal closure in a fear conflict. But the space around how do we think about this question of a substantial increase in our agency without necessarily any relationship to our wisdom, to be able to contemplate the consequences of that action? And then you've got this other thing that's thinking about it in terms of, okay, let's begin to think downward agency or a higher form of agency with something like identity or personality or perspective or values of its own. And then, of course, the email I sent, I specifically said, can we add angels into the conversation?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1050.14,"end":1130.44,"speaker":"Jonathan Pageau","text":"Sure, of course. I mean, obviously we have to talk about these things now. There's no. One of the things I want to say about the Moloch problem related to what you're saying that's important to understand and will help people notice what is happening is that everybody talks about the agency of the AI, right? It's like, does AI have agency? Does AI have consciousness? Is AI a person? Can it become a person? This is, of course, John Vervaeke is right in there at this moment. But what's fascinating about the AI, the Moloch problem, is that it can help people notice that the real problem or one of the main problems isn't the AI itself and its agency and its consciousness. It's the fact. It's the rampant acceleration of implementation. The fact that people are blindlessly running towards implementation under a kind of agency that isn't in the AI. Like, it's not. So the AI is acting on you, but not through like, Chad GPT, like, not to chat GPT online, not through like, the actual interaction of software or whatever. It's acting on you in a different manner. That is not, you know, it's important people to understand that type of agency. So it's like it's acting on you outside of its software."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1130.76,"end":1131.16,"speaker":"Jordan Hall","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1131.16,"end":1134.56,"speaker":"Jonathan Pageau","text":"It's making you. It's making you build a body for it is."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1134.56,"end":1134.72,"speaker":"Jordan Hall","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1134.72,"end":1161.96,"speaker":"Jonathan Pageau","text":"It's. It's like Sauron, like, you know, using your desires and your desire for power to make a body for it, you know, and using all our passions and all our desire for. For riches and for, you know, for competition or whatever, to have a body built for it. So it can help people understand that the question is not just about whether or not the program or like the whatever is. Is conscious. It's a bigger question than that."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1162.2,"end":1219.46,"speaker":"Jordan Hall","text":"Right. Yeah, this is. This is a. This is a key point. So let's just sort of. Let's zoom in on that for a little bit to make sure it lands, because it's a critical point. My friend Daniel Schmachtenberger made something like that point talking with Liv Baret maybe a couple weeks ago. And I made something like that point talking to John Vervaeke, last conversation around governance. So let's just hit it. And the way I would say it is something like. Yeah, this notion of embodiment or incarnation that we know, like in the mythologies and the stories, things like inciting greed or lust for power or fear, is a. An aspect of how this agency, this sort of disembodied agency causes. Is that right? You know, let's say causes for the moment or even incentivizes causes humans to act in the world on its behalf."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1219.46,"end":1220.3,"speaker":"Jonathan Pageau","text":"Yeah, there you go."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1220.3,"end":1220.46,"speaker":"Jordan Hall","text":"That."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1220.46,"end":1222.02,"speaker":"Jonathan Pageau","text":"Yeah, that's a good way to say it. Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1222.1,"end":1238.98,"speaker":"Jordan Hall","text":"And so then the kind of work that you do when you're coming from those locations, when you're being motivated by those kinds of things, at the very least probabilistically, tends to result in a furthering, a deepening of the embodiment of this agency."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1239.06,"end":1239.54,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1239.54,"end":1298.88,"speaker":"Jordan Hall","text":"So you can look at the history of history and notice when, like, you talked about war. Right. There's A. You can watch it. You can see it happening now. Of course, you could actually watch it in say, World War I. And you can sort of notice the. I remember the scene you invoked Lord of the Rings. Remember the scene where they're at the Council of Elrond and all of the people start arguing and fighting and you can feel the presence of Sauron going. Yes, that's it. That's the thing. You know, war is just about to show up in this council. Discord and conflict, you know, and so that's how it works. And it has. It always works in that way. And of course, the opposite, I propose, is also true. There's other forms of agency of this sort that activate and play with or play on other aspects of. Of humanity. Humanity, like love and integrity, that produce and embody different kinds of agency. That's the. At least the hope that I'm putting out there that I. Yeah, yeah, yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1298.88,"end":1383.66,"speaker":"Jonathan Pageau","text":"No, but you're. You're right. So I think it's important for people to understand the traditional difference between an angel and a demon, for example, like, to understand why we have that difference. And one of them has to do with what, what you said. One of them is the notion that, like this grasping towards our desires, right? So it's like our fears, our desires or whatever, you grasp them and when you grasp them and you think that they're the thing, like they're the thing that will. That will provide everything for you, right? That's why addiction functions that way, right? It's like if I just, you know, just this beer is going to solve my problems, right? Well, you don't think that. But we act that way, right? We act as if this thing is. I'm going to put all my desires and my, like, my being into this thing because I think it's going to provide for me something that it's not capable of providing. And so, but when that happens, that's when you, you know, that's when we could say that the agency that's acting on you is something like demonic or. That's why the demons in traditional lore are always connected to your passions, right? We say the demon of lust, the demon of envy, the demon of greed, right? So it's like the demon of. These are the types of agencies that are hooking into you that way, right? So. And the. And just like in Star wars, by the way, like, it's really interesting. And so what happens is that when you give in to those, you will become a slave."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1384.06,"end":1384.54,"speaker":"Jordan Hall","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1384.54,"end":1550.44,"speaker":"Jonathan Pageau","text":"You become a slave of that. Right? When you, when you give in to addiction, addiction is the best way to understand it, right? You know, when you give into addiction, you get a little bit of consolation, but then that consolation right away falls into a type of slavery where you become a slave of the thing that you think will provide for you. The angel or the good. Principalities, what they do is they stack. They always stack up towards the higher good. And so first of all, they don't enslave you directly, which is why it makes it more difficult to do good. So it's like you actively give your will up to something and that thing that you're giving up to is lined up towards a higher good. So you participate in something with a certain amount of effort, and then that thing that you participated is aligned towards more and more. So a simple thing, simple way to understand that is when you, let's say you're digging a trench. And you're digging a trench so that you can stop a flood that's coming. And the reason why you're doing it is so that you can help your neighbor. And that feeds into something that's higher. So digging a trench will never become an addiction. You won't become addicted to digging trenches. It will, it's an effort and it will scale into higher goods. And so that's how angels function. And that's why angels are identified with virtues, right? We literally have certain category of angels that we call the virtues because they are the principalities of all that is good in human behavior. And so they are a type of agency, but they act differently. And that's why it's so hard, because this whole thing like, that's why it's so difficult, because the whole AI thing, the way that it's setting itself up, the way that technology and intelligence is connected now, is always devouring of attention. It's always parasitic. It's always trying to get your attention in order to get money in the pockets of some people. It's always trying to feed off of your intelligence in order to give power and money to certain forces. It's difficult. And I have a lot of sympathy for John who, John Vervecki, who has this dream of giving birth to these beings in a way that will bring about wisdom or whatever. But the forces I see behind the whole process don't seem to make it possible. The whole thing is in a system that makes Facebook and Twitter and all these attention grabbing mechanisms, all this intelligence devouring mechanisms that are trying to, that enslave us to the power of others."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1551.24,"end":1553.64,"speaker":"Jordan Hall","text":"Oh, awesome. Okay. I would like to Give you hope."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1553.96,"end":1556.28,"speaker":"Jonathan Pageau","text":"All right, well, thank you. If you can."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1556.68,"end":1558.44,"speaker":"Jordan Hall","text":"How funny is that? All right, you ready?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1558.52,"end":1559,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1559.16,"end":1589.92,"speaker":"Jordan Hall","text":"Okay, so the first part I would say, and I agree with you completely, by the way, is something like this process, and we're talking right now specifically the development of AI didn't just sort of begin out of nowhere. We've been locked in a stream. Yeah. Of the process of civilization where the presence of at least two demons that I have spent some time thinking about, Moloch and Mammon, have been really playing a significant leading role in shaping how humans are behaving."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1589.92,"end":1590.36,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1590.76,"end":1598.91,"speaker":"Jordan Hall","text":"I don't have a really good name for how war works. We'll just. Maybe just call it war. But war has obviously been hanging about quite a bit also over the past, say, 10,000 years. Yeah, there's also."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1598.91,"end":1604.99,"speaker":"Jonathan Pageau","text":"There's also. There's also Venus or, like, she's, like. She's definitely there. And a lot of this stuff."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1605.07,"end":1608.59,"speaker":"Jordan Hall","text":"Yeah, yeah, a lot of this stuff. Yeah. Even like the early Internet."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1608.99,"end":1620.83,"speaker":"Jonathan Pageau","text":"That's right. Like when. When, you know, when John said it's either porn or the military, I was like, yeah, that's it. It's like, yeah, Mammon with Venus. They make a good, good combo."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1620.83,"end":1622.83,"speaker":"Jordan Hall","text":"Yeah. The mammon is the pimp."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1623.23,"end":1623.87,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1624.92,"end":1761.65,"speaker":"Jordan Hall","text":"Okay, so that's a. Like we're catching on to something where there's been actually a very long stream. Right. It's actually for most people alive who happened. Happen to have lived an extraordinarily blessed life, almost the entirety of your encounters have been actually had the deep thumbprint of these demonic forces. Right. Okay. So that's where we are. And you could just look at the particulars. You're looking at the arms race as ChatGPT hits, and suddenly Google and Microsoft and Facebook, like, oh, shit. They put all of their resources, their money into. Or not all, but a tremendous amount of their resources into the arms race on this front. And the psychological arms race. How many people have suddenly just had their time and attention, myself included, focused on these things and people looking at all the different levels, motivated in the way that you articulated. How do I make a ton of money tomorrow on this? How do I avoid having my livelihood disrupted by this? Like, those kinds of things, you know, so the. Those forces are important. All right, now, hope, The. The. The thing. Let's see, is that the right word? Like the thing or. The aspects of reality that are connected with the angelic are simultaneously always fully present and more fundamental. Right. And so it is in some sense merely, and anyone everywhere Anyone, Everyone, everywhere. Finding a way back into relationship with those forces that are always present and more fundamental grounding in them, and then building that trench, to use your metaphor, or I'll say sandbags against the flood, with the adequate level of conviction capacity. There's one more thing there. Like, I can't quite tell what it is to be able to start building that stack. And we're in a moment right now, and this is, I guess, why I felt like leaping into this conversation was so right, where we're actually in a quite a liminal moment. Like the. The particulars, almost like the, you know, the early childhood development stage of AI has not. Or the clay. The clay is not set. The clay of what this thing is going to be is still actually relatively malleable."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1761.65,"end":1762.09,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1763.29,"end":1804.26,"speaker":"Jordan Hall","text":"Everything's up. And the magnitude to shift to the Gini area direction, the magnitude of the power we're dealing with is actually so large that it will, I would say, break, disrupt almost everything at the institutional level, including previous versions of itself. And so the lead that OpenAI has may, in fact be ephemeral, but more importantly, the lead that, say, the United States dollar has may also be ephemeral in relationship with the potency that we're dealing with. Yeah. So, you know, if we can get our act together and find some way to, you know, be on the side of the angels with enough. With enough."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1804.58,"end":1805.14,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1805.38,"end":1812.34,"speaker":"Jordan Hall","text":"To set this thing in clay in that direction, then, you know, the good triumphs in the end."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1812.42,"end":1840.14,"speaker":"Jonathan Pageau","text":"Yeah, well, I believe the good triumphs in the end. Like, that's for sure. Some people think I'm a doom and gloom guy, but I really believe that the good triumphs. Let me tell you, I want to tell you a story based on this. Like, there's an image in the Bible. Technology. There's an image of technology in the Bible. Right. It's basically, you find a narrative line in scripture about what technology and civilization is and how it works."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1840.39,"end":1842.51,"speaker":"Jordan Hall","text":"Yeah, it's."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":1842.51,"end":2213.71,"speaker":"Jonathan Pageau","text":"And it's. It finds corollaries in other cultures. Like, it's not. It's not independent. It's not just this one thing. It looks like what the Greeks thought about technology too. And there are similar things. And so. Right. The technology in scripture starts as a compensation for lack. So Cain kills his brother out of jealousy, and then God pushes him away, like, excludes him from his presence. And that alienation from the presence of God and the fact that he's alienated from other humans as well, you know, from. From the other. The other people, forces him to build A city. And so as soon as Cain is alienated, it says right away, the first thing he does is that he builds a city. And then in his line, all technology is in his descendants. So if you follow the genealogy in Genesis, you'll see that it's like his descendants build all the arts and all the technology. So music, tent making, you know, like agriculture, and then also ultimately metal, which really means weapons, right? Which means also weapons as well. So war making. So you have this sense that. And then that leads to a crisis and monster and monsters. It leads to giants and monsters. And there are all these interesting traditions that are not in the Bible, but they talk about how in the time of Cain, they made alliances with these demons and then created hybrids and mixture and all kinds of kind of monstrosities and also necromancy and everything. Because it's like people better start thinking about necromancy really fast because people think that that's a silly thing and necromancy is right on our. It's right there. It's like standing right in front of us right now. So we have to start thinking about these old things that nobody wanted to think about anymore anyways. That's a little parenthesis. So basically necromancy and all this kind of chaos and also women putting on makeup. Also this part of the. It's all comes together, right? Talk about mammon and Aphrodite and all that. And that leads to the end of the world, right? It literally leads to the end of a world. The flood comes, everything is destroyed. But Noah uses technique, uses science and technique to survive the flood. So God tells him and tells him how to build an ark that makes him survive the flood. So that's a little cosmo, that's a little image of how it works. It's like technology seems to be based on lack and on kind of a demonic relationship. And then God saves it in the end and transforms it and redirects it towards the good, right? So then we see different iterations of that in scripture. For example, the, the tabernacle, the temple, all these images of like space, sacred space that are model in way, that are modeled on the Garden of Eden, become a kind of, of technical supplement to the Garden of Eden, but a way to return back to the garden as well. So that falls all through the Bible. And then at the end of the Bible, in Revelation, there are two images of civilization and technology that are put in contrast with each other. One is the beast. So you have this beast that comes out of the water and it is civilization because it has different heads of different animals which are. In the other parts of the Bible, are used to show different civilizations. So it's like the Babylonians, the Macedonians, etc. And now it's like in one beast, all the civilization, you know, represented as this one beast, it may. There's an image of it made that speaks. And when people hear the image speak, where they worship it, they worship the beast, right? And. And. And as they're worshiping the beast, then the beast, you know, puts a number on them. Basically puts a number on them so that they can participate in the system. Like, without that, they can't. They can't buy or sell or whatever, right? So that's. That's one image of civilization, right? And on the. On the back of the beast also rides the whore, right? We talked about, like, Mammon and Aphrodite collaborating. So the whore rides on the back of the beast. So it's like licentiousness and trade and. And greed and all this stuff is what. Is what the beast uses to. To rise up. Then when it's in power, it kills the whore. By the way, just so you know, all this fun is gonna. It could end at some point, right? So that's one image, right? But the other image is the heavenly Jerusalem. And the heavenly Jerusalem is a city with a tree and water in the center, right? And the lamb. The lamb that is like the sacrificial victim in the middle. And then around it is this glorious wall that's made of gold and jewels and everything. And so it's like. It's an image of technique, of technique. It's an image of the technical. And then in. And then all the nations of the world, they basically gather their glory up into this city and they offer it up to the land, right? They offer it up to something which is not a king with power, but something which is giving. Something that gives itself is a good way to understand it. And so it's like. It's a different image. So you have these two images. It's really amazing, these two images that represent, like, the. The totality of what these two narrative strains can. With this narrative strain could give, like, these two opposites. And so that's my model for thinking about how it is that this can become. So, like, if the beast speaks, right? So if the machine speaks and it speaks with all this, like, all the horror behind it, like all the. The desire for greed and lust and all this. That stuff behind it, then people will worship it, but it will dominate them, right? It'll ultimately dominate them. There's no way. But if there's a way to have this technical thing as a place for us to gather all that is good into it. Right. To gather all the good and to offer it up towards something higher, then that is also possible. I just don't see, at least now I don't see strains of that. But. But I mean, maybe you can convince me differently."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2213.71,"end":2369.88,"speaker":"Jordan Hall","text":"Oh well, I can definitely tell you I see strains of it. Yeah. I am having conversations two or three times a week with individuals who oftentimes frankly a little bit confused, are finding themselves guided by. The most important piece is they find themselves guided by something that is higher than themselves. They don't necessarily know what they're doing or what that means, but they are increasingly choosing to be acting in that way and they're noticing that as they do that certain sort of strains or tones become more and more consistent and more clear. You mean it's a lurch, right? It's a hands reaching around, but it's happening. Yeah. That's what brings us to the point like how, how when one might imagine that it was going to be thus. Right. Very few people have been holding a profound level of clarity and purity in the context of say the past. Let's go 100 years. But we could go back again. Yeah, thousands of years. But again it's more fundamental. Right. So it's like this space where things were so. Have been so confusing and so intense, has almost like shaken certain things free. And a number of people died by no means even close to the majority of those who are working in this space, certainly in the world, are nonetheless endeavoring. And so this gives rise to me two inquiries. Actually, let me back up, I'm gonna step back because it seems to me there might be some utility in sort of telling the story through a number of different languages so as to create a larger space for people to have an entry point to be able to get into the story. So a variation on the story that you told then. This is literally the way that I've been telling it with. How do I say? By my own crazy and not particularly well considered approach. So this is just how it's been coming to me. You know, this notion of technology, this notion of the capacity to use the faculties inherent in humanity to foreground and optimize certain aspects of the larger whole at the cost of always breaking relationality with the larger whole. This is the genie problem at every level produces almost inevitably and multi dimensional arms race. So agriculture produces an arms race as of course, does military. Yeah. And in particular I've been calling it the devil's bargain, which is before I had any real set of the appropriate language to use. So maybe it's a demonic bargain, but it's a, it's a deal. Right. The deal is very straightforward."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2370.04,"end":2370.36,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2370.52,"end":2377.88,"speaker":"Jordan Hall","text":"Deal of. If you play the game the way that I'm offering to play, you get to win vis a vis your neighbors."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2377.88,"end":2378.28,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2378.36,"end":2383.48,"speaker":"Jordan Hall","text":"And if you don't, by the way, here's the downside. If any of them choose to take my deal, you lose."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2383.8,"end":2386.44,"speaker":"Jonathan Pageau","text":"That's right. That's the right way to see it. Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2387,"end":2392.4,"speaker":"Jordan Hall","text":"And once you're on that, once you're on that arc, you're. You're going to be living the history that we've been living."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2392.4,"end":2392.8,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2392.8,"end":2413.34,"speaker":"Jordan Hall","text":"It's just, it's a one way trip. You know, you're. You exited the garden of Eden. You're now playing, you know, one dude did a deal with the devil. Everybody's riding that train until you get to the end. Now this raises the question of was it always already just a category error? Like was the entire journey a mistake or is the journey actually part of something larger?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2413.82,"end":2421.74,"speaker":"Jonathan Pageau","text":"The entire journey of civilization? Pretty much, yeah. Yeah, that's the right. I can't believe you're asking that question, but that's the question to ask right now."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2422.3,"end":2434.46,"speaker":"Jordan Hall","text":"Yeah, I mean, it's a question I think is quite, probably quite reasonable to be perfectly quite reasonable question. And by the way, I think more and more people will nod and go, yep, all right, it's a valid question over the next seven point."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2434.46,"end":2436.3,"speaker":"Jonathan Pageau","text":"That's right. Next few months."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2436.38,"end":2446.86,"speaker":"Jordan Hall","text":"Like, yeah, all right, so that's that part. So. And we can, if anybody wants, we can, I can play that style of language which is led to certain kind of minds."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2446.86,"end":2447.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2447.5,"end":2455.17,"speaker":"Jordan Hall","text":"And probably three or four other versions. And they're all more or less going to have the same topological characteristics. And a typical story you just gave."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2455.24,"end":2455.52,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2455.52,"end":2505.01,"speaker":"Jordan Hall","text":"So listening to the biblical story, there's a bunch of things that come up. I'm like, oh, yeah, okay. That's like, I hadn't, hadn't heard that part of that part. Had a different relationship now. Okay, all right. Now I want to bring Michael in particular into the story because I have a sense this is just like an intuition that there's a relationship. Like if I think about these two, the beast in Jerusalem right here in the middle, coming from this direction, right at the front is Michael. Something like that. And so the, what is the nature of that? What would it look like to try to consciously or properly choose to be in service to and to bring forth the principality of Michael, which feels to me either A, something that I'm particularly oriented towards, or B, is a particular moment given the shape of the conflict."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2505.01,"end":2533.19,"speaker":"Jonathan Pageau","text":"Yeah, well, that this, this is. People aren't going to like this. But the solution is that you have to not focus on Michael. The solution is that you have to worship God. Like you have to. You have to focus your attention on the highest good. And that's when things lay themselves out almost automatically in the right, in the right order. If you try to bring about St. Michael, then you're. You might be surprised at what shows up. It might not be him."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2533.35,"end":2534.58,"speaker":"Jordan Hall","text":"Right, okay."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2535.06,"end":2542.9,"speaker":"Jonathan Pageau","text":"Between an angel and a demon too, is that the angels serve God, whereas the demons are parasitic, like all the way through."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2543.38,"end":2561.63,"speaker":"Jordan Hall","text":"So if you, if you were to endeavor to do so, what I just articulated, basically, Michael, the best case scenario is that Michael would go, yeah, that's right, that's right. You said something a moment ago that I think is actually, let's make it, let's like inscribe that. I'll just make it a proposition."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2561.63,"end":2562.11,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2562.11,"end":2583.55,"speaker":"Jordan Hall","text":"Where we live now, it is extremely important to be carefully indifferent to the degree to which you don't like something and ex utterly committed to what is in fact true and right. And so. Okay, fair enough. People don't like the notion of you need to worship God. If that is in fact what is true and right, then that's what we're going to need to do."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2583.71,"end":2584.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2584.75,"end":2593.35,"speaker":"Jordan Hall","text":"So I'm going to allow myself to not be troubled by the fact that some portion of me doesn't like that because I am actually very clear that what is right and true has to be the guiding."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2593.35,"end":2593.79,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2596.75,"end":2636.8,"speaker":"Jordan Hall","text":"By the way, you've provided me personally with some of the best ways of thinking about it. I think in the conversation you have with John around, what was it like? You had a narrative of talking about, like the family dinner, dinner, you know, the communion. And each one of these is a, is a, is a pointer. And the point is that you can then orient. You can notice you can be, oh, wait a minute, it's a pointer. What's it pointing towards? And then you can realize that it's pointing towards not something. Right. Because now we're getting into the notion of mystery, but it's pointing towards an orientation. It actually is a way to orient and. All right, so there we go. Well, that's pretty simple. I guess we're done. Everybody just needs to get over themselves. And worship God properly."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2636.8,"end":2765.88,"speaker":"Jonathan Pageau","text":"That's right. And then, and then it'll all lay itself out. I mean, I mean the worst part is that in some ways I know that that's true. But like, but it also doesn't mean that we like, it means that this is what's difficult about being a Christian in some ways is we look at this story also. This, even this image of like self sacrifice, right? The idea that, how can I say this? Almost the idea that if you, if you accept to die, like to a certain extent, that will be the seed for the world. Like it will actually make the world exist. And I hate that. Like, I hate, I just don't want to do that. I don't want to do that. And so when I look at the stories, I can see it. Like I can see that that's what happens. And when you meet people that are, that have a true self sacrificial spirit, you can see it in them. Right? You can see that through their kind of desire to serve and to give themselves, they become an opening for things to exist. Right. You know, the simple thing is like I think about my parish, like my church parish now, we, for years and years, nothing worked. Nothing worked. And all it ended up taking was just a few people. Like just a few people that gave themselves without measure and they, and nobody even really notices. Like I mean some people do. I notice that everybody sees how everything's going well now. Everything is, everybody is, everything is working well. And you see there's this like secret is that there's just a few people that were willing to basically just give themselves completely and not think of their own, their own selfish needs. And so it seems like that mean maybe those few people that you said, like if you have a kind of remnant of tech people, like a little core of them that are like even, you know, the. Who's that Google guy who just quit his job or whatever. Like if there's a few people that kind of make gestures like that where they, they act in a self sacrificial manner in order to, to, to show what's important. And I think that that might be in some ways the only way for, for, for a new body to find form."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2766.28,"end":2782.7,"speaker":"Jordan Hall","text":"Yeah. Okay, so let's, let's hit on a very particular piece. I think the language, actually I used a language I coined a term I called infinitesimal courage. But I think the, the more proper term is actually just spiritual war, which is, let's go with Hinton and I don't know him at all. Right. I Know, Jeffrey, I don't know."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2782.7,"end":2786.22,"speaker":"Jonathan Pageau","text":"I think, I don't know the details of it either. Like I just saw that as a headline or whatever."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2786.3,"end":2817.09,"speaker":"Jordan Hall","text":"But this notion is going to be happening everywhere and it's more or less the same for everybody, which is to say this. Right. So something happened. He had a crisis of conscience, some insight. He's like, whoa, it's strong enough for him to pop from where he had been, which is a pretty significant thing at the level of your interior, like your, your sort of spiritual place that guides the choices. However, all of us have been subject to a lot of twisting and we've been engaging in deals with the devil at the micro and macro level for our whole lives, all over the place."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2817.09,"end":2817.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2817.73,"end":2843.11,"speaker":"Jordan Hall","text":"And so this creates all kinds of weird problems in the way that our choices are guided and the way that we make our choices is quite torturous. Right. And so while he, and by the way, I literally just mean everybody, while anybody may have had a transformational experience and had a reorientation of their spiritual interior by virtue of some crisis of conscience, the job is not yet even vaguely complete."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2843.11,"end":2843.59,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2843.67,"end":2850.87,"speaker":"Jordan Hall","text":"If you think you're done because you left Google and now you're kind of working at a non profit, you've probably still got like 85% of the work to go."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2852.23,"end":2854.83,"speaker":"Jonathan Pageau","text":"You got a lot of sins to atone for it there have a lot of."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2854.83,"end":2862.11,"speaker":"Jordan Hall","text":"And let's speak, like, what does that mean? Right. Sins to atone for love. A lot of, I think is actually a rectification of the language so people can actually."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2862.11,"end":2862.79,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2863.48,"end":2865.64,"speaker":"Jordan Hall","text":"Like when the word sin was always."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2865.72,"end":2870.36,"speaker":"Jonathan Pageau","text":"I know, but I'm doing it on purpose. Right. I'm being a bit of a."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2870.52,"end":2871.88,"speaker":"Jordan Hall","text":"We can actually do a translation right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2871.88,"end":2872.96,"speaker":"Jonathan Pageau","text":"Now that makes like."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2872.96,"end":2884.8,"speaker":"Jordan Hall","text":"What do you mean? Well, what I mean is sin is that separation from God. Right. Sin is to be out of the continuity of contact with the, the whole. Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2884.8,"end":2889.24,"speaker":"Jonathan Pageau","text":"With, with. Yeah, with this. Yeah, with the thing that binds. The thing that binds ultimately."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2889.24,"end":2889.44,"speaker":"Jordan Hall","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2889.44,"end":2920.05,"speaker":"Jonathan Pageau","text":"And you can sin at different levels by the way. You can, can sin, you can sin in your company when you're acting against the, the goal of your company and you're stealing from your company. Right. You, you can send it at all kinds of levels at the same. You know, it's not just about God, although that's the ultimate one. But you know, it's just means that whatever you're involved in, like whatever you're directed towards that you, you, you redirect the attention and the, and the. Let's Say the resources to something that is. That is not on the mark."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":2920.29,"end":3002.65,"speaker":"Jordan Hall","text":"Exactly. And now, and now what happens is, is that your. This finely tuned instrument, that is a human, has a bend in it. Right. Those resources got redirected to something that's not on the mark. Yes. Now your signal capacity to receive that signal of what is in fact the larger hole is off a little bit. So to atone for a sin is to do whatever is necessary to go back and repair those connections that had been broken or bent in the choices that were made in the past. Much of which means, you know, this is part of the Christian story, much of which is not going to be available to you as a human doing kind of like psychological work. And much of it is actually requiring a lot more than you can deliver. Yeah, certainly that's been my experience. So. So the point. Right. The point is almost as a message to everyone, a lot, almost everything, as far as I can tell, actually does land at the level of the spiritual transformation of individuals actually repairing and more and more coming together from that place, supporting each other in that repair. Yeah. Becoming more clear on this directionality. And, and then maybe, right then maybe there's enough. Right then maybe there's actually enough capacity to begin to do something that is coming from a very different orienting basis to say it kind of in a less theological language."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3002.89,"end":3098.5,"speaker":"Jonathan Pageau","text":"Yeah. So let me, let me, I want to put out the, the one case that, like a case study that to me is very fascinating, that is that the way that Elon Musk seems to be acting in this question, like the way, the way that he's acting. And, and I've been thinking about it quite a bit, and it's, you know, in some ways, like, I, I trust that at the outset he seems to have good intentions. Like, I want to put that out there. Like, I don't know him, but it seems like he has good intentions and that, you know, he warns against something and tries to prevent it from happening, really. But then when he reaches a certain, like when it comes to a certain level, then he thinks, okay, now I just have to fight it or I have to join it to fight it, or I have to create a virgin of it myself in order to fight this. And that is something that I'm still curious about. Like, how is that going to play out? Right. And so because, because, because he basically said that he in some ways is behind OpenAI. Like at. Not completely, but to some extent he's behind OpenAI. And then when OpenAI got sold to Microsoft, he's like, okay, well, now I need to start my own AI company. Right. In order to basically balance out the arms race. So that's what it seems like what it is. It seems like it's. There's an arms race and he has that kind of cold war thinking that the best we can do is make sure that the arms race is balanced all the way through so that we avoid apocalypse. And do you think I'm wrong when I perceive that that seems to be the strategy he's taken?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3098.82,"end":3108.76,"speaker":"Jordan Hall","text":"Well, let's. Actually, you just hit the word there at the end. What I would say is at the deepest level is operating from strategy. Yeah. Not operating from pure intent."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3109,"end":3109.76,"speaker":"Jonathan Pageau","text":"Yeah. Okay."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3109.76,"end":3171.12,"speaker":"Jordan Hall","text":"So go back to the folks who are part of your parish who have somehow been able to find a way to give themselves completely and in some sense the choices that are being directed from a higher location. My sense of it, and I think that I have, you know, a variety of different perspectives. I've also not actually met Elon, is that at the bottom he position believes that he is. He's making the choices himself, guided by his highest capacity to do strategy. Therefore, that piece. Right. The limitation of whatever his particular whatever is beneath his strategy, whatever is ultimately guiding his choices is imprinted. There's a lack of purity of intent in the things that he produces. And that plays out over time. So in some sense, the defection of OpenAI was. Was coded into its basic code because that was expressing itself through his. His intent in spite of himself, you might say."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3171.12,"end":3171.8,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3172.04,"end":3190.08,"speaker":"Jordan Hall","text":"And the only way he can get at it, so every time he produces something because that thing is conserved at the bottom. Right. It's like I give myself completely. Except for this part. Well, okay. Well, that part's the part that ultimately is going to play out in the thing that is produced. Something like that. That's my sense of it is I kind of. And I've been looking at it."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3190.16,"end":3229.2,"speaker":"Jonathan Pageau","text":"Yeah. It's hard to. It's hard to tell, but it's also difficult. It's also difficult to. To. To judge and to analyze because in some ways, you know, we have that, like, let's say I have that problem all the time. Like what, what he's. I, you know, I deal with that all the time. But me, it's like my wife, my kids, you know, my, my. How I schedule my time or whatever. And so I can see that I do that and that I pay the price for it, let's say. And then I have to create some compensation or whatever. It's like the difference between myself and him is that his, his position makes it. That his decisions have massive, world changing, changing results."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3229.68,"end":3230.08,"speaker":"Jordan Hall","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3230.32,"end":3231.2,"speaker":"Jonathan Pageau","text":"And that makes it."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3231.44,"end":3246.35,"speaker":"Jordan Hall","text":"And to make it kind of like that double loop of that problem of addiction is. And he's in the place where his, his decisions have such impact and import because the approach that he's taken, the strategic approach that he's taken has been successful."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3246.35,"end":3246.87,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3246.87,"end":3255.07,"speaker":"Jordan Hall","text":"Yeah. So if he's sitting there at the top of that mountain going, well, shoot, maybe I need to change something. How I've been acting. There's something on his shoulder going, come on, dude, it's fucking working."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3255.15,"end":3263.39,"speaker":"Jonathan Pageau","text":"It's like I'm dead literally at the top of the mountain. Seems like it's working more than a lot of the other stuff that people are trying to do. That's for sure."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3263.55,"end":3267.15,"speaker":"Jordan Hall","text":"That's for sure. So that's actually like almost the trickiest possible place to be."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3267.31,"end":3267.79,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3268.02,"end":3270.1,"speaker":"Jordan Hall","text":"Um, and I don't envy that at all."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3270.42,"end":3270.9,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3271.3,"end":3284.26,"speaker":"Jordan Hall","text":"By the way, I have this. Everybody does. So. Yes. You know the degree to which I, I, what do you call it? Fall into sin, to use that language? What, about 40 or 50 times a day, something like that? I mean, I'm talking like at a macro level that I can."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3284.26,"end":3292.02,"speaker":"Jonathan Pageau","text":"That's a good, That's a good orthodox, you know, like a good orthodox vision. It's like I'm pretty much sinning every minute or every five minutes. Pretty much."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3292.98,"end":3309.56,"speaker":"Jordan Hall","text":"Pretty much. Okay, fair enough. Like, that doesn't seem to be. And it's unlikely. I find it very, very unlikely that I'm going to sort of reduce that down to close to zero anytime and say, the next 50 or thousand years. So we're gonna have to figure out how to make that work."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3309.56,"end":3349.28,"speaker":"Jonathan Pageau","text":"Yeah, that's right. Yeah, yeah, yeah, yeah, yeah, yeah. And so. All right, so what's your vision? Because. What's your vision of this? Because you say you meet people, you see in your surrounding people that are waking up, you could say, to the, to the problem. Or that Realizing also that there's some agencies playing through this that they maybe don't want to be part of. They realize that the cat's out of the bag. Now what do we do? What are people's solutions looking? Like, what are they, what are they doing? Are they, Are they networking together? Like, is there a kind of secret society of, of programmers that want to build a good AI? Like, what. What's going on?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3350.03,"end":3378.71,"speaker":"Jordan Hall","text":"So there is, and I would say there's. There's actually two, two versions of that okay. The first version is sort of the more trivial, which is that there are many different secret societies. Let's get people. Because some of them are scientists, some of them are programmers, some of them are people who can marshal resources, working on. Are aware of the. Let's just say are aware, for example, of the difference between intelligence and wisdom."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3378.95,"end":3380.95,"speaker":"Jonathan Pageau","text":"Yeah, okay, already. That's something."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3381.19,"end":3381.83,"speaker":"Jordan Hall","text":"That's something."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3381.91,"end":3382.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3382.31,"end":3481.25,"speaker":"Jordan Hall","text":"And are noticing the importance of actually grounding in wisdom in all ways, like in themselves and also the things that they're trying to deal with and to bring that into the world. Right. So that's. So there's. Yes, there's. That's sort of a common tone that I'm seeing as a kind of a sign, like, oh, you know, you're. You're oriented. You get this distinction and you're noticing what that distinction means. That the difference that difference makes. And there's a collection, there's a grouping or a finding and connecting and a kind of a networking. And by the way, it's interesting because it's disparate. They're not connected into a meta group. They're sort of. And it seems like there's almost a reason for that. Like it's good or healthy or appropriate for them to be different or disparate at this point. And then there's a second kind. And I've been calling this the invisible conspiracy. I think there are better terms for it, but it more or less. Well, I mean, I'll be very clean. If you propose there's a transpersonal agency and that the proper way of making choices is to become attuned to and be able to be in service to that transpersonal agency, then literally everybody who's doing that is part of a conspiracy. And the most. In the most fundamental icon spirit. Right. They're actually literally inspired. Yeah. They're coming from the same spirit. That's also happening now. In some sense, Group one is a subset of group two. In some sense, the people in group one are, as I said, more and more aware of that fundamental way as what's guiding their choices. But not exclusively. Many of the people who are in group one are actually literally still saying, no, My mind can figure it out. Like, I worked my way through this. I've got this term wisdom. I can think my way through it, which, you know, everybody's got to go through their process."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3481.25,"end":3481.69,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3482.96,"end":3563.71,"speaker":"Jordan Hall","text":"But that second group is, I think, what's the more likely to actually be the thing that works. If you think about it, like, it makes sense why that would be so in that case, it's a very unusual thing because now it's not strictly limited to competence or where you're working. The fact that you're a. You make bread, but you're part of the invisible conspiracy. Well, you're part of the invisible conspiracy. And that's more important. Like whatever. Whatever role you're playing is the role you're supposed to be playing. And it may be, by the way, that tomorrow you're going to realize that you're not supposed to be making bread, you're supposed to be doing something else. Does the kind of. The. The way that I've noticed it or it's like I've seen it or it's visualized is like that metaphor of an instrumentality. I have just to some degree, a clarity of instrumentality in myself. Right. Some clarity of thought, some relationality with my. The way my body works, etc. And that gives me some degree of attunement to this transpersonal agency, for example, and that. And that's that kind of the spiritual clarification process, like getting that more and more fully worked through. And let's say, for example, you are doing the same kind of thing. And then there's the We. There's something about what's the process whereby I get a signal that orients my attention towards. I should talk to Jonathan Pagio about angels in relationship with AI That's a."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3564.27,"end":3565.63,"speaker":"Jonathan Pageau","text":"Okay, that's a weird thing."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3565.63,"end":3601.75,"speaker":"Jordan Hall","text":"Yeah. What's even going on there? Like, how is that happening? Well, that's a different level. Like, it's the same. It's the spiritual clarity or the attunement process, but it's happening at a large. At a different level of. Of being. There's actually a. A movement of embodiment. If you think about it metaphorically, if I think about like a stem cell, the stem cell is going through. At least it's actually going through three processes. One is becoming a particular kind of cell. Right. So that's the spiritual clarity in yourself. There's the coming into relationship. And by the way, literally the physics. Spatiotemporal location. A heart cell needs to go towards heart."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3602.07,"end":3602.43,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3602.43,"end":3604.23,"speaker":"Jordan Hall","text":"A brain cell needs to go towards brain."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3604.23,"end":3604.79,"speaker":"Jonathan Pageau","text":"Brain."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3605.03,"end":3608.95,"speaker":"Jordan Hall","text":"Right. It doesn't do any good to be a brain cell sitting around in the lower. The lower intestine."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3608.95,"end":3609.35,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3609.99,"end":3655.21,"speaker":"Jordan Hall","text":"So that's like a re. Reorganization, like a coordination. Like how do we find our right place? Which in this world doesn't necessarily mean physical co. Location. It means creating the appropriate relationality and in the right order. And so something like that. So that's the second order. That's like the. This one is me becoming the kind of cell I'm supposed to be. The second is me finding my proper location in the larger body of what is in fact incarnating through us. And then the third is the reciprocal spiritual clarity of that larger body. Right. It becoming more and more clear in itself as it becomes more incarnated. And you can imagine, like, the way that a baby is born. First it, like, has to build a body, then figure how to actually run a body."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3655.21,"end":3655.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3656.17,"end":3680.15,"speaker":"Jordan Hall","text":"And that is, like, that's a. That's a loop. And I think as you. Yeah. The kind of mystery of this question of technology is part of it. Like, part of what's happening is we're also trying to discover how do we actually integrate techne into this art incarnation in a fashion that is, in fact, let's just call it appropriate. Like it's actually, well, not sinful, to use the other way of languaging."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3680.39,"end":3759.98,"speaker":"Jonathan Pageau","text":"Yeah. And that. That's. I mean. I mean, what you're saying is, is. Is. Right. And that really does seem to be, in my estimation, the image of. The image of the heavenly Jerusalem. Like, that seems to be what it is because it's not just techne, it's also civilization, like, that's being gathered up. Right. It's being kind of gathered appropriately in the right. In the right. In its right place. Towards. Towards. And so, I mean, it's. This sounds. How can I say this? This sounds esoteric, but it's not esoteric in the sense that you can understand it. Just like cars are a great way to understand it. Like, because cars have that problem where people worship cars. Right. Where people, like, fall in love with the car itself and will, like, dedicate their love and attention. And you have the image of the recently retired gentleman who spends all the Saturdays washing his sports car. Right. And so, like, you have this image of someone who, like, worships the tech and just basically gives himself to it. And then you have the idea that cars are great to do things. Like they're great to serve higher goals, higher goods. And if they were just a simple alignment problem. It's just a simple. If it's just aligned properly, then all of a sudden the carby can become a wonderful thing that serves the. The good of what humans can accomplish."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3760.3,"end":3765.02,"speaker":"Jordan Hall","text":"Yeah, nice. Like, what I was seeing, there was actually two. Almost like a. This shape."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3765.42,"end":3765.86,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3765.86,"end":3784.46,"speaker":"Jordan Hall","text":"Where the. That. That term, like, so love. Either the relationship of deep care for car. Right. If it's for car qua. Car. Ultimately, as you say, it's like it's demonic, right? It's. You're becoming addicted to something. The whole point is your capacity for love is actually being pulled. Pulled down."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3784.54,"end":3791.1,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And it could not be just the kwakakar. It could. It could be car qua. Getting laid. Like, just getting laid."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3791.1,"end":3791.9,"speaker":"Jordan Hall","text":"Of course, absolutely."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3791.9,"end":3802.22,"speaker":"Jonathan Pageau","text":"So it's like there are all the stacks. Exactly. There's all these, like, secondary things that we engage with that. That. That. That don't provide enough to. To sustain the world, let's say."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3802.7,"end":3809.18,"speaker":"Jordan Hall","text":"And then. But if. If I. If I take a different frame and I'll use monastery or cathedral. You know, there's."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3809.18,"end":3809.5,"speaker":"Jonathan Pageau","text":"There."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3809.75,"end":3822.31,"speaker":"Jordan Hall","text":"If I would, like, look at the two guys. Like, I look at the guy who's kind of building the cathedral and I look at the guy who's sort of taking care of his Ferrari, that's making a very nice guy. And I'm like, huh? There's a lot similar, right? There's a lot similar."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3822.31,"end":3823.27,"speaker":"Jonathan Pageau","text":"That's right. That's right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3823.27,"end":3867.16,"speaker":"Jordan Hall","text":"Yeah. Well, the difference is the guy who's building the cathedral is pointing up. Right. The whole point is you say, oh, well, the cathedral is an aspect of God's creation and therefore is perfectly due the full care that I can give it. Like even more care than you're capable of giving the car. But as such. Right. As an aspect of God's creation. Right. And so if I'm in that relationship and the car happens to be. Of course you should treat everything with care. Yeah, that's obvious. Like you should treat the tree in front of you and you should treat the kid that you is walking down the street and the duck. Right. Everything should be treated with the utmost care because it's all part of God's creation. Okay, now it's. Now you get. Oh, well, that makes like. In some sense. That makes sense, by the way. Tricky, hard to do, but it's, you know, straightforward."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3867.24,"end":3930.98,"speaker":"Jonathan Pageau","text":"Yeah, it is, right. It's tricky, hard to do, but it's straightforward because. And it. And it had. The reason why it's tricky. And this is. Maybe it's a simple key is because it's increase in power all the way through. And it's like we don't deal well with that. Like when the. When we have increase in power like that, it's so easy to misalign because you all of a sudden you become superhero. It's like you have all this capacity that you didn't have before. And so all of a sudden, like your Your capacity to. To. To, let's say, accomplish your ill goals is increased too. Right. It's like, so if I have a million dollars in my bank account, all of a sudden it's like, oh, wait a minute. I can, you know, I can do all these great things for my family, but I could also buy a whole lot of crack or I could buy a whole lot of whatever it is that my addiction is, where it is. And you know that, right? Because people win. Win the lottery, it usually ruins their life because all of a sudden it's like massive amounts of genie power and. But not well aligned. So everything kind of falls apart. And that's what tech is. Tech is always just increase in power."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3931.54,"end":3954.26,"speaker":"Jordan Hall","text":"Nice. Okay, so let me glue these pieces together. We have a power. We now have a power which is sort of clearly beyond our capacity, or many people are aware of the. Of the possibility that we're talking about a level of power that is not the kind of thing that we're going to be able to deal with with the way we are. Actually, I'm gonna back up one step because I just saw the. The trailer for Oppenheimer."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3954.26,"end":3955.82,"speaker":"Jonathan Pageau","text":"Yeah, okay. Yeah, I haven't seen it yet."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3955.82,"end":3976.75,"speaker":"Jordan Hall","text":"Yeah. And it feels like there was actually a legitimate raising in consciousness. Like, oh, we don't actually know how to deal with this. And when nukes showed up, there was a. Oh, boy. We have to actually develop a new capacity to be able to deal with at all this level of power. Yeah, it's been touch and go, right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3977.71,"end":3982.75,"speaker":"Jonathan Pageau","text":"It's more on the go right now because it's like it's right at the door and nobody seems to be talking about it."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3982.91,"end":3986.11,"speaker":"Jordan Hall","text":"We seem to have a weirdly looking the other way, really."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3986.11,"end":3994.27,"speaker":"Jonathan Pageau","text":"Just forgotten that there are all these nuclear weapons and that there's literally a war with people that have them. And we're bombing the Kremlin. It's like, what are we. What the hell is happening?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3994.67,"end":3996.75,"speaker":"Jordan Hall","text":"Right. Well, that's. Okay, well, that'll be a different conversation."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3996.75,"end":3998.35,"speaker":"Jonathan Pageau","text":"Yeah, that's a different conversation. Sorry."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":3998.59,"end":4069.03,"speaker":"Jordan Hall","text":"You can see like Sauron's going. Yeah, that's all right. But this new thing, right, this new AI thing is even like more sort of. Whoa. We're talking about intelligence itself, man. Talking about something that is. It's, you know, every day, like you said, like in three months. It's just. And so that feeling, interior. Wow. We're not prepared to deal with this. And it's. And I would argue, I mean, I do in fact very specifically argue, and we humans at this level, in this way can't. Right. It's not the thing. We're not. We're not the kinds of beings that have that capacity. All right, then I'm proposing that whatever is in the process of incarnating itself in this moment is. And that's the thing. Right? So it's. It's both. Right. So that you can look at it through the lens of. Well, you know, you can say sort of in a very legible fashion to. More. To my. More sort of rationalist, materialist friends, you have to have symmetry between wisdom and power at a minimum. And if we're looking at a magnitude of power over here, let's just call it X. Then what does it look like to constitute something that has the magnitude of wisdom at least slightly more than X? Let's just hold that as the problematic."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4072.55,"end":4122.03,"speaker":"Jonathan Pageau","text":"In the Bible, there's literally a story. The story of Solomon is about that. The story of Solomon is about God asks him what he wants. God. God acts as a genie in this situation. God says, what is your wish, Solomon? What do you want? One thing. Tell me what you want, I'll give it to you. And then Solomon says, I want wisdom. And. But then what does he do? He builds the temple. He makes a technical space. He makes a city. He makes a. He makes a technical space, but he does it after he's asked for wisdom. So because of it, it's sacred. It's a sacred space. So it's like, we tend to. We. Now we're in the opposite direction. Like, now we're. We basically made a deal with the devil. We've got all these. These things that are massively powerful. And now we're like, oh, we should have asked for wisdom. It's too late. Like, what do we do now?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4122.03,"end":4134.11,"speaker":"Jordan Hall","text":"It's like this is that scene from Monty Python, remember? Like, what is your name? And then he's like, wisdom."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4134.11,"end":4174.32,"speaker":"Jonathan Pageau","text":"Wisdom. Wait, I meant. I meant to say wisdom. It's too late now. Power. No, no, wisdom. It's like, all right, Too late. Yeah. So I don't know, but I'm happy to see, like, I do think that with that good wins in the end. But I definitely see a loop. Like, there's a. There's a. Anyways, I see a dark loop, let's say. Because, of course, the problem with AI is that it. One of the big problems now that I've realized that just. I just realized that in the last few weeks. And my brother also kind of caught on to that. I mean, he's a genius. Just caught onto it right away is that there's a relationship between AI and. And now, let's say absolute authoritarian systems."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4174.32,"end":4174.92,"speaker":"Jordan Hall","text":"Oh, yeah."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4174.92,"end":4218.36,"speaker":"Jonathan Pageau","text":"Directly, that is, directly in the sense that within three months, within a few months now, you will not be able to be. To tell between what's real and what's not real. And you won't be able to tell whether I'm talking to. Actually talking to Jordan hall or to an AI, you know, generated version of him. And so we will need government authorities to tell us what's real. Literally, they will have to. They will have to differentiate what is real. And so we basically, like, lined ourselves up to 1984 because we have to. If we don't, then we're going to all get destroyed by our incapacity. To differentiate reality from a liar, from imagination."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4218.76,"end":4222.52,"speaker":"Jordan Hall","text":"Yep. Or. Or. Or Jerusalem."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4222.76,"end":4228.92,"speaker":"Jonathan Pageau","text":"Yeah, well, you know, after. Maybe. Maybe, you know, it's like. Maybe."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4229.16,"end":4249.85,"speaker":"Jordan Hall","text":"Well, I think you. Shoot. Sorry, I have to. Have to jump on another call. And you said it nicely a while ago. Sorry, you're not going to like this comma. But. Right. And the. The. The. The sort of. The dark piece of the loop is the. Well, how dark does it have to get for you to get past the fact that you don't like it?"}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4250.01,"end":4250.65,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4250.89,"end":4260.97,"speaker":"Jordan Hall","text":"And that's how my life has worked. Right. I've very rarely learned anything truly deep and meaningful without fighting as hard as possible not to for as long as I can get away with it."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4262.25,"end":4277.14,"speaker":"Jonathan Pageau","text":"That's a great. Well, if you have to jump on another call, that's a great. That's a great way to end Jordan. That's awesome. Listen, I love this conversation. This was great. I really. I really appreciate it. And so we have to. Let's put it out and see how people react. Well, we'll try to. We'll try to get another one going soon."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4277.3,"end":4279.42,"speaker":"Jordan Hall","text":"Yeah, sounds good. Thanks for taking the time, man."}
{"episode_id":"SW - #292 - 2023-06-20 - Jordan Hall - Artificial Intelligence in Biblical Terms","start":4279.42,"end":4280.74,"speaker":"Jonathan Pageau","text":"All right. All right. Bye. Bye."}
