{"episode_id":"SW - #129 - 2020-12-10 - The Meaning of Goblins, Dwarves, Imps and Other Earth Monsters","start":0.8,"end":1080.69,"speaker":"Jonathan Pageau","text":"So this year I've already made a video on Halloween in general. I've also made a video on vampires as being a monstrous version of the hierarchy. And so, based on the poll that I put out on Twitter to find out which monsters people wanted, it seems like the imps and goblins and that kind of monster won out. Which is good because in a way, it will show us the flip side of the vampire. If the vampire is the monster of hyper hierarchy, then these imps, these goblins, you know, these pucks, these types of. These types of earthy creatures are in fact a symbol of the opposite. It could be the. The symbolism of the earth, we could call it, or the symbolism of potentiality. So we're going to look at that and see what we can get out of it. This is Jonathan Peugeot. Welcome to the symbolic world. And so it's a little difficult to separate some of these creatures because although in some stories they will have separate characteristics. Trolls, imps, hobgoblins, pucks, what are the other words? But even things like trolls, like fairies or elves sometimes take on the characteristics of these kind of earthy creatures. For example, the elf in Northern mythology, you know, this, the type that we find in Tolkien, is quite different than the Christmas elf. For example, the Christmas elf acts more like a Robin Goodfellow or a Puck or a hobgoblin than they do act as those elves. So we have to try to be careful about the naming and rather look at the characteristics and see what they show us. And in terms of symbolism, this symbolism is going to help people also understand how sometimes the same symbols can manifest in different characteristics, opposites of the same category. And so in these kind of earthly monsters, what you get is the symbolism of the. The harnessing of potentiality, you could call it. And so you can see the good side and the negative side of that. You know, the harnessing of that which is still in darkness. You could call it something like that, that which is still in potentiality, that which is still in the earth. All of these are related. And so these types of monsters, they'll, you know, for example, the gnomes, we know the gnomes and the trolls and all these types of creatures, often they are seen as the dwarves. Especially, you know, in traditional mythology, they're seen as being miners, people who are underground in caves. We see in the Seven Dwarves of Snow White, for example, we see an example of the dwarves that are working in mines. And so the dwarf working in a mine is there to find the treasures which are hidden in. In the darkness and to make use of them. You see that also in this idea that these, these creatures, often they are the dwarves, for example, are known for smithing. And so smithing is also related to that. It's kind of this capacity to take the metal from the ground and to harness it in order to create a form of technology. Now technology itself is related to this darkness. You could say I've talked about this quite a few times when I've explained that technology in the Bible, for example, comes from the descendants of Cain in Greek mythology. Smithing and weapons. And that kind of technology is made by Hephaestus, this kind of deformed half, this deformed God that is tossed out of Olympus. And so there's a relationship between the darkness on the edge and technology because it's, it's, it's. We use technology to protect ourselves from that darkness. So we gather the darkness. I've always talked about the idea of death turning against death. We gather the darkness, we gather that potential to build walls, to make weapons, to create things which will, which will hold back the darkness. So that's what you see in a lot of these monsters. And what happens is that you end up seeing the positive side and the negative side. In the positive side, you have these stories of what we'd called household spirits or household monsters, like hobgoblins and Robin Goodfellows. We see that story particularly. One of the stories that has remained very popular until today is the idea of the shoemaker and the elves. So in that story, the shoemaker goes to sleep. And during, while he is sleeping, there's work which is being done. And when he wakes up in the morning, then the work is already done. And there are many stories of that type of creature, Pucks and Robin Goodfellows, that will do household chores while it's darkness. And then when you wake up, there are the household chores. And all you need is to maybe put out a little bit of food in order for this creature to continue. But you have to be careful not to offend it. Or actually you also have to be careful not to praise it too much. So, for example, in the story of the Shoemaker and the Elves, the elves decides that he's going to stay awake. Instead of letting the elves, instead of letting the potential do its job, instead of letting the elves do their work, he, he decides to spy on them at night and to, to, to, to watch them and to figure out what they're doing. And because of that, he has this idea that he wants to thank them and in thanking them, he creates new clothing for them. And in creating new clothing for them, the elves cease to do their work. Now, what is that relating to? You can really understand it as the. The power of the implicit. There are some things which function implicitly in the way that we. That we work. Sometimes it can be, for example, a good example, which is a good example that we could use is for. Is the idea that, let's say you say you're a man and you meet a woman, and then all of a sudden this. The woman or the man, let's say the man is attracted to. To the woman and the man doesn't want to talk about it for whatever reason, maybe he's married, maybe she's married, or maybe, I don't know, she's a nun, or whatever reason. They work together and they don't want to complicate things. And so there is this implicit thing which sets itself up. And the implicit thing will create a dynamic which will possibly work to the advantage of one of those people. Maybe for the woman, it will actually work to her advantage. So she. She can actually get advantage from something which is hidden and implicit, which is kind of under the. Under the rug, you could say, but will still make it that that man, for example, will do special favors for her. Will, you know, will want to do a little more in order to help the woman that he finds attractive. And this continues to function all the time, that it's implicit. Now, if ever you put clothes on it, if ever you dress it up, and all of a sudden the man decides that, okay, he's had enough of this implicit kind of thing. He decides that for whatever reason he's going to declare his love, or in another way, the lady wants to call it out and wants to point out this dynamic, wants to point out the fact that this man is attracted to her, to him, or to people around in order to kind of make it public. And so what that's going to do is that's going to cease it from working. As soon as the man declares his feelings for the woman, all of a sudden, whatever advantage the woman was getting from this situation is going to be put in the spotlight. And if she reacts negatively, if she offends the man, then she's going to stop receiving that benefit. And the strange thing, which is probably something I should not shouldn't say, but the strange thing is that even if she acknowledges the man and, let's say she ends up marrying him, there is something of the power of that implicit dynamic which will go away the type of actions that a man will pose for a woman that he finds attractive, but that he's not in a couple with a woman he's trying to seduce, but not too much will be far, will be something that will actually somewhat cease to disappear when that couple is married. Sorry to announce that to a lot of you single folks, but that's how it works. And it goes the other way as well. The same for a woman who is trying to seduce a man. Once that implicit react, that implicit game goes away, then all of a sudden the. Some of the benefits of it will disappear. The. The advantages that come from being implicit. There are other advantages which, which come with a formal relationship. But that type of implicit work, you would call it work in the dark, will go away. So that is a way to understand that how these types of monsters represent the implicit, represent things that are in darkness still. Things, things that aren't quite actualized, that aren't quite out in the world. That's why, like I said, they represent technology. That's also why they are some, sometimes. Often they're represented as being mischievous as well. Because, you know, that is the thing about something which is still in darkness is that we don't know what it's going to do when it comes out in the light. You can see that in terms of technology. You know, when we put a technology out into the world, we often don't see the unintended consequences of that technology. And that can be viewed as a form of mischief. You could imagine something like that the dwarves who secretly designed the automobile while it was still implicit and revealed that automobile to men, they were secretly joking, they were laughing in their beards. Because although the man only could see the positive aspect of this automobile that would connect them and help them to traverse long and distant trips, they didn't realize that the automobile would ultimately be one of the factors that would completely destroy society in terms of communities by creating these cities with malls on the one end and all these houses where you work a half an hour that way and you go to church 40 minutes that way. And you end up moving around without interacting with the people near to you. And so that is the mischief which comes from the implicit as it is made explicit. So you can see the different aspects of this kind of things coming from the earth and what they do. One of the things that can happen is also a type of obsession when we think about the treasure which comes from the implicit in terms of money. Money is complicated and gold is a complicated symbolism. Because on the one hand Gold can represent glory, but on the other hand, gold can also represent potentiality. And it's the same with money. Money is a complicated thing because it's, it's actually, it's a. It is, in some respects, it is potentiality. That is, it only has value to the extent that it can be traded for something else that is useful. Gold, for example, in itself is, it's becoming useful now because of technology. But let's say in the ancient world, it was useful for making jewelry, it was useful for doing that type of stuff, for ornamenting, for creating beauty, creating glory. But in itself, you know, you couldn't make a sword out of or a plowshare or anything that you actually used out of gold because it was too soft. And so that is also the idea of money. And so the notion of these monsters that are obsessed with gold or silver, obsessed with money in the sense of this potential value, is something that we see coming in the stories over and over again. And if in the video that I made about, about vampires, I put a quote by Karl Marx to show you that, you know, Karl Marx, he, he, he was a kind of satanic prophet in the sense that he really had an intuition of what things were. It's just that his intuition was kind of upside down and he wanted this power of darkness to rise up and take over the, the hierarchy. And so, so Karl Marx says in the signs that bewilder the middle class, the aristocracy and the poor profits of regression, we do recognize our brave friend Robin Goodfellow, the old mole that can work in the earth so fast, that worthy pioneer the revolution. And he sees these goblins, these imps and goblins and monsters rising up as an image of his revolution. And so he wasn't completely naive about what was going on. He, he actually had quite a weird prophetic understanding of the world. It's just that it was quite upside down. And so in that sense, you can understand what these, let's say, earthy monsters are representing and why. If you look at different traditions, these types of monsters, like, sometimes they're called fairies, but they're fairies in the sense that. Or trolls. They're fairies in the sense that they are related to the land or to a place. They're kind of like the spirit of the land itself rather than. And so you have to be careful when you build on this, that you don't bother the spirit of the land, that you don't offend the spirit of what's hidden there. And you can understand it in that sense. It's like you don't actually know what, let's say tilling a certain land or building houses on a certain, in a certain place will give what it will produce in the future. And so if you offend the spirit of the land, then that action that you're taking on the land, whether it's building or doing whatever, will possibly turn against you and will create more mischief than it does anything positive. And so what's important and when I talk about the kind of duality, you can see that on the one hand, these kind of impish Earth monsters, they are the source of a lot of technology, of smithing, like I said, mining all of this, which is related to technology. But on the other hand, they are also the negative side of technology. The, let's say also the breakdown of technology. We see a recent version of that, of course, in Gremlins. This, this little monster that appeared during, I think it was during World War II that it appeared this idea of when a. All of a sudden they had these war machines that had technology, airplanes, tanks, all these mechanized war machines which before were, were not as present. And so the idea that there are these, these types of goblin creatures which are the cause of their breakdown or the cause of the accidents which are related to, to these kind of machines and this kind of weaponry is very interesting because like I said, you can see both sides. You can see how they are the cause, but they are also the cause of the breakdown. There. There are. Or you could really just see it in the sense of the positive aspect and the negative aspect of trusting in this potentiality which is not yet explicit. So I hope this makes sense. So please write down in the comments, your interactions, your ideas about, about these things because I just want to keep ramping it up as we continue. So thanks for your support guys and I will see you soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube Chann. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
