{"episode_id":"SW - #062 - 2019-10-05 - Time","start":0.32,"end":134.77,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'll be playing for you two videos back to back that I put up a few months ago that are related to how time and space interact with each other, how they kind of. They kind of affect each other, how they tend. They can even destroy each other if one has too much emphasis. And these, these videos were definitely prompted by my own situation that for those who don't know, a few months ago my house was flooded and my family had to leave in a catastrophe. We've been moving around ever since, and we have not reintegrated our house since then. It happened in April. And so we really are in this moment of strange transition and we've been kind of put out into the world of transformation and change. And so it has brought me to think about, you know, because the flood happened after a dike broke, and so thinking about walls, how walls prevent change. And also looking at time tends to eat at the walls. Time tends to eat at stability, you know, by decomposing it. So, anyways, a lot of thoughts related to that. So, as you know, everything I'm doing here on the podcast and the videos that I make is all thanks to your support. So please consider going to the symbolicworld.com support where you will find ways that you can help out the podcast. Everybody who gets involved, they have access, early access to some of the videos. There are all kinds of different tiers. You can ask early questions on the Q and A. There are also tiers where you can have private discussions with me and also enter into these group discussions that I'm having privately with people. And ultimately, though, for all tiers, I'm making one extra video a month, which is an interpretation of. Of a traditional story, a myth, a legend, or a fairy tale. So I've been having a lot of fun making those, and so I hope you can enjoy them as well. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":145.18,"end":162.22,"speaker":"Jonathan Pageau","text":"The reason why it's so difficult to understand the question of the relationship between time and space is because what I think is happening is that because they have to coexist, you can't have just time and you can't have just space. They are interlinked in the way that they manifest themselves."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":163.73,"end":166.45,"speaker":"Jonathan Pageau","text":"It's very difficult to talk about just one side."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":166.61,"end":168.57,"speaker":"Jonathan Pageau","text":"And so as I talk, and so."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":168.57,"end":171.57,"speaker":"Jonathan Pageau","text":"I decided to do it in two videos because when I tried to see."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":171.57,"end":184.97,"speaker":"Jonathan Pageau","text":"Both sides at the same time, you know, just talking about one is enough to fry your brain, but talking about both is almost impossible. And I think that's why I've had so much difficulty understanding it in the."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":184.97,"end":186.93,"speaker":"Jonathan Pageau","text":"Past, because I would always try to."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":187.09,"end":238.72,"speaker":"Jonathan Pageau","text":"Focus on one side and. And I've seen authors that talk about this notion of time devouring space and others that talk about space replacing time. And I think that actually what's happening in the modern world is both at the same time. The way to understand it is to understand the modern world as a deincarnation. I've talked about this before, to understand it almost as heaven and earth separating from each other. And because that happens, it sends the world into a kind of pendulum where the world tends to swing between two opposites. And one of the opposites between which it tends to swing is the effects of time and the effects of space, a radicalization of both. And it's almost like a war between the two to see which one is going to win. As one takes a swing, then the other does as well."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":238.88,"end":240.84,"speaker":"Jonathan Pageau","text":"But today is our video to talk about space."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":240.84,"end":308.63,"speaker":"Jonathan Pageau","text":"And so that's what I'm going to do. There's a legend that says how Alexander the Great, at the end of his conquest up in the northern parts of Eastern Europe, in the Caucasian, in the Caucasus area, he built what's called the Caspian Gates. The Caspian Gates were supposed to be these huge iron gates that were built in order to stop the Gog and Magog from. From pouring into Europe. And Gog and Magog, although they have been later characterized as these kind of demonic figures, and rightfully so, they were originally seen as these nomadic tribes that live on the steppes in the north of Europe. And so the Mongols, the Khazars, the nomadic tribes, would actually do that, would come in and would wipe out civilizations. Of course, one of the biggest examples is when the Mongols destroyed Baghdad and also when the Huns poured into Europe and came all the way to the steps of Rome."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":309.19,"end":311.59,"speaker":"Jonathan Pageau","text":"The nomadic tribes, because they don't care."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":311.75,"end":341.9,"speaker":"Jonathan Pageau","text":"About stable space, they don't care about civilization, they have this desire, they have this capacity to wipe things out and to completely destroy things. The Mongols would have this notion that they would return the land back to grazing, you know, would return the land back to this stable plain, you know, where the animals could graze. And so it really is this destruction of space by time. It really is the nomad, the nomadic spirit, coming in and wiping out time."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":341.9,"end":344.22,"speaker":"Jonathan Pageau","text":"But the building, but there's also this."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":344.22,"end":352.86,"speaker":"Jonathan Pageau","text":"Interplay between the two sides. And so civilization and space pushes against the chaos."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":352.94,"end":354.99,"speaker":"Jonathan Pageau","text":"Of course, the dyke which I'm standing."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":354.99,"end":374.59,"speaker":"Jonathan Pageau","text":"On is a great example of where we Build a dike on the side of a river. And this flowing river, this flowing water is stopped from coming in and from destroying and destroying, but also renewing, also restarting things. Because obviously that's what happens."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":374.59,"end":375.99,"speaker":"Jonathan Pageau","text":"And I'm seeing it in my own life."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":376.23,"end":414.72,"speaker":"Jonathan Pageau","text":"Now that the water has come, everything is up in the air. It's interesting to go through it. Everything is. You know, even my sleep rhythms have been affected. I didn't sleep at all last night. And then yesterday during the day I was so tired and I fell asleep. So my whole rhythm is completely out of whack. And that's what I mean, that's what chaos does. That's what chaos is. But the notion of space as pushing against uncertainty, as pushing against the indefinite, is something that the modern world is very strongly about. Now we have to see it in the modern world as all these systems."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":414.8,"end":417.76,"speaker":"Jonathan Pageau","text":"All these systems where there's a strange."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":419.68,"end":420.32,"speaker":"Jonathan Pageau","text":"Permanence."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":420.32,"end":423.28,"speaker":"Jonathan Pageau","text":"It starts of course, with the possibility."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":423.28,"end":436.05,"speaker":"Jonathan Pageau","text":"Of writing down language itself, because language naturally exists in its oral form where it just flows into time and it has a more non material reality. But as you write it down, then."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":436.05,"end":437.73,"speaker":"Jonathan Pageau","text":"It starts to inhabit space."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":437.97,"end":445.01,"speaker":"Jonathan Pageau","text":"It starts to create a kind of permanence to it. And now we've seen a radicalization of that permanence. If you think a little bit about."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":445.33,"end":446.73,"speaker":"Jonathan Pageau","text":"How on the one hand I talked."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":446.73,"end":706.74,"speaker":"Jonathan Pageau","text":"About the Internet as reducing space into time, there's also on the Internet a capacity to make permanent every single possible thing about you. This notion that whatever it is that you do online is never going to go away. It has been completely made permanent. You know, when we were young, in the movies, they would talk about, you know, this is going to go on your permanent record. Well now everything you do online goes on your permanent record. None of it goes away. And so that is something that you have to, that is something that we have to consider the same in the modern world. The very notion of the nation state is something which is very modern. The notion of a clear border between two states. This is something that did not exist in the ancient world. Rather there was a kind of hierarchy where, you know, a powerful nation, let's say a powerful empire like Rome, would have a central city and then would have other secondary cities. And identity would flow from these cities. And then on the borders on the margins would be intermediary places of mixture, places of indefinite space. This kind of no man's land between the two empires. So in the notion of the nation state, what we have is this clear, you know, razor sharp border between states and what has happened is that all the no man's lands, all the ancient places of indefinite space have been eliminated. The entire world has been mapped out and everything has been delineated and defined. There is no more. You know, Even until the 19th century, there was this notion of the kind of, you know, a dark. A dark space in the middle of Africa. But now it's all gone. All we have. We have eliminated all the vagaries, all the places that are undefined, and we have completely, or as much as possible, stabilized space. And science itself is. Is in a way to science, you could say science is there to kill all the dragons, to kill all the indefinite creatures, all the indefinite categories which exist on the borders of reality, and to categorize everything, to name everything, and therefore to map everything. The notion of the map is probably the best way of understanding how this space has now gone all the way to the edge. You know, usually a long time ago on maps there was the there be dragons part of the map. And now we have eliminated the there be dragons. We have this sense that there is no room for uncertainty. And it's the same with the nations as well. There is no room for change. These nation states, some of them are quite arbitrary. But we have this sinking idea that the borders of these states cannot change. They're not allowed to change. And we can't totally justify why. If we think about it, we can't imagine that all these states are going to be the same forever. But we also know that as we have built up these very, very clear, clear borders, the stakes of the changing of these borders is very high and is measured in war and is measured in death. And so, as while on the one hand we have this notion of time which is devouring space, the modern world is also at the same time represented by a kind of radical space where permanence, this strange permanence, comes to exist. And you know, this whole idea, for example, that you have these identity cards so that you have a name which is inscribed in the government, all the state powers which give you your Social Security number, all these things which are these fixed things about you that are kind of given to you at birth and that you have forever and are impossible to change. And so those are the counterbalance to the other side of the metal."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":707.95,"end":708.87,"speaker":"Jonathan Pageau","text":"So I thought it would be something."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":708.87,"end":710.99,"speaker":"Jonathan Pageau","text":"That would be interesting to think about."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":711.15,"end":713.99,"speaker":"Jonathan Pageau","text":"Because as I said, I really do."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":713.99,"end":876.75,"speaker":"Jonathan Pageau","text":"See the modern world as a deincarnation. And I see those two sides as ramping up against each other. And the Internet is the Best place to see it. What at first was the Internet was touted as being the place of freedom, the place where anything goes. Then in order to counter that, systems were created for the Internet to become the very opposite, a system of control that has never been seen, the likes of which has never been seen in the history of the universe. And so those two things are happening at the same time. This kind of push towards a fluidity, an anarchy, a breakdown of categories, and at the same time, a radicalization of categories. And you can see it as well. Even as the identity split, for example, in the whole gendered fluidity movement, you see it as well. It's not just that you have fluidity, but this fluidity also creates these strange, permanent categories of desire, which are these strange categories of desire which cannot be questioned. And so you have 56 pronouns, but you cannot question them. If you question the. The pronouns, then you are in danger in some places in the U.S. in New York City, for example, you're in danger of being fined for doing so. And so anyway, so I'm giving that up for you guys to think about, to think about this relationship between space and time, to think about the relationship between how they play up against each other in the modern world and how they build up one against the other. And my personal situation is the best, is one of. Is a great example. They built a dike at the end of my street and at the end of our town. And they build dikes all along the waterways, the St. Lawrence Waterway. And because of that, the water has no place to go. It has no vague lands to inhabit. And so all it can do is go up and up and up. And so I. At one point, the dike breaks. So what are you going to do? They'll do what. This is what they're going to do at the end of my street. They're going to make the dike higher. They're going to make the dike bigger. And imagine if everybody does that now. Everybody all the way up the waterways starts to make these dikes higher and bigger and bigger. And then what's going to happen? The water has nowhere to go. All it can do is rise, rise, rise, and the flood just goes up until some other dike somewhere is going to break. And so anyway, so maybe now you understand why I'm talking about this right now, because it's a way to talk about symbolism as I'm going through all of this. So once again, guys, I want to thank you for all your support."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":879.71,"end":1156.93,"speaker":"Jonathan Pageau","text":"One of the staples of the modern world Is this sense, this feeling that time accelerating. Now, it's interesting because we really need to step into a phenomenological point, point of view in order to understand that. Because the scientists, the materialist will tell you that, of course, no time is a constant. Time doesn't actually accelerate. But in the human experience, time doesn't exist that way. Time works in these, is compressible, and is also expandable. And in our experience, we've all experienced moments where a minute lasts, phenomenologically lasts, you know, feels like it lasts an hour when we've also experienced how, you know, something will just snap by, and we feel like no time has gone by at all. And so in terms of society, one of the phenomena that we've seen in the modern world is this acceleration of time. Everything is moving faster. We see people running around. We see people who have no time, people who are always pressed, people who are always rushing. And this is a side effect of modernity in general. There are many factors which feed into this experience and this reality. One of them is, of course, in general, this technology. Technology speeds up time. Now, why is it. Why does it speed up time? So you have to understand the world. I've given you this model before, but the best way to understand it is to understand the world as a wheel, okay? And in the middle of the wheel is the something invisible, like our identity, like. Like a name, like, you know, the spiritual aspects which bring us together, that which makes us anything, one we could call the center of the wheel. And so as you move out from that center, you know, as you move out, you have to add these layers around you in order to help you to move further and further away. And so you can understand it in terms of technology. I've talked about this in terms of what's called the garments of skin, this notion that as a human person, there are certain limited things you can do. And then when you add technologies to you, what it does is it makes you more powerful. It makes you able to move further away from. From what you would usually be able to do. Okay, it moves you away from that, but then it also makes you dependent on those technologies. And so as you are able to. As you add technologies and you are able to move further and further away from what you usually would do, you can accomplish more in a shorter amount of time, right? And so if I just have a rock and I have to bang nails into a. Into my house, it's going to take forever. But if I have a nail gun, I could just, you know, I Could knock those nails in in just. In a few minutes. And so what's funny about it is that we usually use the word to save time, but it actually. That is not what ends up happening. We don't actually end up saving time. What we end up happening is compressing, or let's say we end up accelerating our existence. And then we end up doing more than we would if we were. So imagine it would take you a full day to hammer in some nails with a hammer. But then if I have a nail gun, I just can do it in a few minutes. And what it ends up doing is it ends up times. It ends up replacing space, you could say. Or time ends up in eating away at normal space because it compresses it. It like pushes space together. Now, when I talk about the nail gun and the nails, it's a little bit harder to understand. But if I talk, it's. It's there, but it's harder to picture. But if I talk about something like transportation, then of course, it's quite easy to see. What we've seen, for example, what modern transportation has done to space is that it has. It has almost destroyed space. It has destroyed coherent space. Now the car, for example, we. The more. Now, the way we understand. Even the way we understand distance, we always. We understand distance in terms of time. You know, we calculate distance in terms of how long does it take, you know, how many kilometers an hour can I cover? Or how many miles an hour can I cover?"}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1156.93,"end":1157.85,"speaker":"Jonathan Pageau","text":"Sorry, I'm Canadian."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1158.25,"end":1246.79,"speaker":"Jonathan Pageau","text":"How many miles an hour can I cover in. In, you know, in order to reach somewhere else? And so the distance that a place has is calculated in time, right? We calculated how much time is covered. And what happens with the automobile is that we compress time. We're pushing time. We're compressed space, all right? We're pushing space together. And so in order to reach somewhere which before would take me several days journey now takes me a few hours. And so I. We're making time. We're eating away at space where we're eating away at space. We're making space disappear or slowly eroding at normal space. And this is happening in the way. It's part of the. I've told you this before, the part. The way that cities are set up, the way that we set up our societies are now totally based on this transportation. And so instead of having a concentric city model with, you know, a church and a town center with a bank and, you know, the, you know, the. The market and the government building, and then you have houses and businesses around that, you know, that kind of layer out into this, this concentric, this concentric model of stable space. Instead, we fragment, we have fragmented our space. And so we, we, we take our car and we can walk, drive for 20 minutes to go to a restaurant. Then you take our car, you could drive 20 minutes to go to, you know, half an hour, 45 minutes to go to your work."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1246.87,"end":1247.47,"speaker":"Jonathan Pageau","text":"You do that."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1247.47,"end":1295.16,"speaker":"Jonathan Pageau","text":"And so what happens is you have, let's say, massive shopping malls that are just this one blip in on a map. And you know, it's this huge, huge, huge shopping mall which is meant to serve people that are miles and miles and miles away. And then you have the same with houses and houses spread up across the land. And so it's, what's happening is it's compressing our capacity to inhabit space, you could say. And so definitely we see it in transportation, but we see it even more in terms of the new technologies, the Internet. The Internet is really a transportation method. The Internet, what it does is it makes space disappear. And so everything has become time in the Internet. Everything has become time. All these servers that are all over."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1295.16,"end":1296.64,"speaker":"Jonathan Pageau","text":"The world, we don't even know where."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1296.64,"end":1437.26,"speaker":"Jonathan Pageau","text":"The information goes through. We don't even know what, you know, what it takes in terms of this kind of hidden secret network underneath to make our experience of immediacy happen. And so with the Internet and the telephone, all the communication technologies, but the Internet most of all, it connects us with people that are all over the map. And so the map ceases to exist. Everything becomes how, how. And we've, we've actually reduced that to zero, right? We've reduced the, with the time, with these communication systems. We've reduced the time, the, the space to absolute zero. So there's an immediacy where I can be in contact with people from all over the world at the, the at the same time. And everybody can be there and be, you know, let's say, in communication with me from all these different places. And we can access information from everywhere in simultaneity, right? And so the ultimate, the ultimate result of that is you could call it the destruction of time. That time that I keep. Sorry, I keep using the wrong word. The destruction of space. Space gets eroded. Gets eroded, gets eroded and gets turned into this strange simultaneous point in, in, in. In time where everything. This weird simultaneous point in space where time is the only factor which links me to all over the. The planet, okay? And so it is, it's very odd because it actually. This speeding up of time is actually a destructive force. It, it is really like a dragon on the edge of space which is slowly devouring, devouring, devouring the space. And soon you just have this whirlwind of, of motion, this whirlwind of, of time, which is spinning and spinning and spinning. And, and it's dizzying. And we can all experience that dizzying as we live in our, in these frenetic times and this kind of frenetic motion of, of, of experience. And so it's difficult to think about this stuff. And so maybe some of you will think that it's not totally clear and."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1437.26,"end":1437.9,"speaker":"Jonathan Pageau","text":"Have to be honest."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1437.9,"end":1527.91,"speaker":"Jonathan Pageau","text":"This is stuff that I'm still kind of working on and I'm still trying to fully. Once you start to think about it too much, your brain, your brain starts to, your brain starts to, to fry. There's an interesting thing also that's, that, that happens like this interplay between time and space in the modern world is very particular because let's say in ancient times there used to be two modes of being. You could say there used to be sedentary mode where, you know, someone would inhabit the land and then would exist in space, would inhabit the land and would, would then witness time, you could say, could call it like that. And so you, you live in a place and you look at, you know, the stars move and you see the sun move and you see the cycles around you. And there's another mode of living which could be called nomadic existence, which is, which was kind of like the weird opposite where you actually traveled through, through space, but you inhabited time. So these two modes of being are very fundamental. In fact, you find them right there at the beginning of the Bible in the story of Cain and Abel where you have the Cain who is an agriculturist, and you have Abel who is a, is a nomad who, you know, who's a pastoral figure. And so those two modes of being, they kind of, they tend to balance each other out. And what's very odd is in the modern world we have eliminated the nomadic lifestyle."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1527.91,"end":1528.12,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1528.59,"end":1587.53,"speaker":"Jonathan Pageau","text":"They're barely. There are no really nomadic tribes anymore. Maybe, you know, a little bit the Gypsies and maybe in Africa a few nomadic tribes like the, you know, like the, the Tuareg or maybe the, the Maasai. A few tribes like that that are nomadic, but they're very few and, and they're very compressed because we, we want, we want to, we want to delimit everything. You know, the world has these very clear borders. Everything has been Completely manifest. You know, there's no, there's no place in the world which is vague and which is not totally defined. And so I think that's also part of this strange idea that. This strange idea that somehow we are now being. How can I say this? That we inhabit these, this space, but we can see time is accelerating around us. And then also space is being compressed into. Is being compressed into time. It's very odd."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1587.61,"end":1587.97,"speaker":"Jonathan Pageau","text":"It's."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1587.97,"end":1614.15,"speaker":"Jonathan Pageau","text":"It's very difficult to understand because even when you think about it, it kind of flips in your mind. But hopefully that'll be food for thought. And what I'm hoping to do is, because I've been trying to figure this stuff out for a long time. I've been trying to figure this stuff out for years, in fact. And so hopefully, you know, I was really excited about a lot of your comments on my Merlin video. A lot of people had some good ideas about the, let's say, symbolic challenge that I posed, all posed to all of you."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1614.23,"end":1616.51,"speaker":"Jonathan Pageau","text":"And so I would, I would ask."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1616.51,"end":1898.93,"speaker":"Jonathan Pageau","text":"All of you to, to get on board again and to think about time and space and to think about this strange acceleration of time that we're going through. Because one of the things that technology does is that technology is on the edge, right? So you, you add these layers as you move forward. And there's also this notion that as you move out, right, as you move out from your center, you're also moving out into the future. And so there's a sense in which the potentiality that's on the outside of the, of this ring that I'm. That I try to describe the world as, is also the potentiality of the future. And so as technology is. Increases, as technology accelerates, it's also as if the future is coming at you faster. And so you, you, this, the. The experience of the future is accelerating, right? And you see it in technology all the time. It's like, you know, these technologies that succeed each other, succeed each other, succeed each other, and everything is speeding up in terms of technology, but for some strange reason, it does that also to our existence itself, not just the technology, but as we engage in that mode of being which is this constant taking from potentiality, this adding layers upon layers upon layers, and we just do it faster and faster and faster. That what happening is our experience of time is also changing and the world is accelerating around us. And it seems to be something that we can't totally control. It seems to be something which is part of this cosmic experience, like a cosmic cycle that we're going through. But I think that it's probably good to be aware of it in order to be able to mitigate the consequences on our psyche. Because obviously, I think that diseases like adhd, you know, those types of diseases, attention deficit and hyperactivity, all those diseases which suddenly had popped up in our society, which never existed before, are part of the problem, right? The notion that you would have attention deficit, that your attention cannot focus on one thing for a long time, but that you're constantly shifting your attention to the. To something which is coming on the horizon, seems to be a good way to describe our society as a whole as we move forward and forward into new technologies and into this constant change of experience. And we also expect that to be happening in terms of everything. We expect things to change in terms of our morality, in terms of our social structures, in terms of, you know, a lot of the social justice stuff has to do with this idea that somehow this change and this breakdown of stable identities, you know, of stable gender identities is part of the deal. But you can see here, you can actually see time destroying space when you think of how this notion that we need to change, we need to adapt to these new gender realities, gender is multiplying in infinite amounts. And this constant change, this fluidity, this gender fluidity is devouring the identities of which they're dependent, right? Of which what they're talking about. And this is happening not only in terms of gender, but it's also happening in terms of the family, in terms of these broken relationships of people, of divorce, of the massive rate of divorce, and then, you know, people getting back together again. And so you have these, these, these splintered identities as people desire change, as people want to change their relationship, it ends up splintering our identities and having, you know, you have your, your. Your mother and then your stepfather, and then, then you have your father and her girlfriend, and then they break up again and then creates this massive. This massive chaos of relationships as we desire and as we. We are in a world that sees change as a mode of existing in itself. And so hopefully that. That is something that is now that will give you food for thought. And I think my next video is going to be about the economic system and about credit and how credit participates in this system of accelerating time and, and the breakdown of identity and space. For those who are interested, a lot of this stuff is the basics of this stuff. Let's say the structure of this is covered in my brother's book. I've told you many times, the language of Creation. So check it out if you're interested in getting a sense of this notion of a relationship between time and space. I think it'd be quite worthy. I want to give you a little bit of news in terms of my own experience for those who made it."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1898.93,"end":1899.86,"speaker":"Jonathan Pageau","text":"This far in the video."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1900.74,"end":1972.71,"speaker":"Jonathan Pageau","text":"You know, our family for the first time two days ago we had a sit down meal, just our family. It was the first time in three weeks that we have been able to do that. We are in this rental house that we are going to stay in for a few months because everything is still unclear in terms of the government, in terms of the new regulations with the dike, whether or not it's going to change places. We know that some areas are going to be not inhabitable anymore. They're just going to destroy the houses and people are going to have to find other places. We don't know where that is. We, we're pretty sure that our house isn't going to be part of that. But we are definitely not going to make any decision and go back into our house or, you know, we need to rebuild it, rebuild the basement. And even the, even the first floor was wrecked as well because we had to, we had to go downstairs and we kind of wrecked the floor. We have to redo, we have to, we have to redo stuff. So we're not going to, we're not going to do that until we have the proper information. So for now we're kind of in this in between state, which is probably why I'm thinking about this breakdown of identity, you know, chaos, chaos world. And so hopefully we can get something fruitful out of it and it'll be helpful."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1973.51,"end":1982.31,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1982.31,"end":1985.56,"speaker":"Jonathan Pageau","text":"On my YouTube channel, Jonathan Pedro's YouTube channel."}
{"episode_id":"SW - #062 - 2019-10-05 - Time","start":1985.96,"end":2038.47,"speaker":"Jonathan Pageau","text":"You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on SubscribeStar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
