{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":12.56,"end":57.25,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. I am back here with Richard Roland. Everybody has been really excited about our last discussion on Ethiopia. I've been surprised to see how fast it's been growing on the channel. It seems like it's kind of an obscure subject, but it actually seems to be touching on a lot of aspects of this re. Enchantment and mystery and a different way of seeing peoples of the world, which I find very exciting. I'm really looking forward to seeing what Richard has in store for us. And I have a few things in up my sleeve as well."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":58.13,"end":105.54,"speaker":"Richard Rohlin","text":"I just have to say I've gotten more. I mean, I don't do nearly as much stuff on the Internet as you do, but I've gotten more positive feedback on that Ethiopia video than I've ever gotten on, I think anything I've ever done. I've gotten emails from people who are like, oh, let me put you in touch with this person. You guys should have a conversation. But I've also gotten like, you know, just like a bunch of shout outs from like, random raster guys. And yeah, so it's been a lot of love from some of my Ethiopian and Eritrean friends over the video. So I'm really, really pleased about that. Like I said, I told you this a minute ago, but I was pretty sure this is the video that was going to get me canceled. So I've been really encouraged to see so much support for it."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":106.1,"end":128.91,"speaker":"Jonathan Pageau","text":"Yeah. But I think it was transparent for a lot of people to see just the enthusiasm we have about Ethiopian culture and, you know, also this kind of surprise that we have that nobody knows about it and this desire to help people see the kind of pearl that's hidden there in Northern Africa. For most of us, you know, we don't, we don't. A lot of people don't know about it, but it definitely is a pearl."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":129.31,"end":230.26,"speaker":"Richard Rohlin","text":"Well, so this actually, I mean, this will be a good segue into kind of everything we're talking about today. Okay. Because I've watched a couple of response videos you probably have as well to the universal history series that people have made on YouTube. And one of the really interesting criticisms about, about it was, well, let's say twofold, first of all, that, oh, well, this idea of like a medieval European universal history, it doesn't have room for the Chinese, it doesn't have room for Africans, it doesn't have room for, you know, this whatever group that you want to pick that, that you sort of like see as being sort of outside the Traditional European Christian story. So one of the things that hopefully this Ethiopia video helps. Helps people sort of get is that the story of Christ and really here, you know, I'm talking specifically traditional Christianity really is all encompassing. It does have room to integrate all of these things, but it's also. It's a story that hasn't ended. Right? And so this is the other somebody. Somebody made the remark, you know, I think this is when we were talking in the. Our second video that we did together about Christ and Antichrist, you know, talking about liturgy and, you know, this idea that the liturgy was sort of like interrupted in Constantinople and that one day it's going to be finished and things like this. And somebody said, well, you know, if liturgy was going to save us, it would have already worked. Like, it would have already saved us. And I was just. I kind of squinted a little bit at my computer screen, and I was like, you know, that's like saying, well, if Jesus was going to save us, he already would have. Like, why? Are there bad things in the world?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":230.26,"end":231.94,"speaker":"Jonathan Pageau","text":"No, why do bad things happen to good people?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":232.58,"end":319.22,"speaker":"Richard Rohlin","text":"It's kind of a silly. It's kind of a silly argument. But here's the thing that I want to kind of point to and sort of show today is that the story's not over. Right? And this is. I think this would be true for both of us is that we really. We still see ourselves as part of this story. It's a story that's. That's ongoing. And that in some way, you know, one of the key parts of postmodernism, which I think was actually really useful, was this ability to conceive of oneself as being part of a narrative, even that even Tolkien is engaging with this when he says, in, you know, in the Lord of the Rings, there's that moment at the stair of Cirith Ungol when Sam is looking up at the sky and he sees the star Earendo, which is connected to the light and the silmarils and the. The file of light that Frodo is carrying with him right now. And he starts to realize, hey, all these things are actually connected. There's a larger pattern here that we're actually manifesting. And he says, you know, we're in the same story after all, right? And so I think maybe one of the more helpful things that postmodernism has done is it's given us a way to kind of recapture the ability to conceive of ourselves as being part of this larger narrative, which. Which is exactly what universal history is. This is the way that in the Middle Ages they saw themselves as being part of this larger narrative."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":319.54,"end":396.45,"speaker":"Jonathan Pageau","text":"And it's important to, it's really important to point out to people that when we say universal history, we don't mean it at all in a kind of enlightenment scientific vision of kind of pulling yourselves out of the world and now looking at all of history as one big thing. No, it's a universal history, but it's a universal history that's embodied. Embodied and lived in the particular histories. And so it's normal that you will also see, let's say fractally, you'll see those histories that are further away from you as being further away from you. And so there's less room in the universal history for the Chinese, although there is. And we'll get to it at some point, especially when we talk about Mongols and stuff and we get to that kind of stuff, we'll talk about that. But there is less room in the sense that it's just further away. And so this is also, it's important to understand that that's how it works. It works as this idea of these centers that have their perspective, but these perspectives also fit together in a kind of puzzle. But it's not a God's eye view puzzle, but it's an embodied puzzle that you encounter from the piece that you are in that puzzle. Let's say it that way, right?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":396.61,"end":544.07,"speaker":"Richard Rohlin","text":"Every society, when it encounters Christianity for the first time is on the margin just sort of by default, right? But then, but then of course, you know, as, as it expands, right, These things sort of change and they shift a little bit. And it takes, you know, it's a, this is not a, it's not a. Rigorously, you know, a lot of times when we're especially, let's say dudes of a certain age who are like, you know, trying to, trying to grapple with their world, but they really want is this, this hyper rigorous internal system where everything has a one to one mapping and things like that. And it's, it's a little more of an art than that. And this, this actually kind of ties into. This is not a question I want to answer today though. I think there is an answer. But the question that I've been asked the most since we started doing this series, and this is, it's the most American question to possibly ask is, well, where does America fit into this story? That's what we're really concerned about is like, okay, but where do I fit in? And this is nothing. I mean, in a certain Sense, there's nothing wrong with that, but we are, of course, we are a little self involved, a little self interested here in America. This is actually something I've been pondering a lot in the oca. This last Sunday was the Sunday of All Saints of North America. And it was just a really good. Which actually this wonderful serendipity landed on July 4, which is independence Day in the United States. I don't know if you've heard of this, but we, we just blow stuff up for about three days straight. It's, it's a good time. But. So, so I've had a. But it just gave me a lot of occasion to kind of ponder, you know, where does America fit into this symbolic story? And so I think that if people pay attention to this video, these next few videos, they're going to start, there are going to be clues and by the time we actually get to talking about America, I think that it'll help make sense. I really want to, once we kind of finish going down this particular trail that we're on, I kind of want to like shift gears a little bit and look at Celtic Christianity, look at Ireland and Wales, which are also, you know, out there on the edge of the world. We touched on that a little bit with the Arthur stuff, but I think there's, there's a lot more there that's going to help us understand the symbolism of the edge, actually, in another way. And so anyway, it's just a teaser. I'm really bad about these teasers."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":544.07,"end":548.67,"speaker":"Jonathan Pageau","text":"But yes, there's a lot to talk about. There's a lot to talk about."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":548.91,"end":798,"speaker":"Richard Rohlin","text":"What I thought we'd do for this video is now that we've constantly teased it like we keep referring back to this Apocalypse of Pseudo Methodius in this wonderful volume by Dumbarton Oaks, because it's, and it's not the only work like this. There's actually a really rich Byzantine apocalyptic tradition that kind of is, is in and around this, builds off of it, predates it, et cetera. But I like the Apocalypse of Pseudo Methodius for a few reasons. One is this just. There's a really handy, easily accessible English translation of the work. It's easy to find. People can pull it up and, and read it and it's not on like a sketchy website. Like, you know, some of this old stuff is. And you're like, I don't, I don't know how like legit this is. I, you know, I need a little more textual certainty or something like that, you know. But basically all of the things that we're talking about, we see, we find in the Apocalypse of Pseudo Methodius in a Byzantine kind of a focus. So it's not a particular, let's say, Western focus in the sense that, although really the notion that Greek civilization is not Western is. I just constantly find that ludicrous. But, but it's, but it's not a particularly, let's say a Latin or Western or, you know, like a Protestant colonialist, you know, et cetera, et cetera. All these things that are, that are so easily problematized, right? This, this lets us kind of like cut through some of that noise and look at how does this pattern work, how does this, this idea of universal history work out. The other thing, though, is that the Apocalypse of Pseudo Methodius is aimed specifically at answering one of the main criticisms which, which we've received, and I've heard this from two or three different people, which is, well, okay, but Constantinople fell. So there your argument's invalid. Like, obviously, if, if, if Christianity was legit, if Orthodoxy is legit, if universal history is legit, then, like, why did, why did Constantinople fall? Right? And so, so one of the things that the Apocalypse of Pseudo Methodius is actually set to grapple with is the, Is the rise of Islam and the Arab conquest. And that's actually, I mean, it's not a, it's not an illegitimate question. If you're pretty sure you're on God's side and then that doesn't end up looking like military might, then it's a pretty normal thing to ask, as many people have over history, it's a pretty normal thing to ask, well, why are we losing? And is this thing that I'm a part of, and I really actually like Dr. Mario in his video that he did with you earlier in the series, he talks about the fact that one of the things that Byzantium is doing, Constantinople is doing is it's really, it's really giving its life to the church, right? It really gives up, you know, this high level of cultural development, all of these things, and puts them into the deep treasury of the Orthodox Church. So that even when Constantinople falls, the Orthodox Church has continued oftentimes under, like, truly crushing opposition. And that's not just here to, you know, like, chill for Orthodoxy. Obviously I'm Orthodox. I love it. I would like everyone to be, you know, but the point of this is that one of the questions that has to be answered is this idea, well, can my faith outlast my government? Right? That, you know, like, if what is it what would it mean to have a Christian country that then falls to conquest from a non Christian group? Right. And that's actually one of the questions that the Pseudo. The apocalypse of Pseudo Methodius. That is, it's attributed to this early church father, he's like a third or fourth century church father named Methodius. Scholars, because they hate fun, will say that this is probably written more like the 6th or the 7th centuries, actually, maybe around the same time as the Iconoclast controversy in the East. So, okay, all that to say from the very beginning. The Apocalypse sets up this tension between the center and the edge. But also it's a work that is deeply concerned with giants. And in fact, love how you pause."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":798,"end":799.04,"speaker":"Jonathan Pageau","text":"When you said giants."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":799.92,"end":899.15,"speaker":"Richard Rohlin","text":"I didn't tell you that I was going to talk about this, but one of the things that I'm really interested in is the idea. So this is what it says about the birth of Seth says in the 230th year of the first millennium that is also the first age, Seth was born a gigantic man in the likeness of Adam. In the 500th year in the same first millennium, the sons of Cain abused the wives of their own brothers in excessive fornications. So this is, this is, it's an interesting work because basically this work takes both the approach that there are fallen angels involved, but also that that is sort of like line of Cain, line of Seth. Like, it's, it's a, it's kind of a hybrid of those two different hypotheses. But one of the really interesting things here is that Seth is. Seth is put out as a giant. And as we keep reading, we find that there are actually kind of like two groups of giants. Two groups of. And I think we can understand this as being like, these are large, these are powerful. Like a giant is a very. The way Dante uses giants in the Divine Comedy is to basically be like, they're too fleshy, they're too, they've got too much body. Right. So they're large, they're powerful. In other words, like they're this massive amount of potential. And what ends up happening is that Seth and his children go up and living and raising the line of Seth raising their family on the slopes of the mountain of Paradise. Right. And then Cain and his people are down in the valley. And that's."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":899.55,"end":901.95,"speaker":"Jonathan Pageau","text":"This is in the Pseudo Methodius text."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":902.21,"end":909.49,"speaker":"Richard Rohlin","text":"Yeah, this is all. This is all in the Apocalypse. Yeah, yeah. It's basically, it's like a snapshot of this kind of cosmology, I think. Yeah."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":909.49,"end":914.13,"speaker":"Jonathan Pageau","text":"Kind of St. Ephraim's, the cosmology we find in St. Ephrem's Hymn of Paradise."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":914.21,"end":1030.54,"speaker":"Richard Rohlin","text":"Yes. And so what happens then, what ends up happening is that these devils, these fallen angels, they come to the line of Cain and they specifically pollute and corrupt the line of Cain by teaching them the composition of every kind of music is what it says. Your brother Matthew in his book has some really great things to say about music and its relationship to ornamentation, to variability, even to things like menstruation. And so, so you can sort of see you've got the mountain of paradise right here. You've got Seth and his people living on the slopes of the mountain. They're not quite in paradise, but they're kind of as close as they can get. And then out here on the margin, that's where the line of Cain is. And there's basically the idea is that what's happening in the people of Cain is that there's all kinds of mixture. So there's every kind of music. And this is. I mean, this is a real problem in the ancient world is figuring out how to. I mean, this is one of Plato's main things that he's concerned with in many of his writings is the idea that there's certain music that would be appropriate for a certain time and for a certain place, and that there are actually some kinds of music, let's say some tones, some modes that Plato actually believed it would be wrong to even let common people hear. Like you shouldn't even play those in public. And of course, this is one of the things that in the Orthodox Church, especially in the Byzantine tradition, it gets resolved. I mean, this happened in the west too, up to a certain point. But this gets result in the tonal system, right. The eight tone system in the east, but also like in Gregorian chant, things like this in the west, where it was basically saying, okay, there really does. There really, really is like a hierarchy of music. And as strange as this might sound to lots of people living in America, there really is music that's okay to listen to it. Your house, that you shouldn't play in church. Of course. Right, yeah."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1030.54,"end":1033.9,"speaker":"Jonathan Pageau","text":"And you can understand it very simply as a hierarchy of patterns and that."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1033.9,"end":1034.18,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1034.18,"end":1089.87,"speaker":"Jonathan Pageau","text":"And that different. There are different types of patterns and those patterns have a place in the world and, and that like you said, like they just have their place. And some of them maybe don't have their place like in, in public life, let's say, because they can bring about. No, I mean, you can understand it's like the music that plays in a club, like, is music that plays in a club. And there's a reason why the things that happen in a club happen in a club. And the type of relationships and the type of. Kind of decadence that you see, which is related to consumption, to fornication, to all that there is. The music itself is. It's not just the music, but the music is part of the pattern that is bringing about these kinds of things. And so if you listen to, like, a folk dance, you can't do the same things that you would do in a club while you're listening to a folk dance. There's a. It just. It just doesn't allow it in its pattern."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1089.95,"end":1122.66,"speaker":"Richard Rohlin","text":"Right, right. Yeah. So it's really. What's really interesting is that it's called the Camp of Cain. Right. So at this point, a city, in this particular narrative, there isn't really a sense of, like, a. A city so much as it is the camp. And the idea is actually sort of the idea of a club floor. You know, it's like there's. There's all kinds of music. There's. There's a vast amount of mixture happening out here around the. In the valley, you know, at the sort of the foot of paradise, the Mountain of Paradise. So we're told if you've seen the."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1122.66,"end":1128.71,"speaker":"Jonathan Pageau","text":"Movie, the second Matrix movie, that whole rave scene in the cave, that's what's happened. There you go. It's."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1129.91,"end":1137.35,"speaker":"Richard Rohlin","text":"Or the rave sort of slash. Well, last video I talked about the Ten Commandments."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1137.59,"end":1139.67,"speaker":"Jonathan Pageau","text":"Yeah, the rave at the bottom of the."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1139.67,"end":1161.03,"speaker":"Richard Rohlin","text":"Rave at the Bottom of the mountain is. Actually. Is actually really, really well done. And if you. Just as a little side note, because I love this movie a lot, if you. If you kind of look into, like, some of the making of the movie, it took them two or three weeks, I believe, to shoot that scene. And it was just incredibly grueling on the people who had to shoot it."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1161.03,"end":1165.31,"speaker":"Jonathan Pageau","text":"But anyway, because there's so many people in such mayhem, so many people and."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1165.31,"end":1230.44,"speaker":"Richard Rohlin","text":"Yeah, just like, very physically exhausting to shoot. So we're told that they're around the base of the Mountain of Paradise, that in the Campo Cane, they're more. Even more inflamed in their abominable fornication. They become worse than the previous generation. They mount each other in the manner of animals. And, you know, there's some explicit stuff in here, but it's, you know, it's. It's, you know, all kinds of debauchery, all kinds of fornication. Anything you can imagine. Right. That's. That's all happening here. And this is. This is. So then it says, in the 700th year of the life of Jared, that is in the second millennium, the spiteful and troublesome devil applied to himself to bring. Applied himself to bring the war of fornication to the sons of Seth so that they should desire the daughters of Cain. And he pushed them on. There appeared giants in the earth, the sons of Seth, who fell into the pit of sin and became altogether dreadful. So there's actually. There's like this devil. So you have fallen angels plus Cain plus Seth. So it's like, again, it's like a hybrid. It's like a kind of a hybrid approach to that whole question."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1230.68,"end":1238.1,"speaker":"Jonathan Pageau","text":"So they actually have the idea that fallen angels had relationships with women, but then also the tradition of Seth having relationship with."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1238.1,"end":1238.38,"speaker":"Richard Rohlin","text":"With."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1238.38,"end":1239.06,"speaker":"Jonathan Pageau","text":"With Cain."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1239.46,"end":1241.14,"speaker":"Richard Rohlin","text":"Yes, yes. And that was."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1241.14,"end":1245.38,"speaker":"Jonathan Pageau","text":"Always thought that those two were just the same at different levels of reality. I've always said that."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1245.38,"end":1289.41,"speaker":"Richard Rohlin","text":"Yeah. I. Well, and that's the thing. Like, a lot of people are like, oh, well, this church father says it was this way. So, you know, like, Lord of Spirits podcast is wrong or something like this. But you have to realize that most people in the Middle Ages, especially in the east, did not see these things as mutually exclusive. Yeah. And a way to actually understand this is like, once you start, you know, the things that they talked about, you know, especially in their Land of Giants episode, and a lot of spirits about the Nephilim ritual and things like this, you can understand how you could have two humans from. From differing. Who in this story are actually at different, like, ontological levels. Right. Because you have the, you know, the line of Seth is kind of up here, and then Cain is down here. So you could actually have two humans coupling, but also there's a demon involved in that somehow. Right? Yes."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1289.41,"end":1293.85,"speaker":"Jonathan Pageau","text":"And then two levels at a different level, like, let's say a priest and a prostitute, let's say."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1294.27,"end":1294.43,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1294.43,"end":1305.39,"speaker":"Jonathan Pageau","text":"Pretty simple. Like, it's. It can just happen. It can. It happens fractally at the material level, but it's representing a higher. A higher reality, which is also happening simultaneously."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1305.63,"end":1477.63,"speaker":"Richard Rohlin","text":"Right. So all of this happens. Of course. Then you have. You have. And I promise we're getting to Ethiopia. So all of this happens. This is actually all set up for the Ethiopia thing. There's like, I think seven or eight chapters that are basically, it's like. It's just an expanded narrative of the Genesis history. Right. And explains. Explains. We have the we have the, you know, all the things that we've talked about a lot and that you've talked about a lot on this channel. You know, the, The. The center and the margin that, you know, that the. The mixture resulting in the creation of something monstrous. All these different things, those patterns just recapitulate themselves over and over again. And what it eventually results in is in the line of ham, which is. Which is, you know, this is going to be relevant to. Relevant to. When we're talking about Ethiopia, we're told that. Well, first of all, we're told that Noah has an extra son and that the idea of the extra son of Noah, this guy's name is Ionitus. This is a pretty popular medieval tradition that there was like this one extra son. And he actually goes to the land of the rising sun, is what we're told the country of the sun, where the rising of the sun takes place. And he lives there. And it says that Unitas received from God the gift of wisdom. Not only this alone, but he also became the inventor of every division of astronomy. And so that Nimrod actually came down and learned from him and received from him the counsel by which he might begin his rule. So, so you have Nimrod, all these things, but. So you have this. You have this fourth son of Noah who goes to the very eastern edge of the world. Now, remember that Ethiopians in the Greek conception sort of come from one of two places. They either come from the extreme west, which is weird to think of Ethiopia being in the extreme west, but if you live in ancient Greece, it's less weird, right? Yeah. Because Africa is in the west. So you have Ethiopians in the extreme west where the sun comes down, and then you also have them in the extreme east where the sun comes up. So this is actually setting up this whole way of sort of thinking about. And of course, people in Byzantium at this time, or this might have actually been written in Syria, but people in that part of the world this time, they definitely knew there were these huge civilizations to the east which had achieved a very high level of learning. Sometimes people point this out. I was listening to. To something last night where somebody is pointing out that, oh, well, you know, medieval Christians didn't know that, you know, China and India and all these, you know, they had these high levels of civilization and they just thought they were the best thing on Earth and all this stuff. And that's. It's not true."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1477.79,"end":1484.11,"speaker":"Jonathan Pageau","text":"It's not at all true. They had a mythical way of representing it, but they. The legend of the naked philosophers was there all through."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1484.11,"end":1692.38,"speaker":"Richard Rohlin","text":"All through the time. Yeah. So this is. This is the. Basically the explanation for that. Where did those guys come from? They actually, they. They are descended from, like, a fourth son of Noah who goes to the land of the rising sun and is actually taught by God all of this lore, all of this wisdom, which is then sort of there, preserved there on the edge of the world after the Flood. Okay, so this is all. This is all kind of related to how Ethiopia comes into the story. And there's. There's a war between. I don't want to get into too much of this, but people. People go read this because there's a really interesting thing that happens. There's a war between the descendants of Japheth, who would be like what we would call Europeans today, and between the descendants of Shem, this fourth son of Noah actually tries to intervene in this. And the reason he says that you need to enter, he tries to intervene in this is to say that there are some descendants of Ham, this is going to be Arabia, who's actually. Who are actually going to rise up and. And take you both out if you don't sort of like, band together, right? So here. So here's the idea. It's like you have these European people and you have these SEM people, and there set up a very real tension that existed even in the ancient world between those people groups. But then also there's this intuition that there's something vital about the preservation of Christianity has to come from a union between those two people, and that this union, the source of this union is going to come from outside. And so the narrative continues on, and it gets us all the way to the time of Alexander. And what we're told is that Philip, the father of Alexander, so this is now in chapter eight of the Apocalypse, that Philip, the father of Alexander, he's a Macedonian king, and that he marries. Now, I know that in a lot of myths and legends, especially medieval myths and legends, he marries an Egyptian princess, right? But in the Apocalypse, she's Ethiopian. Her name is Chuseth, and she's the daughter of King Full of Ethiopia. And all of the like, all of their lineage has been very carefully laid out from beforehand. So you see how she's from. You know, the Ethiopians are descended from. From Kush, who's from the line of Ham and all this stuff. And, and so, so you have. So you have Philip. He marries Chuseth, this Ethiopian queen, and from her is born Alexander. And we get the story of Alexander and all of his conquest and everything else. And this culminates in his encountering the descendants of. So he goes east to the country, towards the country of the sun. Right. In other words, he's going east towards India. And that's when he encounters these descendants of the son of Japheth, who are Europeans, but who have. Who have gone the way of Cain. Right. And so they've. They're. They're out sort of here on the edge of things and. And they've participated in the. This mixture. They've become cannibals. They all eat in the semblance of the beetle, it says. And so they're like bugs. Bugs in the earth. Yeah, I mean, this is like. So in other words, you know, like a beetle just like, rummages around in filth, in dying things and decayed things and things that are. That are broken down and. And mixed beyond the level of coherence, let's say. And so it says they eat every polluted and filthy things. Dogs, mice, snakes, carrying abortions, miscarriages."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1692.7,"end":1693.58,"speaker":"Jonathan Pageau","text":"Yeah, there you go."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1693.66,"end":1707.26,"speaker":"Richard Rohlin","text":"Those which. In the womb, you know, like. I mean, this is a. I'm not even going to read that whole bit because it gets really intense, but basically, Basically, it's like. It's. It's awful. Right, so they're, they're laugh."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1707.26,"end":1712.14,"speaker":"Jonathan Pageau","text":"But yeah, here's like the. The kind of Gog and Magog imagery here, right?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1712.14,"end":1740.71,"speaker":"Richard Rohlin","text":"So. So that. So they're called. They're not initially called Gog and Magog, but that phrase is used later on. And so this. And so what he does is, of course, he drives them north because. Because what he's trying to do is prevent them from getting to the Holy Land, right? So he drives them north, you know, to this place in the Caucasus. And there's still. It's. I mean, it's a real place, Right. Alexander's still called Alexander's Gates. It's also called the Paps of the north, which is a great band name for somebody out there, if you want to."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1740.71,"end":1742.47,"speaker":"Jonathan Pageau","text":"It's not good. Let's not do that."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1742.47,"end":1774.88,"speaker":"Richard Rohlin","text":"Don't do that. Okay, sorry. Never mind. And he builds these gates and he builds the gates out of this. Out of this special metal, which. Which basically can't be. It's. It's. They're made out of something that can't be touched by demons, specifically. So the idea is that these. These. It says these filthy and misshapen or vile nations employed in unclean fashion all of the evils of magical arts. Right. And so the. So he has to make gates that are gonna. That are gonna sort of stand against."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1774.96,"end":1775.76,"speaker":"Jonathan Pageau","text":"Magic gates."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1775.92,"end":1802.24,"speaker":"Richard Rohlin","text":"Magic gates. They're magic gates. They're magic gates. And so what we're told then getting into this. Getting into this. This prophecy. So in our last video, I read some stuff from the prophecy of Ezekiel, which talks about all these nations and the idea that Ethiopia and the land of the rivers, beyond the rivers of Ethiopia, beyond the rivers of Kush, is being sort of like one extreme end of the world."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1802.64,"end":1803.04,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1803.04,"end":1821.38,"speaker":"Richard Rohlin","text":"And I think we should say at this point that when we talk about the symbolism of the edge, although somewhere like Ireland and somewhere like Ethiopia are both kind of on the edge, and so they share certain similarities. They're also different because the direction that you're going in also has a lot of importance in. In this sort of symbol."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1821.38,"end":1821.7,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1821.7,"end":1846.13,"speaker":"Richard Rohlin","text":"Which edge of the world? Which edge? Which edge are we talking about? Right. So this particular edge, which is like the northern edge, it's different from. Is different from beyond the land of Ethiopia. Right. These are the peoples which, you know, which are later identified with. With groups like the Goths, group, like, you know, these. Basically the whole barbarian invasion period of European history. So it says in the end times."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1846.93,"end":1848.01,"speaker":"Jonathan Pageau","text":"But also the Huns, too."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1848.01,"end":1864.69,"speaker":"Richard Rohlin","text":"Like, also the Huns. Yeah. So the Huns are. The Huns are really interesting in this because they're precisely one of these groups that is like, sort of like, maybe they're Asian, but maybe they're, like, European. Yeah. It's not totally clear."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1865.57,"end":1880.58,"speaker":"Jonathan Pageau","text":"Even the Mongolians, like, they're weird legends of Genghis Khan with green eyes and stuff. So even the Mongols, like that. It's not clear. They weren't. It's not clear that the image of Mongols we have now is what people encountered at that time."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1880.58,"end":1976.67,"speaker":"Richard Rohlin","text":"So Attila the Hun's name, right, Isn't. It's not an Asian name. His name is. It's atli, which is Gothic, which is a European language. It's a Scandinavian language. His name is. Or Germanic, anyway. His name is Otli, and Ockley basically means something like little Daddy. So it was like an affectionate name that his. His soldiers had for him. Probably wasn't his real name. Yeah, you know, he probably had some other name, but Otley is what everyone called him. You know, this is. I mean, this is a really interesting. There are actually a couple of Roman emperors who have, like, a really similar nickname because they used to follow the troops around, like, as. You know, like, as a boy. They went with their dad on Campaigns and like, you know, stumped around the camp in their dad's boots or whatever. And so the impression seems to be something similar happened with Attila. So even the Huns are not. They're exactly this kind of a group that there's an idea that some kind of mixture has taken place here and we're not really sure what it is. Right. But that's exactly what this legend is trying to deal with. So it says in the end times, according to what the prophecy of Ezekiel says, in the last day of the consummation of the world will come into the land of Israel, Gog and Magog, and that these are the nations and the kings and that Alexander hid in the ends of the north. So Gog and Magog. And it just goes on and it lists all these nations among these nations, by the way, it mentions the Agromardians and the Anophagians. Anophagians probably mean something like butt liquor in Latin. If you can think about the way that dogs greet each other."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1976.99,"end":1978.19,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1978.19,"end":1986.35,"speaker":"Richard Rohlin","text":"And the reason is because the Onophagians are also called the Cynocephalians. In other words, they're dog headed men. Right. So, yeah. So it's all in there."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1986.35,"end":1991.35,"speaker":"Jonathan Pageau","text":"And a lot can help you understand what the dogged. And men also another way of understanding what it meant."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":1991.35,"end":2131.7,"speaker":"Richard Rohlin","text":"Right, right. So when you come into like the legends of St Christopher and things like this, that's. That's what's going on. Right? Yeah. And so it says these are the 22 kings that are shut up within the gates that Alexander fixed. So, so there's, this is like one chapter in the Apocalypse. And the point of this chapter is basically just to refer to this story that everyone knows. Right. Because this is a universal history. So it's to refer to the story everyone else. Everyone knows Alexander did this. Right. This is just part of what everyone sort of believed in the, at this particular time in history. And so it's also, it's a way of explaining. It's a way of explaining actually a future disaster, a future apocalypse, like this, this hasn't, you know, from the perspective of when this is being written, this hasn't happened yet. Right. So with that kind of out of the way, and it's not unimportant for the rest of the story, but like with that kind of said, it turns to this question of Alexander's lineage. So Alexander is half Macedonian, but he's half, in this story, he's half Ethiopian. Right. So you can think that's Actually a really interesting image of something that comes from the edge and actually comes as a result of mixture from the edge is then the source of purity. Right. That's what drives these monstrous things kind of away in the opposite direction too. Right. Not south, but north. It's what drives the monstrous things away. So at this point, it returns to. It returns to the story of Alexander. And basically what happened is after Alexander's death, his empire is split among his four servants, as pretty much, I think everyone knows. And when this happens, his mother Chusef returns to Ethiopia. Okay, all right, so now, now we're getting into the stuff that I kind of teased in the last video. Bezos, who's the founder of Byzantium, he sends to. Sends the chief of his army over the sea to the king of Ethiopia. He wants to make a marriage alliance with Ethiopia. And he writes to him concerning Chuseth, the mother of Alexander, because he wants to take her as wife himself and make her his queen. Okay, so Bezos, founder of Byzantium. Right. And it's a, he's a, he's a, let's say from a modern perspective, he's a semi historical person. Right. Byzantium was named Byzantium because it was named after somebody who founded it. Right?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2131.7,"end":2132.02,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2132.02,"end":2213.93,"speaker":"Richard Rohlin","text":"Obviously later on Constantine will come, level the place and rebuild it. Right. But it was already, it wasn't a large place at the time, but it was already. It was, it was in kind of an important place. It's, it's founded by like, like most things is founded by like a refugee from Troy and all this different stuff. So Bezos sends us off to Ethiopia and he asks for the Ethiopian princess, who's the mother of Alexander, to wife. And so this all goes well. The king of Ethiopia sends his daughter back and she marries Bezas. And the place where the marriage is affected is at the city of Chalcedon. Yeah, yeah. So this is where, this is where we have to sort of like turn to ecclesiastical history for a moment. Right. Obviously we alluded to this in the last video. There is currently, you know, you and I are in the Eastern Orthodox Church. There's currently a schism that's been going on for like 1500 years now between the Chalcedonian Orthodox Church and the, the group that is sometimes called Oriental Orthodox. And that's actually kind of a, kind of a newer name that's been given to them mainly by like Anglican scholars. And it really cracks me up because Orient is the same word as East. So like, you know, but, but that let's see, just, just, you know, to."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2213.93,"end":2217.85,"speaker":"Jonathan Pageau","text":"Avoid the whole monophysite neophysit problem. Yeah, it's like, do we."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2217.85,"end":2218.13,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2218.13,"end":2221.37,"speaker":"Jonathan Pageau","text":"It's self named or is it the name that we use to talk about them?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2221.37,"end":2408.58,"speaker":"Richard Rohlin","text":"You know? Yeah. And here I have to say, you know, with all love to my, my Ethiopian, my Eritrean friends. I, you know, I'm not one of these people who believes like it was all just a linguistic misunderstanding. And the reason I don't believe that is because my main policy for operating in life is to not assume that our ancestors were idiots. Right. Like to say, oh, it was just a big linguistic misunderstanding, but now, you know, 1500 years removed from when these languages were spoken as living languages, we can see through it and they couldn't. I'm skeptical, let's say I'm a little dubious about that. So. So there is a schism between us. It's a real schism. And that doesn't mean there's not a lot of love going both ways because there is, you know, but there is, there is a, there is a real schism between us. And the person who is writing this, you know, Apocalypse is probably writing it. He's, he's probably in Syria, we think, which is, which is strongly affected by that schism. Right. So he's probably Syrian and he's living probably only, let's say maybe 100 years after it happened. Okay. So this is a, this is a very real reality to him. The fact that this happened at Chalcedon is a very strong, you know, present reality to him. So in his story, the marriage alliance between Byzantium and Ethiopia. Right. Which are on two sides of this question, is affected at the same place the schism happened. Yeah. Defected at Chalcedon. King Bezos. Bezos marries Joseph and they have a daughter named Byzantia, and they marry Byzantia off to a guy who's referred to in the text as Romulus, the king of Rome. So you have this, this marriage alliance between Byzantium and Ethiopia and then that results in something that joins Byzantium, Ethiopia and Rome. Yeah, Right. And of course, Rome in the west played a huge role in that particular schism. Right. It's the, it's the, it's the Tome of Leo. Right. Read at the fourth council. That really cinched it. Cinched it. Right. And causes this rift. So what the author is doing here is he's very carefully building this idea that from this marriage alliance that there's something in this, in the history of the ancient world that goes all the way back to Alexander. Right. What is Alexander's role? Alexander's role is to push the barbarians away, to seal the gate against, you know, the. You know, the barbarians are literally at the gate when we're talking about Alexander. Right. So his goal, his. His role is really to play this role of. Of unity and. And purity. Right. But it's not a. It's not a monolithic purity. Alexander is himself half. Half Ethiopian in the story. Right. But it's a way of. It's a way of. This goes back to this. This very strange idea that I haven't actually encountered anywhere else earlier in the Apocalypse, that Seth was a giant. Right. So there's some kind of idea here. Maybe you could speak to this a little bit, because I've talked a lot."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2408.66,"end":2422.99,"speaker":"Jonathan Pageau","text":"Yeah, well, there's a. There's a. There's a difference between. There's a. How can I say this? There is a moment, or there's a possibility for something like hybridity to become synthetic, to become an actual new being."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2423.63,"end":2427.67,"speaker":"Richard Rohlin","text":"So were you mentioning this. Was this in one of your last videos or was this in the Q and A?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2427.67,"end":2429.31,"speaker":"Jonathan Pageau","text":"It's in a Q and A that I talked about that."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2429.47,"end":2438.19,"speaker":"Richard Rohlin","text":"So this was really important. So maybe you could say a little bit about this again, because I think this is probably the best part of that whole Q and A. Yeah, well, there is."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2439.31,"end":2557.83,"speaker":"Jonathan Pageau","text":"Especially right now, it's really important to see that because one of the biggest problems we have right now is we are struggling to tell the difference between confusion and unity. That is the unity of multiplicity into a new identity and the union of multiplicity, which is actually not a union, which is just a confusion of different identities that can't sort themselves out. And it's hard for people. It's hard because it's a really existential experience. It's hard to define the difference between, you know, something when you look at it, you know it like you look at something and you say, well, that's like. That's like two things. It's not one thing. You can't tell that. It's one thing. It doesn't come together into one. And so you can see that. For example, the example I gave is. Is exactly Britain, for example. There's a moment in which Britain was just a bunch of different groups fighting amongst each other. And you could say Britain, but it wasn't. It was just this mixture of people. And then something happened, something sacred, something high up on the scale of being, which was able to join them together so that now they recognize each other as having a true unity. And it doesn't deny their multiplicity, it doesn't annul it, but it makes the multiplicity participate in a unity. And so this is really the difference. So right now we talk about things like the whole idea of intersectionality. Intersectionality is really, is this worship of diversity for itself. And it's like the opposite of unity. It's like idiosyncrasies, like the one who can accumulate the most idiosyncrasy wins rather than seeing how those idiosyncrasies can be joined together with our different idiosyncrasies to actually express unity. And so sometimes it can confuse us because it almost looks like each other, but it's. It is like. It is like a mere reflection of one of the other."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2558.39,"end":2560.95,"speaker":"Richard Rohlin","text":"So this, this, this is maybe just."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2561.35,"end":2569.75,"speaker":"Jonathan Pageau","text":"Give me, give me, let me give an example. Like, I've actually, one example I've given recently in, in the Q and A is the difference between Christ and Baphomet. It's a very."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2569.75,"end":2570.23,"speaker":"Richard Rohlin","text":"It's like."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2570.23,"end":2643.8,"speaker":"Jonathan Pageau","text":"It's a pretty clear example, which. Because in kind of this kind of occult tradition, they have this sense of the union of heaven and earth. They talk about, you know, as above, so below. But the image that they come up with in the 19th century is a hybrid creature, is a hybrid hermaphroditic creature with like the head of a goat and the breast of a woman and still seeming to be a man, you know. And so it's like they confuse synthesis and hermaphroditism. Like the idea of having two sexes at the same time, that's not unity. And so you could say it's like the difference between someone that is an angel that is beyond sex and a confused being that is a mixture of all these different. Of these different identities. And so that's the difference. So Christ is both man and God completely. Not. No mixture. It's really important for the definition of Christ that there's no mixture between the two natures, but completely united in one person, so that, so that they also can't be separated, let's say. And so that is the image of synthesis, whereas something like Baphomet, it really is the image of contusion."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2644.04,"end":2792.59,"speaker":"Richard Rohlin","text":"Yeah, there has to be. I mean, so you just, you just mentioned the hypostatic union, which is, you know, like the technical term for that idea that Christ says. And this is actually what that schism is over that we were just talking about between the Chalcedonian and non Calcedonian Churches is over this question, right? And so the, the church is teaching on this is that Christ has two natures, divine and human, perfectly joined in his hypothesis. His person. Right, his, his, you know, the, the second person of the Trinity, that these two natures are joined but not mingled, not confused. And I'll give a, I'll give a weird example because people keep asking about symbolism of America and I'm just gonna, I'll just tease this. I'll just tease this. Okay, so you might have heard we had a civil war a couple hundred years ago here in the United States. It's kind of a thing. So in our name, right. There's a plurality in the name the United States. Right. What is a state? A state is not a province. A state is a, you know, like the traditional definition of a state is that a state is like, it's like a standalone self governing principality of some kind. Right? So we are the United States. And so the idea is that you had all of these standalone principalities who would come together to cooperate on certain levels. Right? And that was the, let's say that was one vision of what America might be, right? And it's not what came out of the Civil War. And the reason it didn't come out of the Civil War is because there was no higher principality. There is no sacred direction toward which each of those individual things could orient themselves. And so what ends up happening is, of course, you have some band together against others that band together and you have a war. So the way that this, I'm going to just say on a symbolic level, the way that the unity of the United States manifests in the post Civil War area is actually in the person of Abraham Lincoln. And the reason that I believe this is the case is because if you go to Washington D.C. we have a temple to Abraham Lincoln in Washington D.C. and it really is a temple. Like it says, it's a temple on the temple, right. There's an engraving behind this. So it's modeled on an ancient temple of Zeus. I forget which one, but it's modeled on an ancient temple of Zeus. And then sitting in the center, in the throne, instead of Zeus, it's Abraham Lincoln. And there's an inscription behind him."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2793.18,"end":2805.1,"speaker":"Jonathan Pageau","text":"That sculpture, man, it's got a lot of that double nature to it because they actually, in the sculpture itself, they have one side of Abraham Lincoln which is kind of ordered, and the other side of Abraham Lincoln which is kind of disordered."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2805.1,"end":2905.5,"speaker":"Richard Rohlin","text":"It's a little like what's going on that pentakle in the Icon of the pentacle. Yeah. Yeah. It's really interesting. And so behind his head in an inscription that says, in this temple, as in the hearts of those for whom he saved the Union, Abraham Lincoln will be forever enshrined. Something like that. And, like, listening to the language there, the idea is that Abraham Lincoln has come into your heart and he has saved you. I mean, that's deliberately, like. That's in the language of the Lincoln Memorial. But at the roof of the Lincoln Memorial, and I think it's very interesting that it's the roof and not say, the floor, but at the roof of the Lincoln Memorial, you have the engraved names of all the states that were in the Union at the time the memorial was built. Right. And so there's this idea then that it's almost like an idea of like, the Council of the Gods, right? But it's the idea that we're able to sort of, like, we have a sacred place, we have a sacred building towards which the states are able to orient themselves, right? And so, like, they're sort of joined in the person of Lincoln. And one of the interesting things that's happened is that as we start to fracture again as a society, you have people, originally it was the right who. Who, like, maybe 10 or 15 years ago got really down on Lincoln because they felt like he'd obliterated the whole idea of, like, states rights or whatever. But now it's the left, and they're down. Like, Lincoln is sort of getting canceled, Right? So it's like Lincoln was, like, the one thing, everyone could agree on it, that was the principality, if you will, that was sort of holding this idea of the American vision, the American dream, together. As we begin to fragment, we're losing our trust in that particular principality. Okay, So I apologize. We didn't mean to talk about this."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2905.5,"end":2908.02,"speaker":"Jonathan Pageau","text":"But it was the fourth of July, not very long."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2908.02,"end":2908.94,"speaker":"Richard Rohlin","text":"Yeah, it was the fourth of July."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2908.94,"end":2909.58,"speaker":"Jonathan Pageau","text":"You're allowed."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2909.74,"end":2910.94,"speaker":"Richard Rohlin","text":"Been on my mind a lot."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2912.14,"end":2914.18,"speaker":"Jonathan Pageau","text":"All right, so let's get back to this marriage."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":2914.18,"end":3050.49,"speaker":"Richard Rohlin","text":"Yeah, yeah. So this marriage, right. So the idea is that the way that you. The way that you join opposites. Right. The way that you join two opposite things, which. Which, again, I can't stress enough. This is what the whole schism is about, Right? And with the writer of this is saying, is that the way that you join two opposite things, Byzantium and Ethiopia, east and west, north and south, the way that you learn two opposite things is in a person, right? So you join them in the person of, you know, this. This Princess that he sends off to Rome. She has three children, one of whom is named Claudius, and Claudius rules in Alexandria. And then eventually, like the line of the Romans comes. Comes from him. But at the end of all of this, it says this. Therefore the seed of Chuseth, the daughter of Foal, the king of Ethiopia, gained mastery over the Macedonians and the Romans. So remember that the Ethiopian is the, you know, the image of like the Queen of Sheba or Moses's first wife. Right. It's this idea that the Ethiopian is the one who is captured and then in her turn, captures. Right. So she. She somehow gains mastery over the Romans because. Over the. Sorry. Over the Macedonians because her son is Alexander who conquers everything. Right. She gains mastery over the people of the Romans by, you know, by this idea that east and west, the rulers, the principalities on both side are now coming from her, from her womb. Right. And so, and I think this is a kind of image. This is a way of understanding. This is. This is a way of understanding mastery that I don't think is possible in a pre Christian world. Right. Because pre Christian, it's not biology, but, but like pre Christian biology is concerned with the seed of the man. The idea is the woman is basically just like a container. She's basically just like, you know, potential, but she doesn't contribute anything to that process. And then Christianity comes along and we get the Virgin Mary. Right. And the Virgin Mary. Right. You know, because Christ is without. Is without a biological father. This opens up a space to sort of think about women as actually participating in the birthing process."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3051.05,"end":3097.59,"speaker":"Jonathan Pageau","text":"But not just that, that the idea that embodiment is part of the story. Right, yeah. Is that trying to say the power of embodiment is there in the story of Christ, but then in the story of the church and the whole way in which, let's say, the light manifests itself into the world. One of the revelations that appears in the Christian story is the manner in which the feminine principle plays a role in revealing the body as it kind of comes down the cosmic mountain. You'd say it's like filling up the mountain with the seed. But there's a sense in which there's a participation. There's this callback and call back and forth between the masculine and the feminine in the. In the kind of Song of Songs manner in which. In which the world reveals itself."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3097.59,"end":3216.52,"speaker":"Richard Rohlin","text":"And this is, this is how we can both talk about the Virgin Mary as. As being sort of like the secret interior place, you know, like the holy place. Right. But then also our champion leader. Right, this, this is how we're able to talk about her in a conquering way. Right? Yeah. So. So it says that the seed of Chuseth. And again, women don't have seeds, so it's the seed of the woman, you know, which is, which is a phrase that goes all the way back to Genesis. Right? The seed of Chuseth, the daughter of Foal, the king of Ethiopia, gained mastery over the Macedonians and the Ethiopians from the seed of the Ethiopians. This one, and it quotes that prophecy from the Psalms. This one shall stretch out her hands unto God at the last day. According to the word of the prophet, the blessed David looked ahead with the eyes of the spirit and foreknew that Shuseth the daughter of Foal, the king of Ethiopia, would begin to rouse the kingdom of the Romans. And he prophesied, saying, Ethiopia shall stretch out her hands unto God. And then it goes on to say, since in fact the great and venerable and honored wood of the life giving cross has been set up by the kingdom established from the seed of the Ethiopian lady. This is talking about Rome. Now which wood is fixed in the midst of the earth? Which is Jerusalem? Which is why perhaps, as is fitting, the ancient father David himself made the statement thus saying, Ethiopia shall stretch out her hands unto God. So the idea of stretching out your hands is compared to the shape of the cross. For there is no nation or kingdom under heaven which is able to prevail and overcome the kingdom of the Christians. For as we have already said above, because the life given cross has been fixed and made firm in the midst of the earth. And it just goes on to talk about, you know, the result of this is that the ends of the earth are then described according. To. Be fixed according to breadth and length and height and depth. So the idea is that the cross becomes the measure of the world, right? Yeah."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3216.76,"end":3242.45,"speaker":"Jonathan Pageau","text":"And also this is, this is why it's Ethiopia too. Because it's as if it's the filling up. It's the idea that there's a. There's a notion in which there's a joining between the center and the periphery. And that this, this joining is what Christianity is. And it's actually the cross is already what that is. And so the idea of, of opening or putting your hands to the end of the world, like spanning the, spanning the horizontal."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3242.45,"end":3242.73,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3242.73,"end":3273.11,"speaker":"Jonathan Pageau","text":"Spanning the entire breadth of reality. You can imagine that as being like the width of the mountain itself is this. The breadth of the, of the cross is the Width of. Is the width of the mountain. And so this is the idea of how the relationship between the, let's say the emperor, you know, the king and the Ethiopian queen, how this is an image of Christianity itself because it spans everything. And already Solomon and the Queen of Sheba is already that image that his wisdom kind of covers everything."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3273.67,"end":3328.16,"speaker":"Richard Rohlin","text":"And so this is where I think that in the story of Ethiopia as its played out here in the Byzantine apocalypse tradition, you see the symbolism of Ethiopia sort of the rectification of the story of Cain. Right. That's why. That's why I let off. I'm sure there are people who are going to watch this video and be like, okay, he's just talking about, like, Cain and, you know, giants and like, what. Where's this going? What does this have to do with Ethiopia? You know, But. But there's a reason that every time someone tells this story in the ancient world, every single time, they start with Genesis and they start with Abel, they start with Seth and Cain in the table of nations. And nobody tells the story of Ethiopia without starting there. Right? Because. Because it's something to do. I mean, you were talking about like, let's say multiple different. Different kinds of multiplicity and like, confusion versus synthesis, right? Which is really like Babel versus Pentecost."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3328.48,"end":3363.66,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And Pentecost is really is this image of the rectification of going down the mountain that is like, you can imagine Cain, you know, and the curse in general going down the mountain, and that the surprise of that phenomena is Pentecost, because it's like you don't expect it. But then something happens where the Christ going down into death, manifests itself cosmically as the ends of the earth being filled with the Spirit of God. Right? The land of Ethiopia, stretching out its hand, all flesh being covered by the Spirit. You see these images, and we were hearing these images at Pentecost as well."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3364.3,"end":3407.83,"speaker":"Richard Rohlin","text":"Another one at Pentecost that we read is, you know, this passage from Isaiah says the knowledge of God will cover the earth as the waters cover the sea. Which is a really symbolically interesting phrase because of course, like, the sea has all these resonances of chaos and death and division and multiplicity and all these different things. And then, so the idea is that. That, you know, the sea is sort of the thing that's without bounds, right. You know, and whenever God wants to assert him, you know, like, assert his power, he says, I'm the one that set the line that said to the sea you will not cross. Right? So then for the knowledge of God to cover the earth in that way. It's like. It's like the knowledge of God now is the thing without bounds. The knowledge of God is now the thing that's like all encompassing, right?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3407.83,"end":3452.53,"speaker":"Jonathan Pageau","text":"Yeah. There's an image that I love to bring about, which I think is one of the most beautiful images that Saint Ephrem in his hymns on paradise comes about, is he talks about how the saints, he talks about the rivers of paradise going down into the world. He talks about them becoming mitigated as they get further and further from the center, right. They become more confused, more mitigated, more polluted, you could say whatever word you want to use. Then he says, the saints go down the mountain and then they come to the oath, to the sea, and they walk on the waters. And so it's like that, that's not a problem. It's actually, if you're looking in the right direction, all of that actually becomes glory. Even the bitterness of the waters in the end will vanish and it'll become something like glory."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3452.85,"end":3661.49,"speaker":"Richard Rohlin","text":"Right? So it's like there's no seed, but there's a crystal seed, right? Exactly the same kind of thing. Yeah. So what follows from this point in the Apocalypse is this long description. Actually, he immediately goes into a pretty long chapter after this, talking about, now I just said that the kingdom of the Christians will never be overcome, but obviously the Jews were the people of God and they get conquered like every other day in the Bible, you know. So, like, what's going on there? Like, what do I mean when I say that? And so he's, he. You get this really kind of a long explanation for, you know, why does God allow suffering? Why does God allow kingdoms that are ostensibly Christian kingdoms to be conquered and overcome and things like this? And it's a, it's a. I mean, it's a good explanation. There's nothing in it that I think that that would really surprise anyone. But his point is to sort of say, you know, my kingdom is not of this world, but also sometimes it's of this world, right? And there's like this, I mean, that's one of the big tensions, right, is the. Is that Christianity is otherworldly, but also it has this very unique ability to enculturate itself in all these different cultures and kingdoms, not in a way that makes them essential. Like Byzantium can fall, Rome can fall, and Christianity not lose what it is. Right. And in fact, you know, there's some interesting ways that that changed, you know, things like some of the prayers that we used to direct towards the Emperor, we direct towards our bishop now, but some of them, we also direct towards the people. You know that. That line in the liturgy where we say, oh, God, save the pious and hear us. Right, that's. That's directed to the faithful now. But originally that that line was. Was said to the emperor and that. That was the point when the Emperor came into the church and we prayed, oh, God, save the pious and hear him. Right. And so, so there's. There's. There's some really interesting things that. That have kind of happened there. So it's like, you know, on the one hand, we can be. We can be comfortable with a process of acculturation, and we can also be comfortable with where we came from. Right. On the other hand, we don't have to fear because this kingdom or that kingdom falls. So he's working through all that stuff, and then it gets to the end. And this is kind of his view of the eschaton. And his view of the eschaton is that there's going to be this. This invasion in the seventh millennium of the world. There's going to be this invasion of the sons of Ishmael that are. It's going to wipe out the Roman Empire. And that this is going to bring in. This is then going to open up a space for the invasion of these unclean nations that Alexander imprisoned long ago. They're going to flood across the world and they're actually going to overrun the servants of Ishmael, the sons of Ishmael. Right? And then at the end of all of this, the last king of the Romans will manifest himself. And this is where Ethiopia comes back into the story. So there's this idea that the seed of the Roman people, you know, the seed of the last king of the Romans has been somehow preserved during all of this stuff, this constant overrunning over and over again. And that the last king of the Romans is going to manifest himself and he will drive out these unclean peoples that Alexander imprisoned. So he's like coming from Ethiopia just like Alexander did, to kind of do the same thing that Alexander did."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3661.49,"end":3663.69,"speaker":"Jonathan Pageau","text":"But he's hidden in Ethiopia like the seed."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3663.77,"end":3750.16,"speaker":"Richard Rohlin","text":"Yeah, it's. It's the. The. Ethiopia shall stretch out her hands unto God is the. Is the. That's the prophecy that they keep coming back to over and over again, like, so. So things are said really bad. It says honor is going to be taken away from the priests and the ministry of God will be ended. Every sacrifice will cease from the churches. It will stop Offering the liturgy. We'll stop offering the Eucharist. Right. Which is. Which is actually how a lot of the mystics in our tradition have said that's when the world ends, when there's no longer someone to serve the liturgy. Right. You know, maybe liturgy is saving you and you just don't know it. I don't know. But, you know, but it's just talking about how bad things are. And it says, a man will offer for sale all of his necessary equipment and his iron tools and even his burial sheets, which is a symbolic image I'd like to return to at some point in the future. And that in the middle of all of this, this is when the last king of the Romans will manifest. And it says, trying to find the exact quote here. So this man will march out and proceed against them from the sea of Ethiopia, who's coming from the direction of Ethiopia and send his sword and desolation into Yathrib, which is their homeland, and will take captive their wives and their sons. The sons of the land king will descend upon those living in the promised land, sort the sword and cut them off from the land. This is the. The unclean peoples who have."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3750.16,"end":3751.68,"speaker":"Jonathan Pageau","text":"And says, from the sea of Ethiopia."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3751.68,"end":3758.6,"speaker":"Richard Rohlin","text":"From the sea of Ethiopia. Yeah, yeah, yeah. It's almost like, you know, you haven't been making this stuff up all along."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3758.6,"end":3759.64,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":3759.64,"end":4017.74,"speaker":"Richard Rohlin","text":"I mean, this is. This is so. Yeah. It says all of a sudden, trouble and affliction will come upon them. That is. That is the people that Alexander imprisoned. And the king of the Greeks, that is, of the Romans, will spring upon them in great anger and will be aroused like a man from a drunken sleep. And this is that image, that language that we find in the Psalms of, like, the Lord rousing himself from sleep, rousing himself like a drunk man. Which is a weird way to talk about God, but it's in the Bible, so I don't know what to say. And this idea that he's, like, suddenly awakened to fierce wrath. Right. Well, that language here is applied to the last king of the Romans and who men reckoned him to be dead and good for nothing, and this man will march out and proceed against them from the Sea of Ethiopia. So it's like the last king of the Romans has somehow been hid down in Ethiopia while all this stuff has been going on, and everyone accounts him as dead, as good, for nothing is lost. That the Roman Empire is gone, the Greeks are gone, the empire is destroyed, all this stuff. And then in the last day, there's going to be this awakening from sleep, and he's going to proceed. He's going to march out from the sea of Ethiopia, and he's going to drive out the enemies, and he's going to yoke them, says with a yoke sevenfold of what their yoke was on the earth. Great distress will come upon them, et cetera, et cetera. And all of this happens. And there's a brief respite. There's this brief period of rest that comes to the earth. There's a peace right before the eschaton. And when the eschaton comes, this is when the Antichrist is unleashed upon the earth, right? And so there's this brief repose. Basically, the idea is the last king of the Romans, he'll revive things one last time, and then the Antichrist will be revealed. And when the Antichrist is revealed, he gets these guys that Alexander imprisoned, and he leads them on like one final slaughter across the earth. And when this happens, it says, when the son of perdition shows himself, the king of the Romans will go up to Golgotha, right? Which is where, at this particular time, this is where the true cross was, right? And we still have, you know, we have churches there and whatnot. He'll go up to Golgotha, where the wood of the holy cross was fixed at the place in which the Lord underwent death for our sakes. And he will take the crown from his head and he will place it on the cross. And then he will spread out his hands to heaven and deliver the kingdom of the Christians to God, even the Father. And at this point, the cross will be taken up into heaven along with the king's crown. Because the cross on which the Lord our Jesus, our Lord Jesus Christ was hanged for the sake of the common salvation of all, the cross itself will commence to appear before him and his coming as a refutation of the treachery of the unbelievers. And the prophecy of David will be fulfilled, in which he says, in the last days, Ethiopia shall stretch out her hands unto God, because from the seed of the sons of Chuseth, the daughter of the foal, the king of Ethiopia, these last, in other words, the last Roman emperor, emperor, will stretch out their hands unto God. So the cross is taken up into heaven. The last king of the Romans, who is also the last king of the Ethiopians, surrenders his spirit. He dies, the Antichrist takes over. And then Jesus comes back, like that's the way the apocalypse ends. Okay? There's so much in this. There's so much in this. One thing I want to point out is, again, scholars think this might have been originally written in Syria. There's a Syrian tradition. I think you find this in Ethiopia as well. This idea that at the moment of the crucifixion, when Christ's side is pierced, that's the moment that the veil opens. St. Ephrem talks about this, but when the veil opens, the holy place is shown to be empty. And there's a Syrian tradition that says at that moment, the Shekinah, if it was. If it was present in the temple, which other churches can say wasn't even present. But there's a tradition, Assyrian tradition, that says that that moment, the Shekinah glory, the presence of God in the temple, left the temple, it left the holy place, and it took up residence in the cross. Not just in the cross, but in every cross. So then there's this idea of like, the cross being taken up into heaven at this last moment as a. As an act of judgment. It's like God withdrawing his presence from people."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4018.06,"end":4019.7,"speaker":"Jonathan Pageau","text":"Yeah. So that just before the end."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4019.7,"end":4025.5,"speaker":"Richard Rohlin","text":"That's a. Yeah, yeah. So this is. I mean, this is heavy stuff. And there's a lot of. Really."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4026.38,"end":4057.07,"speaker":"Jonathan Pageau","text":"Yeah, definitely. And also the idea of the. Of the crown being taken up, like, let's say it's almost. There's almost a sense of something like the ascent of Enoch and the ascent of Elijah. I've talked about this before, where there seems to be a pattern, even the ascent of Moses, there seems to be a pattern that before a massive change, you know, before the end of a world, there seems to be this. The best is taken up. But it kind of makes sense in this, in that that's also what kind of causes the end of the world."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4057.07,"end":4075.14,"speaker":"Richard Rohlin","text":"Well, that's the story of Melchizedek, right. Is that, you know, this is in one of the Enochian books. I think it's second Enoch. That's the story of Melchizedek is right. Melchizedek is sort of like the last priest of Yahweh, and he's taken up into paradise so that he'll be preserved from the flood. Exactly right."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4075.14,"end":4146.8,"speaker":"Jonathan Pageau","text":"But it's also. It's almost like to be preserved from the flood, but it's also like the cause of the flood at the same time, because you're taking the seed out of the world. You're taking the meaning, you're taking the thing that joins things, that joins things together. And therefore then the world breaks down because you've removed its common principle or the, you know, the thing that makes it coalesce. Yeah. And so the holy people, like when, when we, when we hear this idea that like saints hold up the world through prayer, you know, it's something like that. It's like if the saints are actually functioning as fulcrums to, to, to preserve reality. And so, and if the saints are taken up, then. Then the world just falls apart, actually. So it seems like that's what's going on in the story of Enoch and the story of Elijah. But it also seems to be something like that that's happening here. Like you said, it's the Shekinah leaving the temple. But if the Shekinah leaves the temple, that's actually the presence of God. But now it's not just the presence of God, but it's actually, let's say that fractally the human authority itself or the good human authority, that which is an image of the reign of God in the world is also kind of all taken up into heaven."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4146.96,"end":4156.32,"speaker":"Richard Rohlin","text":"And so the phrase here, the phrase here that the, the last king of the Romans gives up his spirit, it's the same phrase that's used of Christ on the cross."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4156.72,"end":4161.12,"speaker":"Jonathan Pageau","text":"Yeah. So the Spirit ascends and then darkness appears."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4161.44,"end":4161.84,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4161.84,"end":4200.06,"speaker":"Jonathan Pageau","text":"You know, the spirit of spirit of Christ ascends and then darkness appears in the world the same. And the Shekinah goes up. Like you said, that tradition of the idea that when Christ dies and gives up his spirit, the Shekinah leaves the temple. You know, it's a beautiful image to help us understand what is going on and what that means for reality in general and how in this story of the apocalypse of pseudo Methodists, it makes sense that as the presence of God and human kingship in that presence leaves the world, then Gog and Magog and the Antichrist take over because there's nothing left to hold it together."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4200.06,"end":4256.45,"speaker":"Richard Rohlin","text":"This is even in the, this is even in, I mean, this is in the scriptures, in the Wisdom of Solomon, there's this long passage about why do good people die young sometimes? Right. And we actually, I think we read this in the church on like the eve, at vigil, on the eve of feasts of like certain, certain martyrs and monastic saints and things like this. But the, the, the explanation that's given there in the Scriptures is this idea that one of the reasons that sometimes good people die young is that it's a mercy toward them, that it's a judgment to the world. Right. Because the saints do uphold the world. It's the only. I mean, as far as I'm concerned, the only reason that the world continues to exist and be upheld right now is because there are people on Athos and there are people elsewhere in the world, holy people, people we don't know about, and that they're the real hidden cause, they're the real hidden life of the world. And that if that stops and you."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4256.45,"end":4271.57,"speaker":"Jonathan Pageau","text":"Can understand it bottom up and top down at the same time, it's almost like if the saint is taken up, then the world is destroyed. But the reason why the saint is being taken up is because the world doesn't hold together anymore. It's like those two things are kind of like happening at the same time."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4271.65,"end":4279.49,"speaker":"Richard Rohlin","text":"This is. People don't realize this, but this is what's going on in that dialogue between God and Abraham over whether or not Sodom is going to be."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4279.49,"end":4280.41,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4280.41,"end":4310.11,"speaker":"Richard Rohlin","text":"That's not. Just like Abraham is like, you know, trying to, trying to bargain God down, right? Things like this, like they're having a conversation in which God is actually showing the way that cities, nations, the entire cosmos is actually upheld, right? And it's by the righteous, it's by the prayers of the saints. So that even 10 righteous, right, even the prayers of 10 people who are really holy, really seeking after God would be enough to preserve the most wicked city that has ever existed from judgment."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4310.19,"end":4335.51,"speaker":"Jonathan Pageau","text":"And you almost have a sense in which the bet that Moses, the bet that Abraham seems to be making in that story is that his intercession will be enough to hold it together. His asking of God to hold the world together will be enough for it to hold together. And it seems it wasn't in that case, right? It was at least enough to remove his family from."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4335.51,"end":4338.99,"speaker":"Richard Rohlin","text":"But even then you have the best being taken out so that judgment can."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4339.26,"end":4340.62,"speaker":"Jonathan Pageau","text":"Can come, can fall upon the city."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4340.7,"end":4427.92,"speaker":"Richard Rohlin","text":"And it's, you know, it's. It's maybe from our standpoint, like, pretty sorry, that lot is the best. But I mean, but I mean, look at your own life. Not, not you specifically, John, us in general, like, like look at our own lives and all the things that are in our hearts, right? You know, so, yeah, I think this is, this is just a really powerful story. And I think that. I think that once you kind of go here, then there are a lot of things about even the modern history of Ethiopia that make you start to wonder a little bit, right? There's certainly, if nothing else you could kind of take away from this, this text in all probability is written at a time when this Christian, the author of this text, has seen the fracturing of the church in the Roman Empire and the breaking off of the non Calcedonian churches, followed almost immediately by the rise of Islam and the Arab conquest. Yeah, so he's seeing these things happen and he's trying to make sense of them. And what I think that he's managed to do is actually to intuit and to understand a very important symbolic pattern about how the world works and what the symbolism of these different peoples and countries is to the point that I think he's able to intuit some role that I do believe it seems Ethiopia might have to play."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4427.92,"end":4494.77,"speaker":"Jonathan Pageau","text":"But it's not just intuit. There's a relationship between intuition and causality in the sense that the writer of this text would probably also have known that after Chalcedon, that's when the nine saints went to Ethiopia from Syria, probably, or from Egypt, you know, from Egypt or Syria, for one of those places. I think it was from Egypt. But they, they, they, they go to Ethiopia and they see Ethiopia as the place to now build monasteries and to kind of create this bastion to hold the Christian civilization, at least in their perception. So you can understand that as the, as the, let's say with the advent of Islam, that that memory or that understanding all of that would, would be part of the story. Like, he also knew that, that these nine saints went there and probably brought a lot of the texts that were preserved. Like there was probably a lot of that was going on, you know, with, with the, this kind of renewal of Ethiopian monastic tradition. And so it all. There's a relationship between intuition and causality. All of this is all kind of happening at the same time."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4495.17,"end":4512.65,"speaker":"Richard Rohlin","text":"So what I really want to do, if people will let us. I mean, like, if, if you'll let me get away with. And if. I mean, I've been pretty all over the place, but if people will let us get away with another Ethiopia video, which I, which I think they will, I'd like to actually look at those nine saints, specifically look at their lives."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4512.89,"end":4521.37,"speaker":"Jonathan Pageau","text":"Yeah, it'd be good to also look at how Ethiopian Christianity functions, the relationship, because the ark is fractally present in all the churches."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4521.69,"end":4546,"speaker":"Richard Rohlin","text":"I've had a lot of people in the last two weeks, so there was a, there was, there's a consecration at our cathedral. We have. So we have a new bishop, which is great. But, but I got to see a lot of people that normally I only know on the Internet. And I've had so many people come up to me in the last like two weeks with like. So did you know that they actually have, like, a little model of the ark in every Ethiopian church, you know, like."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4547.68,"end":4550.08,"speaker":"Jonathan Pageau","text":"Yes, yes, I know there's a limit of things."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4551.36,"end":4565.12,"speaker":"Richard Rohlin","text":"So I think that. I think that now that we've kind of like. I feel like all our previous videos were just laying the groundwork to where we could talk about this text. And now that we've done that, I think maybe looking at Ethiopian Christianity a little deeper for our next video would be."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4565.44,"end":4607.14,"speaker":"Jonathan Pageau","text":"Yeah, I think it's a great idea and to talk a little bit about the different traditions and. And also the these kind of underground cities, this underground city as this microcosm of Jerusalem and, you know, this whole idea of a kind of a microcosm and a crossing of. Of places. Because if you go to these churches, some of the things you see are astounding, like their crusader crosses carved into these buildings. And there's this. You can see that so much has happened in these places that it really was seen as. All through the Middle Ages, this memory was preserved and was participated in the grand story. And so definitely, I think that will be a great thing to look at in our next discussion."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4607.14,"end":4607.86,"speaker":"Richard Rohlin","text":"Sounds good."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4608.18,"end":4653.14,"speaker":"Jonathan Pageau","text":"All right, everybody. So. So, yeah, I know that, but I know you can't get enough of Ethiopia, so we will definitely be talking about that in our next discussion. And so also be interviewing Dean Arnold, who has written a book on Ethiopia. Dean is an Orthodox Christian that I met, if that I met, I think, a few times, and he's written a book about Ethiopia, especially modern Ethiopia, and how it connects to this universal story, but really focusing on the modern history and how he sees Ethiopia's role, let's say, as the ark itself in the way that we've talked about. And so because I know very little about kind of modern Ethiopian history, it'll be interesting to also dive into that with him. So there'll be more on Ethiopia coming your way. So, Richard, thanks again for your time. I really love these discussions. So we can just keep going because they're a lot of fun."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4653.38,"end":4654.74,"speaker":"Richard Rohlin","text":"I'm down. Let's do it."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4655.06,"end":4675.19,"speaker":"Jonathan Pageau","text":"All right, so thanks, everybody, and don't forget to check out all of what Richard is doing in terms of Aman Soul, you know, and the books that he's participated in. We'll put all the links again in the description if you want to kind of follow his thread, because he's also been on a lot of podcasts, so maybe we can put a few of those links below that you can follow. You were on why are we talking about rabbits recently?"}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4675.27,"end":4686.19,"speaker":"Richard Rohlin","text":"As well, really great conversation, actually. I think just one of the most beautiful conversations I've had recently. It was just really lovely. And John is a great host, a very easy person to talk to, as you know."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4686.19,"end":4688.43,"speaker":"Jonathan Pageau","text":"He has a lot of insight. Definitely has a lot of insight insight."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4688.43,"end":4688.67,"speaker":"Richard Rohlin","text":"So."}
{"episode_id":"SW - #176 - 2021-09-25 - Richard Rohlin - From Alexander the Great to Ethiopia","start":4688.67,"end":4758.09,"speaker":"Jonathan Pageau","text":"So we'll put links to that in the description. Thanks everybody and we'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
