{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":0.4,"end":108.23,"speaker":"Jonathan Pageau","text":"When Marvel started their multiverse idea, this is of course an idea that has been there in comics for a very long time. But when they put it into the movie world, I became a little worried. I guess more than worried. I had the impression that they were going to use this multiverse notion to bring about, you know, the kind of diversity, inclusion, equity stuff that is so popular now, and that they would use it as a way to replace characters with everything that is kind of in line with the current political thinking. And we had a little bit of glimpse of that where in the Loki series, they seem to be using the multiverse notion to replace the male Loki with the female Loki. And as the series goes on, you know, this female Loki becomes more and more prominent. And at the end, it seems like the series is about her or something. And you saw that also in the animated what if series, where every episode seems to be about something like that. And so I was of course thinking that it was kind of a postmodern tool, because the whole multiverse idea is a kind of postmodern tool in itself. But then I was quite surprised when I saw the recent Spider man movie no Way Home. And in the Spider man movie no Way Home, I saw something that I've been thinking about for a very long time that I've been meditating on, which is the possibility of turning postmodernism into against itself, or rather transforming the chaos and the fragmentation and the meta awareness and the irony and the comment upon comment that you find in postmodernism and turning it into something like an apocalyptic type of storytelling. So I think that it, surprisingly enough, in the no Way Home movie, we get a glimpse of that. And so that's what I want to explore with you today of how no Way Home is a kind of Spider man apocalypse."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":119.81,"end":123.33,"speaker":"Announcer","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":133.81,"end":1205.87,"speaker":"Jonathan Pageau","text":"So if you're really interested in this question, you really will want to look out for Richard Rowland's book Sacramental Imagination, in which I've written a chapter that, that deals more extensively with this and how it. It also connected to the rest of comic book history and to kind of this certain themes in comic book history which. Which led out into popular culture. But in terms of no Way Home, what you have in the no Way Home movie is this break in of the metaverse. And what's really smart and witty about the way they did it is that they treated the metaverse as a way to join together the different iterations of Spider man movies that have existed in the past 30 years or whatever. And so 20 years, I guess. I don't know exactly how long. And so what happens is, as the metaverse is bridged, then these bad guys start to come in and the spider men come in, and in it, there are three versions, three series that have existed in the past several years. One, which of course was with Tobey Maguire, Spider man, then the Amazing Spider man with Andrew Barfield, and then ultimately the MCU version with Tom Holland. And so what's interesting about it is it has all the kind of postmodern characteristics. First of all, it's very meta because it treats these different iterations of the franchises as universes that kind of coexist, which they do in the story world. And then they take these stories and they drag them into one story. So first off, it's something like what Avengers was in the first place. It's something like the superhero team motif, which we've seen in superhero comics for a very long time, which is the capacity to take independent creations like Spider Man, Wonder Woman, Superman, which are not created by the same people, but then bring them together into a common story, which usually has more cosmic stakes and creates this kind of, you know, Legion of Superheroes or all the different superhero teams that exist now. There's something about that which is very fascinating. And in this version and in the multiverse version, and especially in this particular version, there's a way in which they kind of expose the story structure of doing that by taking different iterations of the same story and smashing them together into one giant movie. And so there's, like I said, there's a kind of self awareness of storytelling in it. And in the movie there's a way in which even some of the comments about the different characters bring this about. So a simple example is that Andrew Barfield was part of a, an iteration called Amazing Spider man, which was less popular and less critically acclaimed. And in the movie, the character, the Spider man, the Andrew Barfield character, he, you know, kind of, he kind of, let's say, demeans himself and compares himself to the other Spider man and says how his story is not as good and he's not as good. An iteration of Spider man, to which the other two spider men answer, no, no, no, you're amazing. Which is a reference to the name of his own iteration, which was the Amazing Spider Man. And so there's kind of a funny comment, but it's also an interesting meta narrative. It's something like they are showing us the fourth wall without breaking it. Like an in story version of the Fourth wall where they're aware of their story, of their story existence and they're exposing it inside the story. You saw that in certain kind of, let's say 20th century authors like Borges who talk, who have this notion of the, you know, the characters in a story that are self aware that they are characters in the story. There are many iterations that in kind of postmodern storytelling. So you have that, but because it's like an in world awareness and it's something in a way in which they expose the fourth wall without breaking it, which is actually pretty interesting as a way to approach this thing. Now the most important part, which helps you show that it is an apocalypse now. What do we say, what do we mean by apocalypse now? An apocalypse is when we talk about a revelation, like in the book of Revelation. It's something which is both shows the end of something, but also is a revelation. It's a revelation about the pattern. And this is what is happening in this movie. And so it's not just about kind of bringing in these different kind of Spider Man. They do it in a way that instead of the usual postmodern technique, which is to kind of jam in all these different type of stories, I tend to call it a collage type of storytelling. So think for example of American Gods, like Neil Gaiman's American Gods, where he takes all these gods and jams them together into one novel, into one story. But he does it in a way that is, that is fragmented and kind of ironic and also idiosyncratic. He's constantly trying to show the idiosyncrasy of these incarnated gods as if they're just regular people that just happen to be gods. So you can really see a postmodern move in something like American Gods or the different versions of this. Think of stories like Shrek, for example, that take all these fairy tales and jam them into one story. So this is the collage technique of postmodernism. And in the Shrek version, what you have is again a kind of cynical inverted, a play with the fairy tales in which you kind of upend expectations, you turn things upside down. You know, the hero is the ogre, the princess becomes an ogre, the prince is, is the bad guy, etc. Etc. Etc. So you, you, you always are, you're always upending expectations. You saw many, many versions of this type of, of technique, whether it be again, in the fairy tale world. There was that Disney series, once upon a time. There was a DC Vertigo series called Fables, in which is all this kind of dark retelling of fairy tales where all the fairy tale characters exist together. Now, this, of course, is taken to some, maybe to its extreme in something like American Gods, where all the gods kind of coexist in this cynical, fragmented world that lacks unity. Now, what happens in the Spider man movie is it seems like it's going to go down that road and it's pulling in all these bad guys, all these different characters. But what the story does, which is different from something like American Gods, is that it uses the collage approach to bring about a revelation about the Spider man pattern and to bring about a way in which it is actually kind of restored and helps you show the unity of the pattern within its multiplicity. So how does it do that? First of all, what's interesting about the Spider man story, the MCU version of the Spider man, is that it's already a kind of idiosyncratic version of the pattern. So if you know the Spider man story from the comic books, the MCU version is very odd because Spider man appears. You know, first of all, he doesn't seem to have an Uncle Ben. His Uncle Ben obviously didn't die. And then his Aunt May is young. He's also very quickly becomes rich and famous and has all this power which is given to him by being in contact with Tony Stark. This is very different from the comic book character who is a teenager who's poor, who's like a struggling journalist, and he has all these problems of a regular Joe, all the while trying to be a superhero. And the poor part is important. He's always kind of struggling, and he sews his own costume. He's always having trouble with his stuff. And so it's already. It's almost like hinting at the metaverse in this version already, it's hinting at the variations on the Spider man theme. And so in the movie, what they do is that they take that and now they bring it together. And the way they do it is they have the different characters, the different Spider man character, heal the sins and cover the sins, and the lacks of the other Spider man characters. And this is really a very genius storytelling technique. So let me give you a few examples of how that happens. Now, of course, there's a lot of interesting things that happen. So first of all, you kind of see this exploring of multiplicity and this exploring of multiplicity in a way, which makes you actually see the deeper pattern and doesn't kind of show the idiosyncratic part of it. And so, like, I Said in the original Spider man version, Spider man, part of his origin stories is that before Uncle Ben dies, the last thing that Uncle Bill tells Spider man is, with great power comes great responsibility. Then Uncle Ben dies because Spider man is out there, you know, trying to make a bunch of money, and he lets a criminal go by him without stopping him. And so because of that, Uncle Ben dies. Now, that part of the story isn't in the MCU movie. In the first movie iteration, the Tobey Maguire version, you do have that. And that leads Tobey Maguire to be kind of part of the cause of the death of the guy who killed Uncle Ben. He wants to kill him. And then he does end up dying. And ultimately it also leads Tobey Maguire to the death of Norman Osborn, the Goblin. And so this is something like the failings of Tobey Maguire's Spider man, you know, his sins and his failings, the things that weren't brought together, you could say. So in the MCU version, now you have this powerful moment when Aunt May says to Peter Parker, with great power comes great responsibility. And when she says that, although it's completely different from the original story, when she says that if you know the Spider man story, it will cause an insight in you and you will understand that she is going to die and you're going to know that before it happens. Which is something that in movies usually they tend to want to do the opposite. They want to kind of bring something unexpected to you. And that is what was going to cause insight, right? So I make you think that he's the bad guy, and then I. Then all of a sudden I reveal that he's the. The other person is the bad guy. Misdirection, which causes insight. Now, this is a different type of insight, one which we. Which is actually part of very, very ancient storytelling, which is a type of insight which comes from knowing the pattern and then seeing a variation on it that brings you into the pattern itself. And so when Aunt May says, with great power comes great responsibility, they're spoiling what's going to happen. You know that she's going to die. But the way they do it causes you to have insight on about the nature of the Spider man pattern. So it causes this. This interesting little moment of insight. So that is something which is going on now in this version, Norman Osborn kills Aunt May after she said that to Peter Parker. And so this leads the Tom Holland version at the end of the movie to try to kill Norman Osborn. And the person that stops him from doing that is Tobey Maguire. So Tony Maguire stops Tom Holland from killing Norman Osborn. And in doing that, he is doing three things he is healing. First, the fact that that he participated in the death of the one who killed Uncle Ben, that he was part of the death of Norman Osborn. And he also stops this iteration of Spider man of going down that path. And so they're using the variation on the patterns to kind of heal the different sins. And so one Spider man heals his own sins, and by doing that, he's also kind of covering or preventing the other one from going down the same dark path he has. It's quite interesting storytelling. And another version of that is, of course, in the Andrew Barfield version. So in the comic books, Spider man loses his girlfriend, Gwen Stacy. Gwen Stacy falls, and Spider man is incapable of catching her, and she dies. And this is seen as one of an important moment in Marvel comics and an important moment in also a kind of maturation of comics where comics move into a more mature form of storytelling. Now, this version of the Fall of Gwen Stacy was already given a twist in the Tobey Maguire version of the movie, where M.J. falls and Tobey Maguire is actually capable of saving her. And so there's already an interesting kind of variation on the pattern, which is about this woman falling and whether or not Spider man can catch her. And in the version, the Tobey Maguire version, he does catch her. Now, in the Andrew Barfield version, it's Gwen Stacy, and he's not able to catch her. She dies. So you can see that it is this interesting kind of variation on the pattern. And, you know, it kind of shows you the multiplicity. But now, in the MCU version, Andrew Barfield is the one that now saves the falling mj. And so the MJ from the MCU universe, the MCU version, she falls like Gwen Stacy, like the MJ from the first Tobey Maguire movie. And Andrew Barfield is able to save her. And in saving her, he heals his own incapacity to have saved Gwen Stacy. In knowing that he saves the version of the MCU version of Spider man his own love. And so it's like he's not even doing it for himself. He ends up doing it for Tom Holland. But. But in doing that, but also in kind of looping up his own problem and his own sin, he's able to kind of heal himself, but also prevent that damage from going to the current version of Spider Man. And so it's really powerful. So it's taking this weird postmodern moment of, we call intertextuality and so you have all these threads of text and variations on the Spider man pattern. You know, the different falls and saving and not saving, all the possibilities. And. And then it wraps it up in a nice bow and reveals something about the nature of the Spider man pattern and kind of heals the Spider man pattern at the same time. So it's very interesting. And so ultimately you can see how all of this leads to something like the end of a world. And the end of the world is shown in the Spider man movie, in the MCU version as the end of the Avengers moment. And so you see the Statue of Liberty, they're putting up this like weird Captain America shield on the Statue of Liberty. And then because of this fight around the Statue of Liberty, the shield falls and kind of breaks and it. It reveals the Statue of Liberty again. And so it's the end of the Avengers cycle of storytelling. It kind of brings about a new version of the storytelling and it leads to everybody forgetting who Peter Parker is. And so there is this forgetting in death. But the forgetting is also, at the same time, a very powerful remembering. Remembering in the sense that because the forgetting of Peter Parker happens in Peter Parker sacrificing himself, what ends up happening in the movie is something like a return to the garden and return to the garden in this version. Or maybe something like a new Jerusalem or heavenly Jerusalem coming down in the version. It means that it's a recapturing and a re entering into the original, closer to the original comic book version of the story. And so the movie ends with the Tom Holland version of Spider man basically becoming poor again, becoming a kind of unknown guy. All the people that knew who he was now don't know anymore. So he moves into this in this like, slimy New York apartment, and you feel like he is now closer to the Spider man pattern that we knew from the 1960s when Stan Lee wrote the character. And so this is what I am thinking of when I can see this as a kind of. You could call it something like a Spider man apocalypse. So what's interesting, and I think what's important for us to understand is of course, I mean, who cares about Spider Man? What's interesting about it is that it shows us a way into apocalyptic storytelling. And it is something that you could say that both my brother Matir and I tried to do and are trying to do with God's dog. You won't see that at first in the first book, but as the story progresses, you're going to start to see how what we've been trying to do is take this moment of postmodernism, this moment of collage, this moment of multiplicity, and use it towards something like synthesis, towards something like bringing back a universe and universal story pattern. So the Spider man movie and this approach to storytelling, we could call it like a meta hero's journey where it's not just within the story that the hero goes down into the abyss and kind of comes back up, but it's actually the story structures themselves. This going into postmodernism, this breakdown of storytelling, right, this variation, this kind of excess of variation and of potentiality which now is kind of being brought back into something like mythological, a new mythological approach or a apocalyptic version of storytelling. So you can imagine something like a Bach fugue, right, where you have the statement at the beginning, and then you move into variation and variation and variation. And you're always trying actually to kind of see hints of the pattern in the variation within the fugue. And as you move closer towards the end, you can kind of see the pattern returning. And. And finally we have this kind of final restatement of the original pattern. And I think that this is something that we saw, we can imagine that the. The no Way Home Movie was doing. And it is something which I think that if you're interested in storytelling, it is a type of storytelling that we need to be very attentive to and can make it. Make it that we are even. We can explore idiosyncrasy, we can explore the strange, we can kind of use even the strange to surprise people in a way that is revealing a mystery about how the pattern ultimately comes together. And so I hope this was useful, everybody. Hope you enjoyed it. Don't forget that I have a much better version of this, this video and a fuller version in the upcoming book by Richard Rowland. So check it out. And thanks everybody for your support and I'll talk to you very soon."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":1206.11,"end":1225.51,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":1225.51,"end":1226.75,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":1226.75,"end":1241.03,"speaker":"Announcer","text":"In the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":1241.03,"end":1243.31,"speaker":"Jonathan Pageau","text":"Everybody knows that's the best way to."}
{"episode_id":"SW - #248 - 2022-08-17 - The Spider-Man Apocalypse","start":1243.31,"end":1268.19,"speaker":"Announcer","text":"Get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
