{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":0.64,"end":165.31,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'm playing for you a discussion I had with Andrew Gould. Andrew Gould is an architectural designer, a liturgical artist, and he is also a very good friend of mine. I'm actually the godfather to his last son. We work together on several projects. His aesthetic is very close to mine. His way of viewing liturgical art, I would say, is very complementary to mine. And so you will definitely enjoy this discussion. Of course, talking about his work, it would be useful for you to check out his website to look up Andrew Gould online or watch the actual video that we put out, if you want to also see some imagery of his architecture and of his liturgical design. But nonetheless, even without those images, you will find the discussion of community, of meaning, of how things come together visually and also in terms of how the world lays itself out. I think you'll find that very interesting as well. Don't forget that all I'm doing here online, this podcast, these videos, is due to your generous support. So please check out the symbolicworld.com to find out ways that you can support this podcast. Of course, sharing, subscribing, and also leaving a review of this podcast wherever it is that you listen to. Your podcast is also extremely helpful for us to get some visibility, so I hope you enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World. Hello, everybody. I would like to introduce you to Andrew Gould. I'm pretty excited. It's the first time that I'm doing this live discussion with someone directly, with them sitting there in front of me. And it's great because Andrew is a longtime collaborator of mine. He's someone whose work I admire very much. We've been working together for several years. We started some projects together, the Orthodox Arts Journal and many liturgical arts projects. He's a building designer. He's a liturgical designer. He designed several churches and several buildings in Charleston and all over the US I'm really looking forward to talking with him about art and about beauty and its place in the world and also the type of work that he's doing. Andrew, just to start, maybe you can tell, because people I don't think might not have heard about you, maybe you can tell them a little bit about what you do and maybe how you came to where you are in terms of your work."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":166.51,"end":243.06,"speaker":"Andrew Gould","text":"Well, I'm an architectural designer and a liturgical artist. I'm one of these people who's always known what I want to do. I've wanted to be an architect since I was 2 years old, and I started getting introduced to the church when I was A teenager, I actually got introduced to Christianity through playing the pipe organ, which got me into churches. And I really fell in love with the music and architecture and liturgical art of church. And, well, I've gone through a long path. I was an Anglican for a long time, and about 15 years ago, I converted to Eastern Orthodoxy. And now I specialize in the design of Eastern Orthodox churches, in the design and manufacture of the furnishings for them. And I also have a specialty in that. I live in the downtown Charleston historic district here in South Carolina. I design a lot of houses and other buildings within the historic district that have to fit into the sort of architecture here. So, you know, I've got a number of different things I do, but, you know, it's all kind of. It's all kind of medievalist and looking towards the beauty and romance of the past. Is this kind of the thing that ties it all together?"}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":243.54,"end":270.51,"speaker":"Jonathan Pageau","text":"And maybe that'd be my first question is what is your approach to the past? Because the past, for some people can seem like a burden, something that is very heavy that we need to escape from. Other people are very traditionalist and tied to the past almost in a slavish manner. But what is your vision of how the past interacts with us today, how we can live, make our today? Thinking about the past and how we live in it?"}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":272.11,"end":375.01,"speaker":"Andrew Gould","text":"Well, that's a big question. I'm a great lover of the past. Whenever I can, I travel to old towns, old cities, visit old buildings. Almost anything old I just intrinsically love. And I'm one of these people who feels like I'm not quite at home in the modern world. Everybody talks about how this is the age of the greatest wealth and comfort and convenience in the history of the world. And, you know, I suppose I can see that, but it's awfully hard for me to see that there's anything particularly beautiful or worthwhile about the modern world compared to the beauties that I see in the art and architecture of the past. So when I'm designing buildings, I'm always thinking about how it would have been done. Supposing somebody in the 19th or 18th or 14th or 9th century, whatever the project is, would have tackled this design project and built that building. I'm always thinking about how would it have been done in those days. You know, that doesn't mean I'm making copies of old buildings or that I'm using archaic construction techniques. You know, I'm working in the modern age. So I have to design buildings that suit people's modern needs and are buildable out of modern construction materials. But where possible, I try to create a sort of a story, a romantic fiction, you might say, about how the building could have happened had it been happening in another age that brings some of that beauty and character that we see in old buildings into buildings nowadays."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":375.81,"end":417.86,"speaker":"Jonathan Pageau","text":"One of the things that I've noticed that is surprising is that although it's obvious that you're basing your designs on the past, you can see that you're using certain patterns, certain proportions, certain materials that are identified with the past. There's also a kind of buoyancy in what you're doing. There's something, there's something playful about your buildings and your designs that makes it feel like you're not exactly, like you said, you're not directly copying something from the past, but you're almost as if the past is this like giant playground that you jump into and that you connect things together and you create these, these almost fantastical buildings, but that still feel comfortable, that still feel like a home."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":418.66,"end":582.61,"speaker":"Andrew Gould","text":"That's right, yeah. And I'm usually playing at least two historical references off of one another in my architecture, again because it's too easy to just copy old buildings. And when people do copy old buildings, they tend to come off as kind of cold and contrived. So I'm very fortunate that I have this specialty, designing Orthodox churches, particularly Russian Orthodox churches, because there's not a whole lot of historical precedent for Orthodox churches in this country. So most of the time when I'm going to be designing a church, I have to come up with a sort of historical question. Supposing there'd been Russian Orthodox people in New Mexico in the 16th century Designing Russian Orthodox churches alongside the Spanish missions. That's a really far fetched historical fantasy. But from on an aesthetic standpoint, there's a solution to that question. You know, it never happened, but had history turned out differently, it might have happened. You know, my own church here in Charleston is the first Orthodox church I designed. And Charleston, being an important historic district, has a wonderful heritage of how buildings are built, the materials that are used, the general aesthetic character of the buildings. And there's many different kinds of churches, different denominations in the downtown area. So when I said about designing an Orthodox church for Charleston, I came up with this sort of story. Well, suppose that among the various immigrant groups that were in Charleston, there were Russians. And suppose they built a Russian Orthodox church here in the mid 19th century. That's not so far fetched a fantasy that happened in New York, it happened in San Francisco. It might have happened here if Russians had come here. But if we look at the way Russians built churches in the different corners of the world back when the Russian Empire pretty much stretched from one end of the world to the other, we can get a pretty good sense of how they adapted to local climates, local building traditions, and brought the architectural fashions of the time into those places and built churches that seemed like they belonged there. And I can, by extension, kind of guess what they would have looked like had they been built here. I think it's been very successful because people look at the church as I design, and they say that that looks like it belongs here. It looks like it's always been here. And in many cases, they downright don't believe that it's a new building. They're just convinced it's a restoration of an old building in some capacity. Which is pretty funny."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":584.08,"end":683.53,"speaker":"Jonathan Pageau","text":"But it's interesting because if you. That's the impression that I get is that the first impression you get from it is that this is home. This belongs here. There's something about it that totally fits the environment that it's there. But then, as you spend a bit of time in the space, and as you're looking and you're circulating the space, there's something else that comes out which is somewhat. This fantastical element that you talk about. To me, it seems like the fantastical aspect of the story that you're telling about the building, that you're kind of creating this fiction about a building. It appears not just in the story, but it ends up appearing in the building itself. There are quirky details, something about it that makes you dream of something that's both possible and impossible at the same time. I'll be showing some images as we're talking. For example, the church that was just built in Greenville, for example. It is an Orthodox church, but you can see when you look at the way it's built, you know, with the wood siding and the manner that it feels like it's like a North American building. But the structure of it is so orthodox that joining together feels both completely fantastical, but also totally in its place. And so there is. What I'm getting to is that there is an aspect of it which is innovative. There's an innovation in the building and. And in the. In putting it there. But the innovation comes about in a desire to make something which fits the place totally. Not out of our. Out of the artistic. This kind of artistic temperament of wanting to impose their style or be."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":683.61,"end":684.13,"speaker":"Andrew Gould","text":"That's right."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":684.13,"end":684.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":684.57,"end":749.02,"speaker":"Andrew Gould","text":"You know, years Ago, I gave a talk on the characteristics of Orthodox church architecture. I was trying to look at all the Orthodox churches in the world and try to come up with some idea of what are the commonalities among them. And I observed a peculiar thing, that they all exhibit a sense of universality. That is that they all have a quality of sort of imperial Rome. Like they have an architectural quality to them that seems intrinsic to human civilization, like that they could exist absolutely anywhere. That's one quality Orthodox churches tend to have. But they also have the quality of being locally specific. They tend to be extremely expressive of the climate, the geography, the national character of the country they're built in. And then on another hand, they seem to always have a tendency to be exotic. If we look back at the first famous great Orthodox church, Hagia Sophia."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":751.33,"end":751.41,"speaker":"Jonathan Pageau","text":"You."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":751.41,"end":946.19,"speaker":"Andrew Gould","text":"Know, that was built in Imperial Rome, and yet it does not use the Roman orders. The columns in that church don't follow the ancient orders of Doric, Corinthian, Ionic, which is astonishing because the Romans and the Greeks before them had been using those orders for all buildings for a thousand years. And all of a sudden, Justinian builds the greatest and most important civic building in his entire empire. And it's just completely bizarre looking. It would have looked utterly strange to people in its time. Instead of having the classic columns and lintels, it's all arches and domes. Instead of having Corinthian or Ionic columns, it has columns that sort of. They're called windblown acanthus. They have all of these sort of disorderly, curvaceous shapes in them. And most of these ornamental details are known to have come from the architecture of the Sassanid Persian Empire, which was the great enemy of the Byzantine Romans. They actually chose to ornament their most important civic temple in the style of their Eastern enemy. Why did they do this? Well, in part, the Roman Empire at this time in the 6th century, at the dawn of the Orthodox Church, was struggling to distance itself from its pagan heritage, from that huge bureaucratic weight of the Western Roman Empire. They were trying to be something fresh and new, something exotic. And you see this aesthetic interest going through Orthodox churches, through their entire history. A thousand years after Hagia Sophia, Tsar Ivan the Terrible built the famous Cathedral of St. Basil's in Red Square in Moscow. I mean, the strangest looking building in the world, with all those onion domes with the crazy twisty shapes and wild colors and crazy patterns in the brickwork. I mean, you know, we tend to, as historians, we tend to look back at historic Buildings and say, you know, that was the normal way of building back then. It seems strange to us, but it was normal to them. You can't convince me, looking at St. Basil's in Red Square, that to 16th century Russians, that building looked normal. That building must have looked as bizarre to them as it does to us. And it was clearly designed to look that way because they wanted their churches to look like they're not of this world. They're part of the kingdom of heaven, they're part of the new Jerusalem. They're not like your house or my house. They're not like the bank down the street. They're not like the building the mayor lives in. They're from the kingdom of God. They're like the ivory palace. So that's the quality I strive for. All three of those qualities, I should say. And I try to make my buildings look universally recognizable as the food of human civilization. I try to make them look like they're locally meaningful and expression of their culture. And I try to make them look like they're not quite from this world. They belong to the realm of story and romance. And as true as this is for Orthodox churches, I think it can be equally true for any kind of building."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":947.04,"end":956.08,"speaker":"Jonathan Pageau","text":"I think that there's something about those three qualities that you bring up that really speaks about the Orthodox vision, not just of building, but of Christianity itself."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":956.72,"end":957.12,"speaker":"Andrew Gould","text":"Being."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":958.96,"end":1012.64,"speaker":"Jonathan Pageau","text":"This joining of the divine and the human, but also being at once a Semitic religion, which became the religion of the Roman Empire and then established itself in the East. And so this kind of desire to join together things that seemed impossible, but I think even more profoundly, there's something also about the capacity to have something universal, like the structure of an Orthodox church. You know, the dome and the square or the basilica that we use has this very ordered structure. But then you can see all the variations of these buildings where, you know, sometimes even that pattern almost disappears within the church. You almost have to know that. That it's there. But if you looked at it right away, you wouldn't get the sense of that. So this joining of the universal in particular seems to me, I mean, seems to be so much about what Christianity has been in its history."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1013.04,"end":1013.6,"speaker":"Andrew Gould","text":"Yeah."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1014.88,"end":1028.44,"speaker":"Jonathan Pageau","text":"And so how do you then translate that, let's say, to. Cause building churches is something. But you also work on houses, you create neighborhoods. You try to bring that same thinking, let's say, into your buildings."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1028.44,"end":1029.04,"speaker":"Andrew Gould","text":"That's right."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1029.04,"end":1029.44,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1029.8,"end":1134.54,"speaker":"Andrew Gould","text":"That's right. Well, I use a technique when I design a grouping of houses or a whole neighborhood where I Try to make it. I try to design it as though it's evolving over time. Because when we look at a medieval town in Europe, which we see as just immensely beautiful, nobody designed that town. It just evolved that way, grew that way, almost like a lichen, like a symbiotic relationship of different things with different agendas. And, you know, somebody would put a house there, and then the next guy would come along and he'd build his house next to it, and the next guy. And the space left over was the street. And the street wasn't straight, it was curving, because nobody had really surveyed it out. And, you know, the stores were built where it seemed to make sense to somebody to build the store. And then that building would get torn down, a taller one would be built there, and everybody would be kind of reacting to everybody else, but there was nobody really in charge of it. And this we can easily see, looking at European towns creates the greatest beauty. It's sort of like an icon of civilization, an icon of people living together harmoniously, which is much more beautiful than the sort of fascist, classicist vision of the great. The great city planner who designs everything. And people will just live there, and they better be happy with it. That produces a certain kind of order that has a kind of beauty of itself. But it's not exactly the beauty of love. It's not exactly the beauty of everybody just getting along that you see in a medieval town planned."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1135.42,"end":1156.94,"speaker":"Jonathan Pageau","text":"But there's also. In the medieval town, there will be something, for example, like the. The cathedral in the middle or the church in the center will have a more, let's say, deliberate aspect to it. Then as you move out into the community, then you have this more organic development of relationship. There's almost like this hierarchy of relationships."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1157.18,"end":1299.13,"speaker":"Andrew Gould","text":"There is a hierarchy you'll often see in many medieval cities. You'll see one hilltop has the cathedral, another hilltop has the king's palace. And so there's this sort of duality of secular and sacred rule over the city. But isn't it fascinating how they completely fail to actually rule the city, that there's all this total chaos of twisty streets and everything mixed together in between, and the forces of order are trying to push themselves to the top and say, look, look. Order, symmetry. And everybody else is just saying, we're going to do what we're going to do. And that's, you know, again, that's the beauty of human civilization, is the tension between the two. Well, it's tension that just resolves itself all by itself. And, you know, ultimately, It's a city full of people just drinking beer in cafes and getting along just fine. You know, that's the beauty of human civilization that we see in these unplanned medieval cities. So I try to. When I design, I try to keep that kind of relaxed quality that even if I am the one designing everything, I don't make it look that way. And the way I do that is I don't design everything at once. I design the first house, and I just imagine, well, maybe the person who lives in this house likes baroque architecture and will make that house really ornate. And I get that house all done, and that's where it is. And I say, well, let's suppose the next person comes along and it's no longer 1650, now it's 1710. So this person's going to have a more Georgian, classical kind of house. It's going to be more restrained, more symmetrical, and he's going to put it right here, and I'll design that house. And then the next person comes along. Now it's 1840, so now we've got another style, and he's going to put his house here. And now it's the Victorian time. So we're going to have a house that's painted really interesting Victorian colors, with big front porch, and that one's going to go there. It's arbitrary, but. But the point is, I try not to go back. I try not to say, oh, well, because I've made this house like that. It would be great if the house at the other end of the street also had a porch to be symmetrical. No, no, no. I just kind of let each thing be its own thing and imagine that the next person's reacting to that. And I can contrive a street of houses that looks like nobody actually designed it."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1299.13,"end":1323.18,"speaker":"Jonathan Pageau","text":"Right. But the thing is, this is my. I guess this is going to be. My next question is that if I look at your work, you do that, but you don't come up to the 20th century, or let's say the later part of the 20th century. That is, you've kind of cut that part out. And I'm curious to know, why is it that you don't take as much influence from modern styles or from kind of post World War II architecture?"}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1324.3,"end":1491.85,"speaker":"Andrew Gould","text":"Well, part of it's just practical. The reality is doing a good job. Building in a contemporary modernist style is really hard and really expensive, and not very many clients want that. At least my clients don't usually want that. There's other architects who specialize in that. But more philosophically speaking, I think we can see that the architecture of what we might say sort of refined European civilization, the architecture of the late Middle Ages through, you know, the 1940 or so, although it's a progression of many styles and expresses many, many sort of characters and personalities, it's basically all a common expression of one idea, one idea of what beauty and harmony and the good life of living in a civic utopia means to European culture. Whereas we see a real disjoint with modernistic architecture, it no longer expresses the same anthropology. I kind of think of modernism as a philosophy, or perhaps I might even call it a heresy, an anthropological heresy. Basically, what modernists and modernist architects believe is that man of nowadays is a fundamentally different creature for man of the old days. They kind of think that man of 1650 and man of 1850 were really the same man, and they were building similar buildings in their ignorance because they didn't know any better. But man of post 1940 or so is an enlightened being, a sort of godlike person who stands above all of that history and that nowadays man knows that buildings are machines for living in that they're not just works of craftsmanship like they used to be. They're now a sort of icon of social science, where they're an expression of how we live our incredibly engineered modern lives. And true modernist believers in modernism like that, they actually think that it's simply wrong to build traditional buildings. They think that, well, it was fine for somebody 100 years ago to build a traditional building, that for somebody now to build a traditional building is intrinsically fake because we're a different creature."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1493.21,"end":1496.57,"speaker":"Jonathan Pageau","text":"There's also this idea of progress that."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1496.73,"end":1608.26,"speaker":"Andrew Gould","text":"You can't go back, but that it's simply alien to our nature. You know, it's like as alien as if I decided to put like a Japanese pagoda in the middle of my street among all my European style houses. It's like that's not of our culture. That has nothing to do with us anymore. It's not ours. That's what they see with the kind of traditional buildings that I design is that it's somehow failing to show that modern man is a different person than historic man. Well, of course, as Christians, we can't believe that. As Christians, we believe that God created man in his image, and that image is unchanging and that man today is the same as man yesterday. No matter how many delusional, totalitarian theories of reshaping the world in our image we may invent, we're the same people. We Used to be. And the same things are beautiful to our eyes as used to be. So for that reason, I have a philosophical problem with modernism. That doesn't mean I don't think that good modernist buildings are beautiful. I love many modernist buildings, but I find them beautiful in the same kind of way that I find clockwork mechanisms and circuit boards and fine machinery and all sorts of things that are very alien to our sort of organic human nature. Many of these things are extremely beautiful. But, you know, as beautiful as I find, you know, a polished brass clockwork mechanism, I don't really want to live in that. You know, it's a marvel to behold, but it's. It's not really the natural expression of our human nature to live in or to worship in."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1609.94,"end":1662.32,"speaker":"Jonathan Pageau","text":"And there is something about, let's say, this alienation or the modern alienation that everybody is experiencing. Everybody kind of gets this sense of this alienation from our communities, from the meaning that has thing that has given meaning to civilization for so long. And it seems like you can see it in the way that, first of all, how cities are our plan, most of it, you know, this urban sprawl, these just these suburban houses built, you know, at infinitum without any town center, without anything bringing them together, but also just this, you know, just these houses all next to each other, all made of the cheapest material they can. There's a lack of understanding of how the place we live in participates in our life, in our identity and our community. And so they don't seem to care about thinking about these things."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1662.96,"end":1714.81,"speaker":"Andrew Gould","text":"Well, yeah, and you're right. If you ask me what the architectural problem of the world is, it's not seriously modernistic buildings. Seriously, modernistic buildings are relatively rare. The problem is just mundane architecture that people don't really think of as art at all. You know, just run of the mill suburban houses, which are mostly traditionally styled in a very superficial way, but they completely fail to capture that character, that ethos of buildings of centuries past. And unfortunately, the whole industry of design and building of houses and of the. And of the infrastructure that connects them has been so detached from tradition."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1717.53,"end":1717.85,"speaker":"Jonathan Pageau","text":"Through."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1717.85,"end":1776.98,"speaker":"Andrew Gould","text":"The broad influence of modernism in the later 20th century, that it's very, very difficult to get back there. Although I work hard to make my buildings look like they just grew there, nobody really designed them. In fact, the only way I can get them built and get them to have that character is, is if I take absolute control over every little detail and just insist that everything be done exactly as I dictate it's. A strange paradox, but in the 19th century, you could just give a builder a set of plans that just shows a rectangular house with four rooms and six windows on the front, and he'd build it beautifully and it would look great. Nowadays, anything that you don't dictate gets built all along and gets built the ugliest possible way. So, yeah, I have to be quite the fascist architect in order to achieve the look of nobody having designed it."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1776.98,"end":1839.76,"speaker":"Jonathan Pageau","text":"Yeah. But then also the irony about your buildings is that because we live in this world that is so gray or so, you know, so plastic, that when someone encounters the building, it's this wondrous surprise. It's almost like opening up a fairy tale book or opening up some forgotten mystery that we haven't encountered before. And so although your buildings are in a certain manner, they try to have this kind of, no one designed them, but they also end up being this total surprise to people. I mean, I have seen people come to the church here in Charleston for the first time, and you can just see in their eyes that it's like they're children again. And they're walking into this. They're walking into a story. A story, exactly. And you get that sense. That's also a paradox. It's something which is trying to be so part of the landscape, so integrated, and ends up having the opposite effect. Just because we live in such a banal, boring world."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1840.16,"end":1868.59,"speaker":"Andrew Gould","text":"Yeah. And it's a shock to people to see that such beauty can still be created nowadays because so many people have gotten resigned to the experience that everything new is bland and boring and. Yeah, it's true. When seeing a new building that's as beautiful as a historic building gives people a special pleasure and a special appreciation that they actually wouldn't see in the historic building. You know, it's kind of like the difference."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1868.59,"end":1869.99,"speaker":"Jonathan Pageau","text":"It gives you hope. It gives you hope."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1870.23,"end":1907.66,"speaker":"Andrew Gould","text":"What it does. And it also gives you a sense of ownership. It's like seeing other people's children do something that children do, you know, it's just, you know, that's what children do. But seeing your own child draw their first drawing, you know, oh, it's amazing. That's the best thing I ever saw, you know, because it's yours. Yeah. So it gives people a very particular and unexpected joy to come into one of these buildings. And when it finally sinks in that this is actually a completely new building. Yeah. They're quite shocked and very happy about it, usually."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":1908.46,"end":2070.02,"speaker":"Jonathan Pageau","text":"Yeah. And I think that that's something that. What I felt is the same in our work that we've been doing together, that the designs that we've worked on, that we've had a mix of your designs and my carvings, and we brought things together. I get the same sense. I get the sense that we're looking at an object which. Which is totally traditional. The things we've done are totally traditional. No one could complain about that. We're trying to somehow innovate or insert our own ideas or whatever. But when you look at them, there's this complete surprise at the same time. And when I show people what we're doing, I get that sense. I show people, people I meet on the street who ask me what I'm doing, and I say, I make religious art. I kind of downplay it, really. And I say, I'm a religious carver and I make people, first of all, they don't believe you. They think, yeah, that doesn't exist anymore here in North America. That's not possible. And then if they have their phone or anything else go on my website and they look at carvings and they can't believe it. They have this sense of surprise. Not because we've seen religious art being made today, which you look at it and you just want to pass by, but there's something about. I think it really is the same desire that you expressed at the beginning, this desire to both capture something universal but also join it with something very particular, something that is very grounded. And that little hint of something no one has seen before. Like something a little bit hint of that. Yeah, yeah. Even the. Like, the carvings that we're doing now, this mix of stones and everything, you know, no one has ever done that before. It's actually totally new. We don't have historical examples of it, but when you look at them, you think. You feel totally at home. You feel like, yeah, this is something that should have been made a thousand years ago. Maybe it wasn't, but here it is being made today. So, yeah, I always feel like we're the luckiest people in the world when we're doing what we're doing. Like, I wouldn't have thought that it was possible. So it's great that we're able to do it. So what is your. I mean, I think that that's maybe something to talk about, because one of the things that I feel that's happening is that there is a renewal of interest in some of this vision. We've seen it in something in the hipster movements, in the steampunk aesthetics that we've seen, this desire to recapture the old world in a manner which is both connected to it, but also there's a freshness to it at the same time. So maybe you can talk a little bit about how you see that, because here at Charleston there is. How's it."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2070.02,"end":2295.88,"speaker":"Andrew Gould","text":"The school of the American College of the Building Arts, Right? Yeah, yeah. There's this new college in Charleston that I serve on the advisory board. It's the American College of the Building Arts and it's a liberal arts four year undergraduate college and it grants degrees in timber framing, architectural carpentry, blacksmithing, plastering, masonry, bricklaying, stone carving. They've now just added a major in classical drafting. Classical architecture Drafting. Decorative finishes is coming next. So students can actually go there to get a bachelor's degree in college and come out with this practical skill set that lets them immediately get a job and work at a very high level in these fields. And this college has, I think, about the highest job placement rate of any college in America. I mean, everybody who comes out of this college immediately gets a well paying job in their field of choice because there's so much need for people who can do these things, not only for restoring old buildings, but for building new buildings. And there's a shortage of craftsmen who can do it. But there's a big revival of interest in it. There's quite a lot of architects who design good traditional buildings and need people who can build these things. And yeah, I'm quite heartened, actually. I think things are getting better, not worse, with regards to the quality of design and craftsmanship. You may have to know where to look. It may only be a tiny, tiny miniscule percentage of all the work being done that's actually good, beautiful work. But if you look in the right place, if you look for it, the work being done nowadays is as good as any work that's ever been being done. And there's more and more people every year who know how to do it. Of course, we see this in our field of Orthodox liturgical arts. I mean, the, the iconography and the architecture being done in the Russian Church right now in many ways is better than it ever has been, better than it was centuries ago. Which is astonishing to see that it can flourish in this day and age to that extent. And the same is true of many kinds of craftsmanship. And it's fed by, as you said, this larger interest among the sort of hipster generation in, in the retro aesthetic. You know, it often takes a superficial form. You know, we can see it in graphic design and in the sort of posters for events that look like they're out of the old west or out of the Roaring twenties. And, you know, here in Charleston, every new bar and restaurant looks like it's from the 1920s. It's all marble and polished brass and, you know, bartenders wearing vests and bow ties and, you know, playing swing dance music and so forth. You know, it's really charming to see because, you know, that's a beautiful aesthetic and it actually means something. You know, you can. You know, I can see the appeal of it because you don't have to invent yourself. You know, if you're drawn to that aesthetic, you know, you can put on the outfit and you can step into that bar and you can order that cocktail, and all of a sudden there's a whole galaxy of aesthetic references and romantic associations that you put onto yourself that you can enjoy that evening. And that is so much more fun than the modern vision of a building. It's just a white box, and."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2297.88,"end":2298.16,"speaker":"Jonathan Pageau","text":"You."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2298.16,"end":2308.76,"speaker":"Andrew Gould","text":"Have to invent everything from scratch. Who has the time for that? Who has the time to invent their entire self image and aesthetic taste Ex nihilo?"}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2308.92,"end":2350.89,"speaker":"Jonathan Pageau","text":"Yeah. So maybe I'm thinking maybe the last question I'd like to ask is you tell me a little bit about the beer store. One of the things that you did in Charleston is that you designed the beer store. And it's an absolute. It's marvelous on one end. It's a crazy space. You walk in there and it feels completely surreal, but it also has that same feeling of also feeling like it's been there forever, but. Or that it just belongs there. So maybe you can tell us a little bit about how you thought of this, how you were able to think of even proposing a beer store that would look like that."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2351.29,"end":2459.32,"speaker":"Andrew Gould","text":"Well, it's funny, there's a developer here in Charleston who had built a very fine restaurant, Edmund's Ost. And he gave it kind of an 18th century historical reference in its name and in its style of design. And then there was a. He decided they wanted to open a craft beer and wine store attached to the restaurant, and they wanted it to be kind of a showpiece of architecture because he owns a lot of property in the neighborhood and wants to kind of bring up the standards of development in this kind of formerly industrial area that doesn't have a lot of good buildings. So anyway, he asked me to design the beer and wine store and pretty much gave me carte blanche to do anything I wanted, which is very unusual. So I give him a lot of credit for Having that vision that just a beer store could be the building that brings up the whole neighborhood and makes it an actual center of commercial life for blocks around. But that was his idea. So I basically put into practice all of the ideas I've developed for designing Orthodox churches, because a lot of them just happen to apply really well here. The idea that you don't have any windows on the walls, that the light comes down from above through a cupola worked really well because we needed the walls to be lined with shelving instead of having windows on them. And I did the whole interior in timber frame because I'm not really sure how to explain it, but everybody seems to intuitively know that beer goes for beer goes obvious to people."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2461.08,"end":2461.56,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2463,"end":2542.78,"speaker":"Andrew Gould","text":"And just, you know, the appearance of all the bottles of beer and wine on the shelves is so beautiful because they all have different colored labels and different shaped bottles. So I realized I don't need any color in this building because the beer and wine bottles get all of the color and texture. So I did everything on the inside in just oiled pine. And I wanted the details to look really handmade. So the closer you get up to the shelves and to the timbers, you can just see everybody's craftsmanship. So I designed these turned columns to hold up all of the shelves. There's over 300 of them that this local lady who's a woodturner made on her lathe is. And then the outside, I did the building in solid masonry, and I used salvaged antique brick to build the arches because I wanted it to have that organic quality that old brick has that's really hard to find in new brick. And I had to teach the masons how to do that because they'd never actually built big structural arches out of brick, because nobody does that anymore. Yeah, it was a really fun project. And I kind of. I coordinated all the craftsmen, many of whom were from the College of the Building Arts. They built the timber framing and all the interior carpentry for me."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2544.38,"end":2552.3,"speaker":"Jonathan Pageau","text":"Yeah, because it feels. When you go in there, it feels like you're walking into, like, an alchemical store or something. Something that's selling magical books."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2552.3,"end":2572.86,"speaker":"Andrew Gould","text":"Yes, it does seem that way, because it really shows off the bottles almost as artwork. Yes, exactly that way. But not like a modern white painted art gallery, but more like artwork in a. Like going into the Chamber of Exotic Treasures in, like, a baroque aristocrat's palace."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2573.18,"end":2573.9,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2573.9,"end":2651.1,"speaker":"Andrew Gould","text":"That's kind of the quality I wanted. You know, everything seems fun and mysterious. Yeah. And it's funny because the space has such formality with the cupola and the extreme symmetry of the timber frame in there and everything being handmade. People react really quite peculiarly when they go in there. For one thing, they go in there and they have hushed voices, like when they go to a church. Yeah. They kind of realize that there's something almost sacred about there, and they don't want to talk loudly. They just look and then they won't leave. Especially when the store first opened and people were all in there for the first time. There was this funny phenomenon where. Where people would go in and they'd buy their beer and they'd be standing there and they'd have their basket and they'd have bought it, and they'd just be standing there. And then some salesperson would come up to them and say, do you need anything? Can I help you? And they'd say, oh, I guess I was leaving. And it just kept happening and happening. And the store was full of people just standing there looking at the village, looking at it and not knowing what they're supposed to do next. It's kind of like in a church service when nobody will leave until the priest gives the dismissal and it's time to leave. They want to be told when it's time to go."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2651.1,"end":2651.46,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2651.46,"end":2653.74,"speaker":"Andrew Gould","text":"It's okay. It's a funny. It's a funny phenomenon."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2653.9,"end":2658.98,"speaker":"Jonathan Pageau","text":"That's amazing. That's totally amazing. Well, it shows you the power of what architecture can do, that's for sure."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2658.98,"end":2659.58,"speaker":"Andrew Gould","text":"That's right."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2659.9,"end":2680.68,"speaker":"Jonathan Pageau","text":"All right, Andrew, thank you so much. Thank you so much. This has been a lot of fun. I hope we'll have to figure out another. Another discussion. One of the things we wanted to talk about, which I said we shouldn't, is the relationship between orthodoxy and piracy. And so maybe our next discussion can be. I mean, Andrew even actually brought his pirate hat because I was hoping we."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2680.68,"end":2682.6,"speaker":"Andrew Gould","text":"Were going to have time to discuss that."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2684.52,"end":2692.12,"speaker":"Jonathan Pageau","text":"So our next conversation is going to be about the relationship between orthodoxy and piracy. Okay. I promise you guys. So thanks, Andrew. It was great to have you."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2692.12,"end":2693.12,"speaker":"Andrew Gould","text":"All right. Thank you, Jonathan."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2693.12,"end":2749.45,"speaker":"Jonathan Pageau","text":"All right, thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio form format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast so share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #048 - 2019-08-10 - Andrew Gould - Beauty and Meaning Today","start":2749.61,"end":2750.49,"speaker":"Andrew Gould","text":"I'll see you soon."}
